{
    "label": "Eldamon Feats",
    "mapping": {
        "name": "name",
        "description": "system.description.value"
    },
    "folders": {},
    "entries": {
        "Additional Elemental Powers": {
            "name": "Additional Elemental Powers",
            "description": "<p>You know more elemental powers than other elemental avatars, allowing you to adjust your abilities more easily each day to match the situation. You learn two additional elemental powers of your choice of your level or lower. As normal, they must be powers of your element or universal powers, you can't use this feat to learn an ultimate power, and even if you retrain into this feat, the powers you learn are limited by the level of the feat you used, not your current level after retraining. This doesn't give you the ability to prepare more elemental powers at the same time, it simply provides you more options to choose from when preparing each day.</p>\n<hr />\n<p><strong>Special</strong> You can take this feat multiple times. Each time you do, you learn two additional elemental powers of your level or lower.</p>"
        },
        "Advanced Embodiment": {
            "name": "Advanced Embodiment",
            "description": "<p>You gain one elemental avatar feat. For the purpose of meeting its prerequisites, your elemental avatar level is equal to half your character level.</p>\n<hr />\n<p><strong>Special</strong> You can select this feat more than once. Each time you select it, you gain another elemental avatar feat.</p>"
        },
        "Advanced Friendship": {
            "name": "Advanced Friendship",
            "description": "<p>You gain one eldamon trainer feat. For the purpose of meeting its prerequisites, your eldamon trainer level is equal to half your character level.</p>\n<hr />\n<p><strong>Special</strong> You can select this feat more than once. Each time you select it, you gain another eldamon trainer feat.</p>"
        },
        "Advanced Training": {
            "name": "Advanced Training",
            "description": "<p>You've trained your eldamon to greater heights. You gain the advanced training class feature. This means that your eldamons' proficiency bonus to their untrained skills becomes equal to their level, and your eldamon gain four attribute boosts, one to each of their four lowest attribute modifiers. This typically increases their four lowest modifiers from +2, +1, +0, and –1 to +3, +2, +1, and +0. By training side by side, you improve your own capabilities, not just your eldamons'. This allows you to prepare to phase three eldamon each day, instead of two, as long as your Charisma modifier is at least +3.</p>\n<p>Additionally, your effective level for the purpose of determining their powers' damage, counteract level, and other scaling benefits (like temporary Hit Points and range), as well as for determining what powers they can use, increases to your level – 5.</p>"
        },
        "Avatar Form": {
            "name": "Avatar Form",
            "description": "<p>You infuse your body with the features of the eldamon residing within your soul, and at the same time, you increase your size with pure elemental energy, transforming you into an enormous hybrid between your original form and the eldamon you embody. You grow to Large size, if your size is normally smaller than Large, and your reach increases to 10 feet if it's normally less than 10 feet. Your Large form is still roughly humanoid in shape but bears distinctive features paralleling the eldamon within you, such as gaining ears, a squirrel face, or a bushy flaming tail if the eldamon within you is a squirrelash. This transformation lasts until you use Avatar Form again to return to your usual form.</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.9R6V87boJshn3Gie]{Effect: Avatar Form}</p>"
        },
        "Avatar's Reaction": {
            "name": "Avatar's Reaction",
            "description": "<p>You learn how to use your element's reactions. You gain the 1st level reactive power of your element, and you can prepare one reactive power each day.</p>"
        },
        "Basic Embodiment": {
            "name": "Basic Embodiment",
            "description": "<p>You gain a 1st- or 2nd-level elemental avatar feat of your choice.</p>"
        },
        "Basic Friendship": {
            "name": "Basic Friendship",
            "description": "<p>You gain a 1st- or 2nd-level eldamon trainer feat of your choice.</p>"
        },
        "Clinging Element": {
            "name": "Clinging Element",
            "description": "<p>You alter an elemental power causing the flashy elemental energies from the visual manifestations to cling to your foes. If the next action you use is to channel an elemental power, any foe damaged by the elemental power is also @UUID[Compendium.battlezoo-eldamon-pf2e.conditions.Item.5tWqbv3Iu1FlrOx6]{Limned} by clinging elemental energies until the end of your next turn. If you critically hit the foe or the foe critically failed their save against the power, they're limned for 1 minute and @UUID[Compendium.pf2e.conditionitems.Item.TkIyaNPgTZFBCCuh]{Dazzled} for 1 round instead. Visible creatures can't be @UUID[Compendium.pf2e.conditionitems.Item.DmAIPqOBomZ7H95W]{Concealed} while limned in this way. If the creatures are @UUID[Compendium.pf2e.conditionitems.Item.zJxUflt9np0q4yML]{Invisible}, they are only concealed while limned by clinging elemental energies, rather than being undetected or @UUID[Compendium.pf2e.conditionitems.Item.iU0fEDdBp3rXpTMC]{Hidden}.</p>"
        },
        "Compact Phase": {
            "name": "Compact Phase",
            "description": "<p>You and your eldamon friends understand that forms are transient, allowing you to phase in eldamon at smaller sizes than normal, potentially allowing them to fit more easily into smaller spaces. When you or your eldamon uses Phase Eldamon, your eldamon can take any size up to the normal size for the eldamon's battle form (or evolved form, if appropriate).</p>"
        },
        "Deep Transcendence": {
            "name": "Deep Transcendence",
            "description": "<p>Your transcendent elemental energies run deeper through your body, mind, life force, and soul than a normal elemental avatar, opening strange elemental pathways and connections. This grants you numerous additional powers that most would consider unusual for your element. You learn four elemental powers chosen from the list of the second element you selected when you gained the transcend element class feature. The first of those powers must be 3rd level or lower, the second one must be 7th level or lower, the third must be 11th level or lower, and the last power must be 15th level or lower. Like the powers you learned from the transcend element class feature, these become powers of your element, though otherwise the powers have their normal effects.</p>"
        },
        "Delayed Element": {
            "name": "Delayed Element",
            "description": "<p>You delay an elemental power for later. Choose a number of rounds, up to 1 minute. If the next action you use is to channel an elemental power, instead of happening instantly, the power takes effect after the chosen number of rounds or when you refresh, whichever comes first. You choose the power's area and make other decisions when you channel the power, not when it comes into effect. Depending on the situation, that could cause the power to have no effect (such as if the target is out of range, or if you delay until you Refresh and the power ends when you Refresh).</p>"
        },
        "Demoralizing Element": {
            "name": "Demoralizing Element",
            "description": "<p>You alter your elemental power specifically to sow terror in your targets. If the next action you use is to channel an elemental power, you can roll a @UUID[Compendium.pf2e.actionspf2e.Item.2u915NdUyQan6uKF]{Demoralize} attempt against each foe that fails their save against the power, or that you hit with your power attack roll. The foes do not need to be within 30 feet. Afterward, whether you Demoralize them or not, the foes are all temporarily immune to your Demoralizing Element for 10 minutes.</p>"
        },
        "Diffusive Effusion": {
            "name": "Diffusive Effusion",
            "description": "<p>When you spill out effusive elemental energy, you can do so in a much wider area, allowing you to test more than one creature for elemental resistance. When you use the elemental effusion class feature, you can use it against all foes you can perceive within 120 feet, rather than a single foe within 60 feet.</p>"
        },
        "Disruptive Siphon": {
            "name": "Disruptive Siphon",
            "description": "<p>When you siphon an elemental power, you significantly disrupt creatures that match your element. When using the Siphoning Element action, you deal full damage to creatures with a trait matching any of your element's associated traits.</p>"
        },
        "Distracting Element": {
            "name": "Distracting Element",
            "description": "<p>You alter an elemental power in order to distract foes who are otherwise immune. If the next action you use is to channel an elemental power, you can aim the surges of power in a way to distract any foes who are immune to the power's main effects. If you hit with your attack roll or they fail their saving throw, you choose whether to make immune creatures @UUID[Compendium.pf2e.conditionitems.Item.TkIyaNPgTZFBCCuh]{Dazzled} until the end of your next turn or offguard until the end of your next turn. On a critical hit with your attack roll or a critical failure on their saving throw, the dazzled or @UUID[Compendium.pf2e.conditionitems.Item.AJh5ex99aV6VTggg]{Off-Guard} condition lasts for 1 minute</p>"
        },
        "Divert Usurper": {
            "name": "Divert Usurper",
            "description": "<p><strong>Frequency</strong> once per 10 minutes</p>\n<p><strong>Trigger</strong> You fail a saving throw against a death effect, mental effect, or spirit effect.</p>\n<hr />\n<p>You've built up such a strong relationship with the eldamon inside you that it's willing to divert effects aimed to usurp your life force, mind, or spirit. Reroll the triggering saving throw as the eldamon within you takes on some of the effects into itself, taking the better of the two results. The eldamon then becomes quiescent, metabolizing the effects over the next 10 minutes. If you still fail (or critically fail) the second saving throw, you can choose to push even more of the effect onto the eldamon and improve your degree of success to one better than the better of the two results you rolled, but if you do, you can't use elemental powers for 10 minutes.</p>"
        },
        "Double Team": {
            "name": "Double Team",
            "description": "<p><span class=\"action-glyph\">2</span> or <span class=\"action-glyph\">3</span></p>\n<p><strong>Frequency</strong> once per hour</p>\n<p><strong>Requirements</strong> You are phased out and one of your trained eldamon is phased in; you and your eldamon haven't acted yet this turn.</p>\n<hr />\n<p>You've mastered a difficult technique, allowing you to briefly phase in a second eldamon to use a single power. A second eldamon phases in next to your currently phased in eldamon and uses a single active power with a number of actions matching the number of actions you spent on Double Team. It then phases out. Neither eldamon can use an elemental surge this turn. You can use this action even when you're phased out, even though you normally can't act when phased out.</p>"
        },
        "Echoing Element": {
            "name": "Echoing Element",
            "description": "<p><strong>Frequency</strong> once per hour</p>\n<hr />\n<p>By using patterns of elemental energy you stored up within your body, mind, life force, or spirit in advance, you're able to manifest an elemental power in perfect alignment with the local elemental energies. This allows you to use that same power again without needing to refresh your elemental powers first. If the next action you use is to channel an elemental power, you can use that power again without Refreshing. Echoing Element still doesn't allow you to use ultimate powers more often than the usual limit of once per hour, so it typically isn't useful for you to use Echoing Element with your ultimate power.</p>"
        },
        "Effusive Element": {
            "name": "Effusive Element",
            "description": "<p>You surround yourself with flashy and eye-catching element energies and effects, distracting your foes. If the next action you use is to channel an elemental power, any creature that attempts to use a reaction triggered by channeling the power takes a –2 circumstance penalty to checks rolled as part of the reaction due to the distraction (this penalty applies to DCs used as part of the reaction as well). In addition, creatures you hit with the power or that fail their saving throws against the power are @UUID[Compendium.pf2e.conditionitems.Item.AdPVz7rbaVSRxHFg]{Fascinated} with you until the start of your next turn.</p>"
        },
        "Eldamon Coordinator": {
            "name": "Eldamon Coordinator",
            "description": "<p>You arrange your entourage of eldamon friends to present them in a way that is interesting, fashionable, cute, or otherwise visually striking. When you select this feat, choose a visual theme for your eldamon, though you can change it later depending on the way you change your eldamon entourage. When you @UUID[Compendium.pf2e.actionspf2e.Item.OX4fy22hQgUHDr0q]{Make an Impression}, you can choose to compare your Diplomacy check result to the Will DCs of an additional number of targets equal to your number of prepared eldamon (typically three more targets for a total of four at 1st level). When you do so, your prepared eldamon primp, preen, pose, and otherwise influence the other targets while you speak, granting you a +1 circumstance bonus on the Diplomacy check. You can use Performance to @UUID[Compendium.pf2e.actionspf2e.Item.EEDElIyin4z60PXx]{Perform} or stage a performance by showing off your eldamon. When you do, your eldamon serve just as well as the finest musical instruments. If you have the advanced training class feature, you gain a +1 item bonus on your Performance checks when using your eldamon in this way, and the bonus increases to +2 if you have the eldamon evolution class feature and +3 if you have the eldamon monster class feature. You share this item bonus with your eldamon.</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.YEWGswyBumRaCkhw]{Effect: Eldamon Coordinator}</p>"
        },
        "Eldamon Evolution": {
            "name": "Eldamon Evolution",
            "description": "<p>You've learned how to help your eldamon evolve. You gain the eldamon evolution class feature. Each eldamon has evolution conditions, and this means that if you meet them, the eldamon gains a new evolved battle form. This evolved form gains increased proficiencies and an attribute boost to the eldamon's three highest attribute modifiers, as well as a new special ability.</p>\n<p>By working hard with your eldamon to reach their evolution thresholds, you come to understand your own limits as well. This allows you to prepare to phase four eldamon each day, instead of three, as long as your Charisma modifier is at least +4.</p>\n<p>Additionally, your effective level for the purpose of determining their powers' damage, counteract level, and other scaling benefits (like temporary Hit Points and range), as well as for determining what powers they can use, increases to your level – 3.</p>"
        },
        "Eldamon Exploration": {
            "name": "Eldamon Exploration",
            "description": "<p>You've learned how to manipulate your conduit with your eldamon to keep them active during exploration without slowing the group down. You can choose an exploration activity for one of your eldamon to perform instead of you, without needing to slow down so that you can catch back up to your eldamon.</p>\n<hr />\n<p><strong>Special</strong> If you gain the melded phase class feature, you no longer need the Eldamon Exploration feat to have your eldamon perform exploration activities freely, since you can just meld into your eldamon, and so you can freely retrain this feat without taking any downtime to do so.</p>"
        },
        "Eldamon Flexibility": {
            "name": "Eldamon Flexibility",
            "description": "<p>Your attunement to your eldamon is flexible, allowing you to shift which eldamon are prepared to phase in with relative ease. By spending 10 minutes interacting with and attuning to one of your eldamon you didn't prepare to phase in, you prepare to phase in that eldamon, replacing one of the eldamon you previously prepared to phase in that day.</p>"
        },
        "Eldamon Intimidation": {
            "name": "Eldamon Intimidation",
            "description": "<p>You’ve perfected the use of your phased out eldamon friends to unnerve your foes. When you Coerce or Demoralize, you can choose to compare your Intimidation check result to the Will DCs of an additional number of targets equal to your number of prepared eldamon (if your key attribute modifier is +4 or higher, this is typically four more targets for a total of five at 10th level). If you use your eldamon to Demoralize in this way, Demoralize loses the auditory trait and gains the visual trait, and you don’t take a penalty if the creature doesn’t understand your language. After using this feat to attempt to Demoralize a creature, the creature becomes temporarily immune to your eldamon intimidation for 1 minute.</p>"
        },
        "Eldamon Trainer Dedication": {
            "name": "Eldamon Trainer Dedication",
            "description": "<p>You can temporarily phase in your eldamon friends, allowing them to perform an elemental power and affect other creatures in phase with the physical world, though you're diverting your focus, so you can prepare to phase one fewer eldamon friends than a focused trainer. Each day, choose a number of your eldamon friends that is either 2 or your Charisma modifier, whichever is lower. Throughout the day, you can phase them in to fight for you. You gain the Incarnate Eldamon feat, which is the only way you can phase in an eldamon; you can never gain Phase Eldamon or other feats or features that phase yourself out or your eldamon in. Because your connection is less stable than a dedicated eldamon trainer when you phase in an eldamon in this way, they take a –2 penalty to their power attack rolls and power DCs, and they're limited in which powers they can use, and those powers' effects. They can only use powers whose level are at most half your level, and their effective level for the purpose of determining their powers' damage, counteract level, and other scaling benefits (like temporary Hit Points and range), is equal to half your level (or their level if it is lower, but eldamon usually level up alongside their friends). For instance, at 6th level, your eldamon's maximum effective level would be 3, so could use up to a 3rd level power, their powers would have a counteract level of 2, and if their power deals @Damage[1d6[untyped]] damage plus @Damage[1d6[untyped]] damage for each level they have, they would deal @Damage[4d6[untyped]] damage. As normal, when an eldamon phases out in this way, they Refresh.</p>\n<p>Like other characters with eldamon friends, since you don't gain the eldamon trainer's advanced training, eldamon evolution, or apex training class features, your eldamon's attribute modifiers remain at their starting values until 17th level and then gain a final attribute boost to Wisdom, raising Wisdom to +5.</p>\n<hr />\n<p><strong>Special</strong> You can't select another dedication feat until you have gained two other feats from the eldamon trainer archetype.</p>"
        },
        "Eldwalker": {
            "name": "Eldwalker",
            "description": "<p>Your extensive phasing in and out of reality and connection with your eldamon friends allows you to become one with the elements, melding into other states of reality.</p>\n<ul>\n<li>First, eldamon and elemental creatures innately sense your connection to eldamon and the elements, which often affords you a great deal of respect.</li>\n<li>Second, if you conduct the @UUID[Compendium.pf2e.spells-srd.Item.7DN13ILADW2N9Z1t]{Commune} ritual using the Nature skill to contact local elemental spirits and vitae, you don't have to pay any cost and you automatically get a critical success.</li>\n<li>Third, once per day each, you can cast @UUID[Compendium.pf2e.spells-srd.Item.5bTt2CvYHPvaR7QQ]{Interplanar Teleport} as a primal innate spell to travel to the Elemental Planes or other planes associated with eldamon, and to travel back to the point you left when using this <em>interplanar teleport</em>. When you cast it this way, its casting time is 1 minute and you act as the tuning fork for the spell.</li>\n</ul>"
        },
        "Elemental Apotheosis": {
            "name": "Elemental Apotheosis",
            "description": "<p><strong>Frequency</strong> once per day</p>\n<hr />\n<p>You draw upon the full elemental potential of the eldamon within you, reforging yourself into a powerful composite being far greater than the sum of your parts. While within the throes of your elemental apotheosis, elemental energies swirl around you, your eyes glow with a color associated with your element, and other visual features of the transformation make your overflowing elemental energy abundantly clear to everyone around you. This apotheosis lasts for 1 minute, during which time you gain a +4 status bonus to attack rolls, skill checks, and saving throws, as well as 40 temporary Hit Points. When the apotheosis ends, your body must recover from the shock of overloading yourself with elemental energy. You become @UUID[Compendium.pf2e.conditionitems.Item.HL2l2VRSaQHu9lUw]{Fatigued} and you take a –2 penalty to your power attack rolls and power DCs; both effects end after you rest for 10 minutes to give your body time to recover.</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.kw4f5rU0SeLLOasj]{Effect: Elemental Apotheosis}</p>"
        },
        "Elemental Avatar Dedication": {
            "name": "Elemental Avatar Dedication",
            "description": "<p>Choose an elemental avatar element. You gain the elemental manipulation feature for that element, and you learn one of the element's 1st-level active powers. Each day, you can prepare one active power of your element, and you can use that power. You're trained in power attack rolls and power DCs. You can't take the Refresh activity normally or via a refresh power, though you still refresh your powers automatically after an encounter or stressful situation is over, like other elemental avatars. Your effective level for the purpose of determining their powers' damage, counteract level, and other scaling benefits (like temporary Hit Points and range), as well as for choosing new powers to gain (typically from Elemental Avatar feats or archetype feats), is equal to half your level. For instance, at 6th level, your effective level would be 3, so you could learn up to a 3rd level power, your powers would have a counteract level of 2, and if they deal @Damage[1d6[untyped]] damage plus @Damage[1d6[untyped]] damage for each level you have, they would deal @Damage[4d6[untyped]] damage. At every even level, you can replace one of the active powers you know with a different active power up to your effective level. You don't gain any of the other abilities or benefits of the element you chose.</p>\n<hr />\n<p><strong>Special</strong> You can't select another dedication feat until you have gained two other feats from the elemental avatar archetype.</p>"
        },
        "Elemental Conformation": {
            "name": "Elemental Conformation",
            "description": "<p>You accept your eldamon's energy into your body's fundamental makeup, causing your appearance and internal structure to change in ways related to your element, such as gaining burning or freezing blood. Each time you're critically hit, attempt a @Check[type:flat|dc:16]. On a success, it becomes a normal hit. Additionally, you gain resistance to precision damage equal to your level; as normal, if the resistance is higher than the amount of additional precision damage, it reduces the additional damage to 0 but doesn't reduce the attack's normal damage.</p>"
        },
        "Elemental Display": {
            "name": "Elemental Display",
            "description": "<p>You can intimidate creatures by calling forth impressive displays of your element. When you do, you can @UUID[Compendium.pf2e.actionspf2e.Item.2u915NdUyQan6uKF]{Demoralize} without the auditory trait. In this case, your Demoralize attempt gains the visual trait, and you don't take a penalty if the creature doesn't understand your language. If you Demoralize in this way after using an active elemental power, you gain a +1 circumstance bonus to the check to Demoralize, or a +2 circumstance bonus if you're a master in Intimidation.</p>"
        },
        "Elemental Flexibility": {
            "name": "Elemental Flexibility",
            "description": "<p>Your elemental power is incredibly flexible, allowing you to attune with the eldamon within your body and soul to change up your available powers on the fly. By attuning with the eldamon inside you for 10 minutes, you reprepare your elemental powers for the day, choosing a new set of powers from the powers you know, just like your normal selection during your daily preparations.</p>"
        },
        "Elemental Locomotion": {
            "name": "Elemental Locomotion",
            "description": "<p>You've practiced using your element day in and day out throughout your life, and you've developed new ways to move yourself around via your element's energies. You gain the elemental locomotion ability listed in your element.</p>"
        },
        "Elemental Permanence": {
            "name": "Elemental Permanence",
            "description": "<p>Each time you Refresh, you can choose to exclude one active power that normally lasts until you Refresh, allowing its effects to continue in exchange for not becoming ready for you to use it again. If you continue to choose the same power when you Refresh, you can continue to extend it, making the effects semi-permanent until you Refresh and choose not to extend that power. You can only have one active power extended this way at a time, and its effects end immediately when it is no longer part of your currently available set of powers, for instance if you reprepare your powers to no longer include it, or if you switch your set of powers to no longer include it using Elemental Flexibility, Infinite Flexibility, or a similar ability. This feat has no effect on anything else that lasts until you refresh, such as plants sowed by the wood element.</p>"
        },
        "Elemental Reflexes": {
            "name": "Elemental Reflexes",
            "description": "<p>The eldamon within you helps you respond to the battle around you, allowing you to use your reactive powers more easily. At the start of each of your turns, you gain an additional reaction, which you can only use for your reactive elemental powers.</p>"
        },
        "Elemental Resistance": {
            "name": "Elemental Resistance",
            "description": "<p>Your connection to your element grants you distinctive resistances and defensive abilities, as your body, mind, and soul reconfigure to withstand your element better. You gain the elemental resistance effect listed for your element.</p>"
        },
        "Elemental Scholar": {
            "name": "Elemental Scholar",
            "description": "<p>You have a deep knowledge of your element, which allows you to notice, understand, and defend against manifestations of your element. You can identify creatures with your element's associated trait or traits (or other creatures heavily associated with your element as determined by the GM) using Nature, instead of the normal skill used to Recall Knowledge about such creatures, and you can always roll Nature for initiative against such creatures. You gain a +2 circumstance bonus to Nature checks to Recall Knowledge about such creatures and on initiative rolls against such creatures. Furthermore, your deep knowledge about your element grants you a +2 circumstance bonus to Perception checks and saving throws against such creatures.</p>"
        },
        "Elemental Sculptor": {
            "name": "Elemental Sculptor",
            "description": "<p>Your deeper connection to your element allows you to sculpt it to your will. This allows you to produce the elemental sculptor effect listed in your element. Elemental Sculptor gains the trait corresponding to your element. If you use Elemental Sculptor on a magical effect created by another creature, you must succeed at a counteract check against the effect's counteract DC, with a modifier of your power DC – 10 and a counteract level of half your level rounded up.</p>"
        },
        "Elemental Senses": {
            "name": "Elemental Senses",
            "description": "<p>Your connection to your element enhances your senses, either imbuing new features to your existing senses or granting you new senses altogether. You gain the elemental senses benefit listed for your element.</p>"
        },
        "Elemental Shield": {
            "name": "Elemental Shield",
            "description": "<p>You've learned how to use your element to defend yourself. You gain the @UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.ZY4eKLzGrU2WmMGF]{Elemental Shield} feature with the effects based on your element.</p>"
        },
        "Elemental Steps": {
            "name": "Elemental Steps",
            "description": "<p>You train and motivate your eldamon friends to move more swiftly and deftly, making it easier for them to get into position. All your trained eldamon increase their Speeds by 5 feet. Additionally, they can Step into difficult terrain.</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.DOySXD5ixhweBh0J]{Effect: Elemental Steps}</p>"
        },
        "Elemental Throes": {
            "name": "Elemental Throes",
            "description": "<p><strong>Trigger</strong> You are reduced to 0 Hit Points and would fall @UUID[Compendium.pf2e.conditionitems.Item.fBnFDH2MTzgFijKf]{Unconscious} (but not die)</p>\n<hr />\n<p>You hold so much elemental energy within you that it can't help but burst out when you're laid low. You deal @Damage[max(floor(@actor.level/2),7)d6[untyped]] damage of your element's associated damage type (or one of the damage types of your choice if your element has multiple damage types) to all creatures within a 30- foot radius emanation, with a @Check[type:reflex|dc:resolve(@actor.system.proficiencies.classDCs.eldamon.dc)|basic:true] save against your power DC. At 16th level, the damage increases to 8d6, at 18th level, the damage increases to 9d6, and at 20th level, the damage increases to 10d6.</p>\n<hr />\n<p><strong>Special</strong> If you die, Elemental Throes activates whether you want it to or not, without spending a free action. This could cause it to activate twice in the same turn if you first fall unconscious and then die later that turn.</p>"
        },
        "Elemental Tongue": {
            "name": "Elemental Tongue",
            "description": "<p>You've learned how to speak a variety of languages in order to communicate with your eldamon. You learn any 3 of the following languages. At 3rd level and every two levels thereafter, you learn another of the languages: Aetheran, Astral, Chronan, Cryan, Jyoti, Khaotan, Luxan, Melodian, Muan, Petran, Pyric, Requian, Shadowtongue, Soman, Spirituan, Sussuran, Talican, Thalassic, Venenan, Voltan</p>\n<hr />\n<p><strong>Special</strong> You can take this feat twice, learning different languages each time.</p>"
        },
        "Emergency Phase": {
            "name": "Emergency Phase",
            "description": "<p><strong>Requirements</strong> You are phased out, one of your trained eldamon is phased in, and you are able to Phase Eldamon</p>\n<p><strong>Trigger</strong> Your phased in eldamon fails or critically fails a saving throw.</p>\n<hr />\n<p>You quickly phase your eldamon out and phase yourself back in, using the shift to attempt to disrupt your eldamon's impending disaster. Reroll the triggering saving throw and use the better of the two results. Your phased in eldamon phases out and you phase back in. You can use this free action even when you're phased out, even though you normally can't act when phased out.</p>"
        },
        "Empowered Spells": {
            "name": "Empowered Spells",
            "description": "<p>The overwhelming elemental energies swirling through you empower spells you gain from your ancestry or other sources that match your element, either based on their trait or as determined by your GM. When you Cast a Spell that matches your element, you can use your power DC or your spell DC to determine the spell's DC, whichever is higher. If the spell has a spell attack roll, you can use your power DC – 10 or your spell attack modifier to determine the spell attack modifier, whichever is higher. You can't use your power attack modifier for spells, and these benefits don't apply to spells that don't match your element.</p>"
        },
        "Enduring Shield": {
            "name": "Enduring Shield",
            "description": "<p>You can keep up your elemental shield until you refresh, leaving you more room to maneuver while staying defended. When you use Elemental Shield, it lasts until you refresh, instead of until the beginning of your next turn.</p>"
        },
        "Enhanced Familiar": {
            "name": "Enhanced Familiar",
            "description": "<p><strong>Eldamon Trainer</strong> You infuse your familiar with additional elemental energy. You can select four familiar or master abilities each day, instead of two.</p>\n<p><strong>Elemental Avatar</strong> You infuse your familiar with additional elemental energy from the eldamon within you. You can select four familiar or master abilities each day, instead of two.</p>"
        },
        "Enhanced Locomotion": {
            "name": "Enhanced Locomotion",
            "description": "<p>You've continued to develop your locomotive abilities using your element, granting you even more impressive abilities. You gain the enhanced locomotion ability listed in your element.</p>\n<hr />\n<p><strong>Special</strong> The power of air is heavily associated with mobility, making it easier for an air elemental avatar to fly than it is for users of other elements. If your element is air, this feat has a level prerequisite of 10th level, instead of 12th.</p>"
        },
        "Enhanced Resistance (Eldamon Trainer)": {
            "name": "Enhanced Resistance (Eldamon Trainer)",
            "description": "<p>You train your eldamon friends to enhance their natural eldamon resistances, making it harder to overload them with their own element or overcome them with an elemental they already resist. Your eldamon increase their natural eldamon resistances based on their element from an amount equal to their level to an amount equal to one and a half times their level, starting at resistance 3 at 2nd level and ending at resistance 30 at 20th level.</p><hr /><p><em>Note: Place the @UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.B3OlVFaGFavlGEWe]{Enhanced Resistance (Eldamon)} feature on each of your eldamon</em></p>"
        },
        "Enhanced Resistance (Elemental Avatar)": {
            "name": "Enhanced Resistance (Elemental Avatar)",
            "description": "<p>Your elemental resistance is especially strong, as you become physically and spiritually closer to the eldamon within you. If your element's effects from Elemental Resistance grant you resistance to certain damage types (or damage from effects with certain traits) equal to half your level, increase those resistances to be equal to your level instead.</p>"
        },
        "Evolved Colossus": {
            "name": "Evolved Colossus",
            "description": "<p>You've helped your evolved eldamon learn how to reach truly preposterous sizes. When you or your eldamon use Phase Eldamon to phase in an eldamon in their evolved battle form, you can choose to phase them into a Gargantuan evolved battle form instead of their evolved battle form's normal size. When you do, your eldamon has a reach of 20 feet (unless its reach is normally greater). If the evolved battle form was normally Huge, your eldamon has a reach of 25 feet in the Gargantuan battle form instead (unless its reach is normally greater).</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.w8168U174SSVPcnq]{Effect: Evolved Colossus}</p>"
        },
        "Evolved Giant": {
            "name": "Evolved Giant",
            "description": "<p>You've trained with your eldamon in order to increase the size of their evolved forms. When you or your eldamon use Phase Eldamon to phase in an eldamon in their evolved battle form, you can choose to phase them into a Huge battle form instead of their evolved battle form's normal size, and if your eldamon's evolved battle form is normally Huge, you can choose to have it become Gargantuan instead. When you choose to make your eldamon's evolved battle form larger, the eldamon has a reach of 15 feet (unless its reach is normally greater).</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.4xUJZAKz1Qd3KQe9]{Effect: Evolved Giant}</p>"
        },
        "Expert Avatar": {
            "name": "Expert Avatar",
            "description": "<p>You've refined your embodied elemental powers to an expert level. You become an expert in power attack rolls and power DCs. Additionally, your effective level for the purpose of determining their powers' damage, counteract level, and other scaling benefits (like temporary Hit Points and range) as well as for choosing new powers to gain from Elemental Avatar feats increases to your level – 5. In addition to the normal ability to swap one of the active powers you know for a new active power up to 7th level, you learn an additional elemental power from your element of up to 5th level; you can still only prepare one active power each day, but you can choose between the powers you know, like other elemental avatars.</p>\n<p>At 14th level, you can prepare two sets of powers at once and choose which one to use at the beginning of an encounter. Each day, prepare two alternative sets of elemental powers (typically that means you prepare two alternative active powers, though you might also prepare alternative reactive powers if you have the Avatar's Reaction feat). You also learn one additional active power from your element of up to 9th level, and one additional reactive power of up to your maximum effective level if you have (or later gain) the Avatar's Reaction feat.</p>"
        },
        "Familiar": {
            "name": "Familiar",
            "description": "<p><strong>Eldamon Trainer</strong> In addition to your trained eldamon, you have managed to connect with a minor eldamon and bring it into phase permanently. You gain a familiar, which typically bears some resemblance to the pet form of a specific type of eldamon. You can Command the familiar when phased out, even though you normally can't act while phased out. Additionally, if your familiar is within your line of sight and within 160 feet, you can use your familiar's position as the arrival point when you Incarnate Eldamon with an eldamon of the exact same kind, rather than your own position.</p>\n<p><strong>Elemental Avatar</strong> You can manifest a lesser incarnation of the eldamon within you into a familiar that assists you in your travels. You gain a familiar, which typically resembles the eldamon within you.</p>"
        },
        "Flexible Refresh": {
            "name": "Flexible Refresh",
            "description": "<p>You've practiced refreshing your elemental powers in numerous ways and in various locations with different ambient elemental energies, allowing you to replenish your power in the best manner to suit the specifics of your current situation. You learn an additional elemental power from your element or a universal power, which must be a refresh power. You can prepare one additional elemental power each day, which must be a refresh power.</p>"
        },
        "Fluctuating Phase": {
            "name": "Fluctuating Phase",
            "description": "<p><strong>Requirements</strong> You have a trained eldamon phased in.</p>\n<hr />\n<p>You train with your eldamon to use your phase sharing to their advantage, allowing them to partially shift out to avoid being targeted by various effects. When your eldamon uses Fluctuating Phase, until the beginning of your next turn, any creature that attempts to target your eldamon with an attack, spell, or other effect must succeed at a @Check[type:flat|dc:5]. On a failure, the effect is wasted as your eldamon phases out briefly.</p>\n<hr />\n<p><strong>Special</strong> When you take this feat, your trained eldamon gain the ability to use the @UUID[Compendium.battlezoo-eldamon-pf2e.actions.Item.uiKK5nKLem05YB07]{Fluctuating Phase} action instead of you gaining the ability to use the action.</p>"
        },
        "Focused Training": {
            "name": "Focused Training",
            "description": "<p>You train your eldamon friends to broaden their capacity for various skills. For each of your eldamon friends, choose for them to become brawny, burglarious, enthralling, nimble, self-sufficient, sneaky, or terrifying. If your eldamon already has the skill associated with the focused training you chose, your eldamon gains one of the skills associated with another focused training as an eldamon skill instead. Like their other eldamon skills, your eldamon become trained in the skill gained from focused training, and the skill increases to expert at 5th level and then to master at 11th level.</p><ul><li><strong>@UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.xiYyz5LgGBTHl9NO]{Brawny}</strong>: Your eldamon is particularly brawny compared to others of their type. They gain Athletics as an eldamon skill and the @UUID[Compendium.pf2e.feats-srd.Item.KxaYlC50zzHysJj8]{Titan Wrestler} skill feat.</li><li><strong>@UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.7I1yBxu8cOmJ8BpV]{Burglarious}</strong>: Your eldamon has a penchant for snatching things from others. They gain Thievery as an eldamon skill and the @UUID[Compendium.pf2e.feats-srd.Item.jDdOqFmZLwE4dblQ]{Pickpocket} skill feat.</li><li><strong>@UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.DmF2FP3ony0jDEQ4]{Enthralling}</strong>:Your eldamon easily enthralls other creatures. They gain Performance as an eldamon skill and the @UUID[Compendium.pf2e.feats-srd.Item.7LB00jkh6JaJr3vS]{Fascinating Performance} skill feat.</li><li><strong>@UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.nCad5Aop03se2qsD]{Nimble}</strong>: Your eldamon is especially nimble and always lands on their feet. They gain Acrobatics as an eldamon skill and the @UUID[Compendium.pf2e.feats-srd.Item.LQw0yIMDUJJkq1nD]{Cat Fall} skill feat.</li><li><strong>@UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.kS8OaKPn7I387pKt]{Self-Sufficient}</strong>: Your eldamon can handle themself and can track creatures easily. They gain Survival as an eldamon skill and the @UUID[Compendium.pf2e.feats-srd.Item.urQZwmzg2kS53vd5]{Experienced Tracker} skill feat.</li><li><strong>@UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.Pjp8l2vOwb6IUPlR]{Sneaky}</strong>: Your eldamon is always skulking around where you least expect it. They gain Stealth as an eldamon skill and the @UUID[Compendium.pf2e.feats-srd.Item.beyw5bdA5hkQbmaG]{Terrain Stalker} skill feat.</li><li><strong>@UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.H0eppEwKafPfJQ4x]{Terrifying}</strong>: Your eldamon is unfathomably terrifying in their battle form. They gain Intimidation as an eldamon skill and the @UUID[Compendium.pf2e.feats-srd.Item.ar2DUlvDK4LDcH9J]{Quick Coercion} skill feat. Like other eldamon with Intimidation as an eldamon skill, they also automatically gain the @UUID[Compendium.pf2e.feats-srd.Item.xQMz6eDgX75WX2ce]{Intimidating Glare} skill feat.</li></ul>"
        },
        "Hang in There Eldamon!": {
            "name": "Hang in There Eldamon!",
            "description": "<p><strong>Trigger</strong> Your phased in eldamon takes damage that would reduce it to 0 Hit Points</p>\n<p><strong>Requirements</strong> You are phased out, and one of your trained eldamon is phased in. You have more Hit Points than the maximum Hit Points of the eldamon that's phased in.</p>\n<hr />\n<p>You care too deeply for your eldamon to allow them to fall. You lose a number of Hit Points equal to the triggering damage or the difference between your current Hit Points and your eldamon's maximum Hit Points, whichever is lower. Your eldamon reduces the triggering damage by the same amount. If this reduction is enough to prevent your eldamon from being reduced to 0 Hit Points, they remain phased in. Your phased in eldamon still takes any other effects associated with the triggering damage, such as an injury poison on the weapon that hit them, even though you transferred the damage to yourself. You can use this reaction even when you're phased out, even though you normally can't act when phased out.</p>"
        },
        "I Believe In You!": {
            "name": "I Believe In You!",
            "description": "<p>You can leverage your deeper connection to your eldamon to attempt to inspire them to greater heights. When you use You Can Do It!, you can choose to attempt a @Check[type:diplomacy|dc:20|traits:action:you-can-do-it] check instead of a DC 15 Diplomacy check. If you do and you critically succeed, your eldamon gains a +3 circumstance bonus instead of a +2 circumstance bonus. If you have the eldamon master class feature, you can instead choose to attempt a @Check[type:diplomacy|dc:30|traits:action:you-can-do-it] check. If you do, your eldamon gains a +1 circumstance bonus on a failure (but not a critical failure), they gain a +2 circumstance bonus on a success, and they gain a +4 circumstance bonus on a critical success.</p>"
        },
        "Incarnate Eldamon": {
            "name": "Incarnate Eldamon",
            "description": "<p><strong>Frequency</strong> once per minute</p>\n<hr />\n<p>You briefly incarnate an eldamon in order to use its powers without swapping phase, though doing so requires a lot of energy.</p>\n<p>Incarnating an eldamon is somewhat parallel to summoning a creature, but there are some significant differences involved in the way the magic works. First, it doesn't conjure a generic nameless facsimile of a creature to be your minion as long as you Sustain the effect. Instead, it conjures one of your eldamon for 2 rounds, allowing your eldamon to charge up and use one elemental power. On the turn you incarnate them, your eldamon partially phases in adjacent to you and Steps, Strides, or takes another action corresponding to a type of movement it has (such as Swim for a water eldamon or Fly for an air eldamon). At the end of your next turn, the eldamon spends two actions to use one of their two-action powers of your choice. The incarnation then ends and your eldamon phases out.</p>\n<p>While partially phased in briefly due to an incarnation, your eldamon isn't fully present. In this state, they can't take any other actions except the ones mentioned above, but in exchange for this restriction, they also can't be targeted or harmed by any effects except those that would be able to end or disrupt a spell effect (such as @UUID[Compendium.pf2e.spells-srd.Item.9HpwDN4MYQJnW0LG]{Dispel Magic}). Hypothetical effects that can harm even a fully phased-out eldamon can still affect an incarnated eldamon, but normally there's nothing a phased-in creature can do that would accomplish that. While partially phased in, your eldamon isn't solid enough to block other creatures' movement, just like when the eldamon is phased out.</p>\n<p>Due to the restrictions and the intense strain on the eldamon compared to a full phase, many eldamon trainers don't learn how to perform an incarnation. Those that do so use it to quickly pivot by incarnating one eldamon and then phasing in another on their next turn. Incarnation is also crucial for multiclass eldamon trainers, since they can't sustain a full phase.</p>\n<p>After incarnating the eldamon in this way, the eldamon needs to rest, and it can't phase in with Phase Eldamon for 1 minute.</p>"
        },
        "Infinite Flexibility": {
            "name": "Infinite Flexibility",
            "description": "<p>You always have all of your powers at your fingertips, just outside the reach of your conscious mind, ready to actualize their potential without any need for preparation. At the beginning of your first turn in an encounter, and each time you refresh, you can prepare a new set of elemental powers, just like your normal selection during your daily preparations.</p>"
        },
        "Interstitial Phase": {
            "name": "Interstitial Phase",
            "description": "<p><strong>Requirements</strong> You have a trained eldamon phased in.</p>\n<hr />\n<p>You've trained your eldamon to rapidly swap phase between two eldamon while taking a quick action of your own for the brief time you are in phase. Your currently phased in eldamon uses Phase Eldamon to switch to another eldamon. Just after the first eldamon phases out and just before the next one phases in, you (the eldamon trainer) take a single action of your choice.</p>\n<hr />\n<p><strong>Special</strong> When you take this feat, your trained eldamon gain the ability to use the @UUID[Compendium.battlezoo-eldamon-pf2e.actions.Item.D5bfwD32zzH05DfH]{Interstitial Phase} activity instead of you.</p>"
        },
        "Legendary Skill": {
            "name": "Legendary Skill",
            "description": "<p>You train your eldamon to become true legends in a skill of your choice. Choose a skill. All your eldamon with the chosen skill as an eldamon skill increase their proficiency rank in that skill from master to legendary. If you have the @UUID[Compendium.battlezoo-eldamon-pf2e.feats.Item.YiWDPrJu3OAFrnTI]{Focused Training} feat and you choose a skill associated with one of the focused trainings from that feat, all your eldamon with that focused training gain an additional skill feat depending on the skill you chose:</p><ul><li><strong>Acrobatics</strong>: Your nimble eldamon gain the @UUID[Compendium.pf2e.feats-srd.Item.gBSPbQRXdagZTUwY]{Kip Up} skill feat.</li><li><strong>Athletics</strong>: Your brawny eldamon gain the @UUID[Compendium.pf2e.feats-srd.Item.P04Hw8E6WAWARKHP]{Quick Climb} or @UUID[Compendium.pf2e.feats-srd.Item.bFoh3267kNLk68cU]{Quick Swim} skill feat (choose for each brawny eldamon).</li><li><strong>Intimidation</strong>: Your terrifying eldamon gain the @UUID[Compendium.pf2e.feats-srd.Item.dc8X2Mbtwq6kGp7F]{Terrified Retreat} skill feat.</li><li><strong>Performance</strong>: Your enthralling eldamon gain the @UUID[Compendium.pf2e.feats-srd.Item.4UXyMtXLaOxuH6Js]{Distracting Performance} and @UUID[Compendium.pf2e.feats-srd.Item.lFwfUvH2708rl6i3]{Virtuosic Performer} skill feats.</li><li><strong>Stealh</strong>: Your sneaky eldamon gain the @UUID[Compendium.pf2e.feats-srd.Item.Imvu2RV2ggjJ2HZt]{Swift Sneak} skill feat.</li><li><strong>Survival</strong>: Your self-sufficient eldamon gain the @UUID[Compendium.pf2e.feats-srd.Item.Yj4mpROEjdCjQzMd]{Planar Survival} skill feat.</li><li><strong>Thievery</strong>: Your burglarious eldamon gain the @UUID[Compendium.pf2e.feats-srd.Item.IZbjUaZI5zHTd1Vp]{Legendary Thief} skill feat.</li></ul><hr /><p><em>Note: Place the @UUID[Compendium.battlezoo-eldamon-pf2e.eldamon-features.Item.OWVCH0M6XbQnK7mB]{Legendary Skill (Eldamon)} feature on each of your eldamon with the selected skill.</em></p>"
        },
        "Master Avatar": {
            "name": "Master Avatar",
            "description": "<p>You've mastered your embodied elemental powers to an extent, approaching a full avatar. You become a master in power attack rolls and power DCs. Additionally, your effective level for the purpose of determining their powers' damage, counteract level, and other scaling benefits (like temporary Hit Points and range), as well as for choosing new powers to gain from Elemental Avatar feats, increases to your level – 3. In addition to the normal ability to swap one of the active powers you know for a new active power up to 15th level, you learn an elemental power from your element of up to 13th level.</p>"
        },
        "Metapower Mastery": {
            "name": "Metapower Mastery",
            "description": "<p>You can tweak and adjust your elemental powers with ease, applying special effects with but a mere thought. When you use a metapower action that normally takes a single action, you can use it as a free action instead.</p>"
        },
        "Mitigated Weakness": {
            "name": "Mitigated Weakness",
            "description": "<p>You train your eldamon friends to mitigate their natural eldamon weaknesses, protecting them against the elements that normally do them the most harm. Your eldamon decrease their natural eldamon weaknesses based on their element from an amount equal to their level to an amount equal to half their level.</p><hr /><p><em>Note: Place the @UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.o1YyyNT6DaGJTh3z]{Enhanced Resistance (Eldamon)} feature on each of your eldamon.</em></p>"
        },
        "Nonlethal Element": {
            "name": "Nonlethal Element",
            "description": "<p>You modulate your elemental output to hold off from finishing your foe. If the next action you use is to channel an elemental power that doesn't have the death or void trait, that power gains the nonlethal trait.</p>"
        },
        "Overwhelming Element": {
            "name": "Overwhelming Element",
            "description": "<p>Your overwhelming elemental power flows within you, allowing you to overcome a creature's resistances. If the next action you use is to channel an elemental power, the power ignores an amount of the target's resistance to your element's trait equal to your level. Additionally, if your element has an associated damage type, the power also ignores an amount of the target's resistance to that damage type equal to your level. This applies to all damage the power deals, including persistent damage and damage caused by an ongoing effect of the power, such as the arc created by Smoldering Curtain. A creature's immunities are unaffected.</p>"
        },
        "Panelemental Protection": {
            "name": "Panelemental Protection",
            "description": "<p>You surround yourself in elemental energies that protect you from elemental and energy attacks of nearly all sorts. You gain resistance 10 to acid, cold, electricity, fire, force, mental, poison, sonic, vitality, and void damage.</p>"
        },
        "Phase Amalgam Eldamon": {
            "name": "Phase Amalgam Eldamon",
            "description": "<p>You've discovered a secret technique, considered forbidden by some eldamon trainers, to fuse two eldamon of the same element together when phasing them in, and you can use it when you're in dire straits. Once per day, when you or your eldamon use Phase Eldamon, you can phase two of your prepared eldamon together into an amalgam. If you do, the amalgam eldamon has both eldamons' elemental abilities, form abilities, evolution abilities, Strikes, eldamon skills, eldamon saving throws, senses, resistances, and weaknesses, the higher of the two eldamons' Speeds, Hit Points, and attributes (determined for each attribute separately), and your choice of one of the eldamons' power sets. After 1 minute, if the amalgam is still phased in, it becomes unstable and automatically phases out. If the amalgam phases out for any reason, you can't phase the amalgam back in. If the amalgam is reduced to 0 Hit Points, both eldamon must wait the usual time to phase in again (1 minute, or 1 hour if reduced to 0 Hit Points by a death effect).</p>"
        },
        "Reactive Mastery": {
            "name": "Reactive Mastery",
            "description": "<p>You're always watching for the right moment to slip in another elemental power. This has led you to develop a demanding regimen of split-second training, which has increased your affinity for reactive powers. As a result, you can prepare several reactive powers so that you can be ready to respond to any situation. You learn an additional elemental power from your element or a universal power, which must be a reactive power. You can prepare one additional elemental power each day, which must be a reactive power.</p>"
        },
        "Refreshing Phase Shift": {
            "name": "Refreshing Phase Shift",
            "description": "<p>You've trained your eldamon to use their refresh powers when they switch in for another eldamon. When your phased in eldamon uses Phase Eldamon to switch for another eldamon, your choice of the original eldamon phasing out or the new eldamon that phases in can use its refresh power as part of the Phase Eldamon activity. As a reminder, this doesn't work with Sudden Switch, since your eldamon isn't the one using Phase Eldamon.</p>"
        },
        "Rejuvenating Refresh": {
            "name": "Rejuvenating Refresh",
            "description": "<p>When your eldamon refreshes their elemental powers, you can take some of their damage to rejuvenate and refresh them. Whenever one of your phased in eldamon uses a refresh power, you can choose to lose a number of Hit Points up to twice your level or 1 less than your current Hit Points, whichever is less. Your eldamon recovers that many Hit Points.</p>"
        },
        "Remembered Echoes": {
            "name": "Remembered Echoes",
            "description": "<p>Your eldamon are especially quick to adjust and learn, remembering the echoes of their ancient past or the whispers of their distant futures. This allows them to retrain their powers much faster than normal. Instead of taking 1 week to retrain an eldamon's power, it takes only 1 day.</p>"
        },
        "Researcher's Insight": {
            "name": "Researcher's Insight",
            "description": "<p>As you move into and out of phase, you catch glimpses of possibilities that allow you to better understand the world around you. Whenever you use Phase Eldamon to phase in a trained eldamon, and whenever one of your trained eldamon uses Phase Eldamon to switch to another trained eldamon, you can attempt a Recall Knowledge check as a free action. You can choose your eldamon after determining the result of the Recall Knowledge check.</p>"
        },
        "Retract Tether": {
            "name": "Retract Tether",
            "description": "<p><strong>Requirements</strong> You are phased out, one of your trained eldamon is phased in, and you are not using Untether to remove the tether with your phased in eldamon.</p>\n<hr />\n<p>You train yourself and your eldamon in order to take advantage of the tether between the two of you while they're phased in, turning a restriction into an advantage, as the eldamon instantly rebounds back to your location. Your phased in eldamon moves to a space adjacent to your current position by traveling along its metaphysical tether. Since it doesn't pass through any intervening spaces, it doesn't trigger reactions based on moving through those spaces, though it still triggers reactions based on movement in the initial and final spaces.</p>\n<hr />\n<p><strong>Special</strong> When you take this feat, all of your trained eldamon gain the ability to use the @UUID[Compendium.battlezoo-eldamon-pf2e.actions.Item.j51m07Twc5azHFw1]{Retract Tether} action, rather than you gaining the ability to use the feat.</p>"
        },
        "Second Calling": {
            "name": "Second Calling",
            "description": "<p>Your calling to become an eldamon trainer is so strong and complex that it contains multiple pillars. Choose another calling and gain that calling's benefits.</p>"
        },
        "Share Senses": {
            "name": "Share Senses",
            "description": "<p>When your eldamon borrow your phase, you borrow their senses. Though you're phased out and still can't act (meaning you can't spend actions to @UUID[Compendium.pf2e.actionspf2e.Item.BlAOM2X92SI6HMtJ]{Seek}), this allows you to passively gather sensory information from all of your eldamon's senses when they can sense something you can't. For instance, if your eldamon can see around a corner, you can see what they see.</p>"
        },
        "Shiny Eldamon": {
            "name": "Shiny Eldamon",
            "description": "<p>While they are sharing your phase, your eldamon glow with a specific color that represents your inner spirit. Decide the color based on your personality. The eldamons' glow illuminates the area around them like a torch (20 feet of bright light and another 20 feet of dim light). When you or your eldamon Phase Eldamon, you can choose for your eldamon not to glow, and darkness eldamon never glow. If the eldamon already glows (such as most fire and light eldamon), if you choose to add the glow from this feat, the area of their bright light and dim light each expand by 20 feet.</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.jJfM0eKKVL8wpOt8]{Effect: Shiny Eldamon}</p>"
        },
        "Sudden Switch": {
            "name": "Sudden Switch",
            "description": "<p><strong>Frequency</strong> once per hour</p>\n<p><strong>Trigger</strong> Your turn begins</p>\n<p><strong>Requirements</strong> You are phased out, one of your trained eldamon is phased in, and you are able to Phase Eldamon</p>\n<hr />\n<p>Though it's quite disruptive to their elemental powers to do so, you rapidly switch between two eldamon to adapt to the situation. You Phase Eldamon to switch between your currently phased in eldamon and another of your prepared eldamon. However, due to the rapid phase shift, the newly phased in eldamon expends all their reactive powers and a number of active powers equal to the number of active powers your previously phased in eldamon had used without refreshing. For example, if your squirrelava had used two of their three active fire powers and you used Sudden Switch to swap to glaciotter, you must choose two of glaciotter's three active powers and expend them with no effect, meaning glaciotter can only use the remaining active power before refreshing. You can use this free action even when you're phased out, even though you normally can't act when phased out.</p>"
        },
        "Surging Element": {
            "name": "Surging Element",
            "description": "<p>You produce a sudden surge, capable of modifying an elemental power immediately. If the next action you use is to channel an elemental power, that power gains the elemental surge effect for your element. Since you didn't take the Elemental Surge action, you ignore its requirements.</p>"
        },
        "Tag Team Ultimate": {
            "name": "Tag Team Ultimate",
            "description": "<p>Sometimes you call down your eldamon's ultimate power, only to find the foe is too strong. In those cases, you have to surpass your own limits and draw forth another ultimate power before you've recovered from the first. Once per day, after one of your eldamon uses their ultimate power, you can use another eldamon's ultimate power before 1 hour has passed, even though normally you need to wait 1 hour before any of your eldamon uses an ultimate power again. When you use a second ultimate power in this way, it doesn't reset your count toward using an ultimate power again; your eldamon can still use another ultimate power 1 hour after your eldamon used the first one.</p>"
        },
        "Third Calling": {
            "name": "Third Calling",
            "description": "<p>Eldamon are your everything, and every aspect of their existence calls out to you. There's no part of eldamon about which you don't obsess. Choose a third calling and gain that calling's benefits, as well as the 6th level feat associated with that calling (Toughness Training for eldamon battler, Researcher's Insight for eldamon researcher, and I Believe In You! For eldamon whisperer).</p>"
        },
        "Throw Phase": {
            "name": "Throw Phase",
            "description": "<p>When you share your phase with your eldamon friends, you can do so from an increased distance. You can Phase Eldamon to phase in an eldamon up to 30 feet away from you, rather than only in an adjacent position. This allows you to position your eldamon strategically as you phase them in and out. This benefit applies whether you or your eldamon uses Phase Eldamon, as long as you choose your location as the origin point for the new eldamon, rather than the eldamon's location.</p>"
        },
        "Toughness Training": {
            "name": "Toughness Training",
            "description": "<p>While phased in eldamon can be ephemeral in our reality, you train your eldamon friends to be especially tough, even compared to other eldamon battlers. All your trained eldamon increase their maximum Hit Points by their level. This is cumulative with the benefits of the eldamon battler calling.</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.5eyM5Jemvq13WqYW]{Effect: Toughness Training}</p>"
        },
        "Twin Ultimate": {
            "name": "Twin Ultimate",
            "description": "<p>You are able to contain multiple elemental patterns representing ultimate powers, allowing you to have more options and use them more often. You learn an additional ultimate elemental power of your element. You can prepare both of them, and once per day, after you've used one of your ultimate powers, you can use the other one before 1 hour has passed, even though normally you need to wait 1 hour before using any ultimate powers again. When you use a second ultimate power in this way, it doesn't reset your count toward using an ultimate power again; you can still use another ultimate power 1 hour after you used the first one.</p>"
        },
        "Twisting Element": {
            "name": "Twisting Element",
            "description": "<p>You twist your elemental power like a contorting serpent, avoiding a few of your allies or innocent victims in the area. If the next action you use is to channel an elemental power that affects an area, you can designate up to two squares in the area that are unaffected by the power. If you have the entwined avatar class feature, you can designate up to three squares, and if you also have the transcend element class feature, you can designate up to four squares.</p>"
        },
        "Unbound Surge": {
            "name": "Unbound Surge",
            "description": "<p>Your eldamon can surge without limits, allowing them to combine their elemental powers together with uncontrolled surges with ease. Your eldamon can use the Elemental Surge action on the same turn as an elemental power, ignoring the usual restrictions preventing them from doing so.</p>"
        },
        "Untether": {
            "name": "Untether",
            "description": "<p>While it strains you to do so, you can briefly untether your eldamon from you when you lend it your phase. Once per 10 minutes when you or your eldamon uses Phase Eldamon, you can choose to untether your eldamon. If you do, for 1 minute, your eldamon can move any distance from you and outside your line of effect, removing the normal limitation to remain within 160 feet and within your line of effect. After 1 minute elapses, if your eldamon is outside of line of effect or more than 160 feet away from you, they instantly phase out and you phase back in.</p>"
        },
        "Widen Element": {
            "name": "Widen Element",
            "description": "<p>You manipulate the energy of your power, causing it to spread out and affect a wider area. If the next action you use is to channel an elemental power that has an area of a burst, cone, or line and does not have a duration, increase the area of that power. Add 5 feet to the radius of a burst that normally has a radius of at least 10 feet (a burst with a smaller radius is not affected). Add 5 feet to the length of a cone or line that is normally 15 feet long or smaller, and add 10 feet to the length of a larger cone or line.</p>"
        }
    }
}