{
    "label": "Journals",
    "entries": {
        "Camping Activities": {
            "name": "Camping Activities",
            "pages": {
                "Camouflage Campsite": {
                    "name": "Camouflage Campsite",
                    "text": "<p><span style=\"font-family:Signika, sans-serif\"><strong>Camping,</strong> <strong>Manipulate,</strong> <strong>Secret</strong></span></p><p style=\"box-sizing:border-box;user-select:text;margin:0.5em 0px;min-height:unset;color:rgb(25, 24, 19);font-family:Signika, sans-serif;font-size:14px;font-style:normal;font-variant-ligatures:normal;font-variant-caps:normal;font-weight:400;letter-spacing:normal;orphans:2;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;-webkit-text-stroke-width:0px;text-decoration-thickness:initial;text-decoration-style:initial;text-decoration-color:initial;text-align:start\"><span style=\"font-family:Signika, sans-serif\"><strong style=\"box-sizing:border-box;user-select:text\">Requirements</strong>: trained in Stealth</span></p><p style=\"box-sizing:border-box;user-select:text;margin:0.5em 0px;min-height:unset;color:rgb(25, 24, 19);font-family:Signika, sans-serif;font-size:14px;font-style:normal;font-variant-ligatures:normal;font-variant-caps:normal;font-weight:400;letter-spacing:normal;orphans:2;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;-webkit-text-stroke-width:0px;text-decoration-thickness:initial;text-decoration-style:initial;text-decoration-color:initial;text-align:start\"><span style=\"font-family:Signika, sans-serif\">You spend 2 hours concealing the camp from potential threats by covering tents with branches, ensuring campfire placement minimizes the spread of scent or smoke, reminding others to avoid making too many loud noises, and so on. Attempt a Stealth check against the Zone DC.</span></p><p style=\"box-sizing:border-box;user-select:text;margin:0.5em 0px;min-height:unset;color:rgb(25, 24, 19);font-family:Signika, sans-serif;font-size:14px;font-style:normal;font-variant-ligatures:normal;font-variant-caps:normal;font-weight:400;letter-spacing:normal;orphans:2;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;-webkit-text-stroke-width:0px;text-decoration-thickness:initial;text-decoration-style:initial;text-decoration-color:initial;text-align:start\"><span style=\"font-family:Signika, sans-serif\">You can only attempt to Camouflage Campsite once per camping session, regardless of the activity’s result.</span></p><hr style=\"box-sizing:border-box;user-select:text;border-right:none;border-left:none;border-image:initial;border-top:1px solid var(--color-border-light-primary);border-bottom:1px solid var(--color-border-light-highlight);color:rgb(25, 24, 19);font-family:Signika, sans-serif;font-size:14px;font-style:normal;font-variant-ligatures:normal;font-variant-caps:normal;font-weight:400;letter-spacing:normal;orphans:2;text-align:start;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;-webkit-text-stroke-width:0px;text-decoration-thickness:initial;text-decoration-style:initial;text-decoration-color:initial\" /><p style=\"box-sizing:border-box;user-select:text;margin:0.5em 0px;min-height:unset;color:rgb(25, 24, 19);font-family:Signika, sans-serif;font-size:14px;font-style:normal;font-variant-ligatures:normal;font-variant-caps:normal;font-weight:400;letter-spacing:normal;orphans:2;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;-webkit-text-stroke-width:0px;text-decoration-thickness:initial;text-decoration-style:initial;text-decoration-color:initial;text-align:start\"><span style=\"font-family:Signika, sans-serif\"><strong style=\"box-sizing:border-box;user-select:text\">Critical Success</strong> Your camouflage attempt exceeds expectation. Increase the Encounter DC for your camp by 2. The first time a flat check would result in an encounter during this camping session, instead treat that result as a failure with no encounter.</span></p><p style=\"box-sizing:border-box;user-select:text;margin:0.5em 0px;min-height:unset;color:rgb(25, 24, 19);font-family:Signika, sans-serif;font-size:14px;font-style:normal;font-variant-ligatures:normal;font-variant-caps:normal;font-weight:400;letter-spacing:normal;orphans:2;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;-webkit-text-stroke-width:0px;text-decoration-thickness:initial;text-decoration-style:initial;text-decoration-color:initial;text-align:start\"><span style=\"font-family:Signika, sans-serif\"><strong style=\"box-sizing:border-box;user-select:text\">Success</strong> Your work helps hide your camp from detection. Increase the Encounter DC for your camp by 1.</span></p><p style=\"box-sizing:border-box;user-select:text;margin:0.5em 0px;min-height:unset;color:rgb(25, 24, 19);font-family:Signika, sans-serif;font-size:14px;font-style:normal;font-variant-ligatures:normal;font-variant-caps:normal;font-weight:400;letter-spacing:normal;orphans:2;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;-webkit-text-stroke-width:0px;text-decoration-thickness:initial;text-decoration-style:initial;text-decoration-color:initial;text-align:start\"><span style=\"font-family:Signika, sans-serif\"><strong style=\"box-sizing:border-box;user-select:text\">Critical Failure</strong> You believe you’ve done well at your camouflage attempt but have actually forgotten something important or accidentally did something to make the campsite more noticeable. Decrease the Encounter DC for your camp by 2, and flat checks made to determine encounters result in a critical success on a roll of 19 or 20.</span></p>"
                },
                "Cook Basic Meal": {
                    "name": "Cook Basic Meal",
                    "text": "<p>You spend 2 hours preparing a meal. Expend 2 basic ingredients per serving you wish to prepare, as well as 1 day’s rations, or provisions from Subsisting, per serving.</p><p>Once the party finishes all Camping activities and the characters have chosen which meals they wish to eat, attempt a @Check[type:survival|dc:22] check or a @Check[type:cooking|dc:18] check to determine the effectiveness of your basic meal.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-meal-effects.J5nci1DS7i1wDph4]{Basic Meal}</p><hr /><p><strong>Critical Success</strong> You prepare a delicious meal. A character who eats this meal recovers Hit Points equal to their Constitution modifier (minimum 1) multiplied by twice their level when they rest during this camping session instead of the normal amount, and they gain a +1 status bonus to all saving throws until they complete their daily preparations, or begin adventuring again.</p><p><strong>Success</strong> You prepare a meal. A character who eats it gains a +1 status bonus to all saving throws until they complete their daily preparations or begin adventuring again.</p><p><strong>Failure</strong> Your meal fills bellies, but has no other effects.</p><p><strong>Critical Failure</strong> Your meal wreaks havoc on digestion. A character who partook of this meal becomes until after they rest and complete their daily preparations.</p>"
                },
                "Cook Special Meal": {
                    "name": "Cook Special Meal",
                    "text": "<p><strong>Camping,</strong> <strong>Manipulate</strong></p><p><strong>Requirements</strong> knowledge of the recipe</p><p>You spend 2 hours preparing a special meal. Choose a special meal whose recipe the party knows and then expend the basic and special ingredients required for each serving you wish to prepare, as well as 1 day’s rations, or provisions from Subsisting, per serving.</p><p>Special meal recipes are formulas you can purchase at a settlement or discover on your own with the Discover Special Meal activity.</p><p>Cook Special Meal can be attempted multiple times during a camping session, but each attempt must use a different recipe.</p><p>A character who is sickened can’t eat a special meal or gain its benefits.</p><p>Once the party finishes all Camping activities and the characters have chosen which meals they wish to eat, attempt a Survival check or a Cooking Lore check to determine the effectiveness of your special meal. The DC of the check required varies by recipe. Unless the special meal’s description says otherwise, its effects last until the next time the party prepares a camp or 24 hours, whichever comes first.</p><hr /><p><strong>Critical Success</strong> The character gains the recipe’s listed critical success effect.</p><p><strong>Success</strong> The character gains the recipe’s listed success effect.</p><p><strong>Failure</strong> The character gains no special benefit from the meal, though it still prevents starvation.</p><p><strong>Critical Failure</strong> The character suffers the recipe’s critical failure effect.</p>"
                },
                "Discover Special Meal": {
                    "name": "Discover Special Meal",
                    "text": "<p><strong>Camping,</strong> <strong>Manipulate</strong></p><p><strong>Requirements</strong> trained in Cooking Lore</p><p>You spend 2 hours attempting to discover a special recipe. Choose a common recipe from those listed starting on Special Recipes; the recipe must be of a level equal to or less than the level of the zone you’re camping in. Expend twice the normal amount of ingredients required to prepare 1 serving of the special meal, then attempt that special meal’s Cooking Lore check.</p><hr /><p><strong>Critical Success</strong> You discover the special meal and add it to the list of recipes the party knows. In addition, your research was efficient, and you recover half of the ingredients you had to expend to attempt this activity.</p><p><strong>Success</strong> As critical success, but you do not recover any ingredients.</p><p><strong>Failure</strong> You fail to discover the special meal and do not recover any ingredients.</p><p><strong>Critical Failure</strong> As failure, but you also expose yourself to the special meal’s critical failure effect while performing an unwise taste test.</p><p></p>"
                },
                "Hunt and Gather": {
                    "name": "Hunt and Gather",
                    "text": "<p><strong>Camping,</strong> <strong>Move</strong></p><p><strong>Requirements</strong> trained in Survival</p><p>You spend 2 hours gathering ingredients. This supplements the food from Subsisting with additional ingredients you can use to cook basic or special meals, gaining greater effects than simply eating the rations alone. Attempt a Hunting Lore or Survival check against the Zone DC.</p><hr /><p><strong>Critical Success</strong> You find a number of Basic Ingredients equal to twice the zone’s DC, plus 4 Special Ingredients. If you’re Hunting and Gathering in a zone that’s at least level 7, increase the number of special ingredients found to 8; if you’re doing so in a zone that’s at least level 14, increase it to 12.</p><p><strong>Success</strong> You find a number of Basic Ingredients equal to the zone’s DC, plus [[/r 1d4]] Special Ingredients. If you’re Hunting and Gathering in a zone that’s at least level 7, increase the number of special ingredients found to [[/r 2d4]]; if you’re doing so in a zone that’s at least level 14, increase it to [[/r 3d4]].</p><p><strong>Failure</strong> You find a number of Basic Ingredients equal to the zone’s DC.</p><p><strong>Critical Failure</strong> You find [[/r 1d4]] Basic Ingredients (maximum equal to the zone’s DC). In addition, you’ve attracted attention. Make an additional flat check to determine if a random encounter occurs at your campsite following this activity.</p>"
                },
                "Learn from a Companion": {
                    "name": "Learn from a Companion",
                    "text": "<p><strong>Camping,</strong> <strong>Concentrate</strong></p><p><strong>Requirements</strong> The companion to be learned from must be camping with you, and they must be at least Friendly.</p><p>All of the companions in this book are presented with specialized Camping activities. Normally, in order for a PC to be able to attempt one of these specialized activities, that companion must be present in the camp as well, but this activity allows the companion to attempt to teach the party how to perform the activity on their own. You spend 2 hours with the companion when you attempt to learn from them, then attempt a @Check[type:perception|dc:20] check.</p><hr /><p><strong>Critical Success</strong> You learn the companion’s special activity. Any PC who meets that activity’s requirements (see table above) can now perform that activity even when the companion isn’t in the camp.</p><p><strong>Success</strong> You make progress in learning the special activity but require at least one more day to master it. If you attempt to Learn from this Companion the next time you camp, the result of that check is improved by one degree of success from the result rolled.</p><p><strong>Failure</strong> You fail to learn anything from the companion.</p><p><strong>Critical Failure</strong> You fail to learn from the companion, who grows frustrated with the party. No further attempts to Learn from this Companion can be attempted during this camping session.</p><hr /><table class=\"inner\"><tbody><tr><th data-colwidth=\"187\"><p>Activity</p></th><th><p>Requirements</p></th></tr><tr><td data-colwidth=\"187\"><p>@UUID[.jz1FI7zSoPLR8iBL]{Blend Into The Night}</p></td><td><p>Trained in Religion, worships the companion's deity</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.pxHYFLK7VYGppCzS]{Bolster Confidence}</p></td><td><p>Expert in Performance</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.JRScwsFTXTpTwWYA]{Camp Management}</p></td><td><p>Expert in Survival</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.X4ggcXUe0wPiW4jt]{Healer's Blessing}</p></td><td><p>Trained in Religion, worships the companion's deity</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.ytyW9F39m7xf0gx5]{Enhance Campfire}</p></td><td><p>Expert in Nature</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.2Dn89HrY7gyvQiOH]{Enhance Weapons}</p></td><td><p>Expert in Crafting</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.LhhERalHv4QA14fQ]{Intimidating Posture}</p></td><td><p>Expert in Intimidation</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.zUaeA8Ud9dv3hhnc]{Maintain Armor}</p></td><td><p>Expert in Crafting</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.vWSQmYLKlrk3rLDE]{Set Alarms}</p></td><td><p>Expert in Arcana</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.5ynOh085kwNp75t4]{Set Traps}</p></td><td><p>Expert in Thievery</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.YzOixXzCwfXOBjtx]{Undead Guardians}</p></td><td><p>Expert in Religion</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.HGcwmsfjVqfLeYhu]{Water Hazards}</p></td><td><p>Expert in Nature</p></td></tr><tr><td data-colwidth=\"187\"><p>@UUID[.8PNH77YHVkw9KoAv]{Wilderness Survival}</p></td><td><p>Expert in Survival</p></td></tr></tbody></table>"
                },
                "Organize Watch": {
                    "name": "Organize Watch",
                    "text": "<p><strong>Camping</strong></p><p><strong>Requirements</strong> expert in Perception</p><p>You spend 2 hours to take the lead on organizing the camp’s watch rotation, optimizing shifts, and scouting the surrounding area to determine which approaches to the camp are most likely to be used by enemies. Attempt a Perception check against the Zone DC.</p><hr /><p><strong>Critical Success</strong> The camp’s watch is efficient. Treat the total time required for rest as if the party size were 1 more, and all characters gain a +2 status bonus to Perception checks made during their shift on watch.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.010XlkzzjX38BHsO]{Organize Watch (Critical Success)}</p><p><strong>Success</strong> Characters gain a +1 status bonus to Perception checks made during their shift on watch.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.MOXWga7l8dsypUPy]{Organize Watch (Success)}</p><p><strong>Failure</strong> Your attempt to organize the watch doesn’t grant any additional benefits.</p><p><strong>Critical Failure</strong> As failure, but you may have attracted unwanted attention. Attempt a flat check against the zone’s Encounter DC to determine if a random encounter occurs.</p>"
                },
                "Provide Aid": {
                    "name": "Provide Aid",
                    "text": "<p><strong>Camping,</strong> <strong>Concentrate</strong></p><p>You take 2 hours to aid another character in their Camping activity. When you Provide Aid, attempt a skill check of a type decided by the GM. The typical DC is 20, but the GM might adjust this DC for particularly hard or easy tasks.</p><p>You can Provide Aid as many times as you want during a camping session, but remember that the circumstance bonuses granted by Provide Aid do not stack.</p><hr /><p><strong>Critical Success</strong> You grant your ally a +2 circumstance bonus to the activity. If you’re a master with the check you attempted, the bonus is +3, and if you’re legendary, it’s +4.</p><p><strong>Success</strong> You grant your ally a +1 circumstance bonus to the activity’s check.</p><p><strong>Critical Failure</strong> Your ally takes a –1 circumstance penalty to their activity’s check.</p>"
                },
                "Relax": {
                    "name": "Relax",
                    "text": "<p><strong>Camping</strong></p><p>You spend 2 hours listening to campfire stories, chatting, reading, meditating, napping, or otherwise simply relaxing.</p><p>You gain a +1 circumstance bonus to the next check you make in order to resolve a Camping activity, provided that check happens during this camping session.</p><p>A character that’s suffering a status penalty from a critical failure on the Tell Campfire Story activity removes that penalty after spending an hour Relaxing. You can Relax as many times as you want during a camping session.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.QvR2yvuIVQuztCwQ]{Relaxed}</p>"
                },
                "Tell Campfire Story": {
                    "name": "Tell Campfire Story",
                    "text": "<p><strong>Camping,</strong> <strong>Concentrate,</strong> <strong>Emotion,</strong> <strong>Linguistic,</strong> <strong>Mental</strong></p><p>You spend 2 hours telling a rousing story, perhaps one of your previous adventures or something that was in turn told to you around a campfire. The GM might award a +1 circumstance bonus to your check if the story is relevant to your recent or upcoming adventures, or if it reflects one or more characters’ personal stories. Attempt a Performance check against a DC equal to that set by your own level, as given on Table 10–5 on page 503 of the Core Rulebook.</p><p>All allies in your camp can potentially gain benefits from your stories, but those who spend the hour Relaxing gain the greatest benefits. An ally who spends the two hours of your campfire story Hunting and Gathering or is otherwise outside of the camp’s immediate area is not affected by your campfire story.</p><hr /><p><strong>Critical Success</strong> You inspire your allies dramatically. For the remainder of the camping session, your allies gain a +2 status bonus to attack rolls, saving throws, and skill checks during combat at the campsite. The bonuses end as soon as daily preparations begin after resting is concluded. If an ally spent the hour Relaxing, they can also choose to reroll a failed roll at any time once during the remainder of the camping session while the status bonus persists; this is a fortune effect.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.2vdskbqd0VrWKR9Y]{Campfire Story (Critical Success)}</p><p><strong>Success</strong> You inspire your allies. As critical success, but the status bonus is +1. An ally who spent the hour Relaxing receives a +2 status bonus but does not receive the re-roll effect granted by a critical success.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.wT2NzrfgmWmCMRtv]{Campfire Story (Success)}</p><p><strong>Failure</strong> Your allies are unmoved and receive no benefits.</p><p><strong>Critical Failure</strong> Your story distracts or unsettles your allies. They each take a –1 status penalty to skill checks until they Relax or until they begin daily preparations.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.y5Jqw40SWNOgcxvC]{Campfire Story (Critical Failure)}</p>"
                },
                "Influence Companion": {
                    "name": "Influence Companion",
                    "text": "<p><strong>Concentrate,</strong> <strong>Linguistic,</strong> <strong>Camping</strong></p><p>You attempt to make a favorable impression on an NPC to convince the NPC to support your cause. Spend 2 hours and choose an NPC, and attempt a skill check to impress that NPC. The DC, and whether success is possible, depend on the NPC’s preferences (typically found in the NPC’s influence stat block).</p><hr /><p><strong>Critical Success</strong> You gain 2 Influence Points with the chosen NPC.</p><p><strong>Success</strong> You gain 1 Influence Point with the chosen NPC.</p><p><strong>Failure</strong> You gain no Influence Points with the chosen NPC.</p><p><strong>Critical Failure</strong> You lose 1 Influence Point with the chosen NPC.</p>"
                },
                "Discover Companion's Preferences": {
                    "name": "Discover Companion's Preferences",
                    "text": "<p><strong>Concentrate,</strong> <strong>Secret,</strong> <strong>Camping</strong></p><p>You watch or study an NPC to learn more about that NPC’s preferences. Spend 2 hours and choose an NPC and attempt a Perception check or an appropriate skill check determined by the GM. The DC is typically found in the NPC’s influence stat block.</p><hr /><p><strong>Critical Success</strong> Choose two of the options detailed in Success below; you can choose the same option twice to learn two pieces of information from the same category.</p><p><strong>Success</strong> Choose one of the following: You learn which skill that can Influence the NPC has the lowest DC (skipping any skills that you already know), one of the NPC’s personal biases, one of the NPC’s resistances, or one of the NPC’s weaknesses.</p><p><strong>Failure</strong> You learn no information.</p><p><strong>Critical Failure</strong> Choose a piece of information to learn about, as success, but the information is incorrect. For instance, you might think the NPC is susceptible to flattery when actually the NPC is resistant to flattery.</p>"
                },
                "Blend Into The Night": {
                    "name": "Blend Into The Night",
                    "text": "<p>When checking for wandering encounters during the night (including when made as part of camping), the flat check DC for the encounter is increased by 2.</p>"
                },
                "Bolster Confidence": {
                    "name": "Bolster Confidence",
                    "text": "<p>Checks on all other Camping activities gain a +1 circumstance bonus. If the person is master in Performance, this becomes a +2 circumstance bonus.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.mAEvnTqFuLIASQLB]{Bolster Confidence}</p>"
                },
                "Camp Management": {
                    "name": "Camp Management",
                    "text": "<p>Attempts a Survival check against the Zone DC to determine how helpful your management is.</p><p><strong>Critical Success</strong> During the hour immediately following this critical success, each PC may attempt two Camping activities instead of one. This success does not increase the number of activities companions may attempt.</p><p><strong>Success</strong> As critical success, but only one PC may attempt two Camping activities during the next 2 hours.</p><p><strong>Critical Failure</strong> Your advice backfires, resulting in inefficiencies during the rest of the camping session. All checks made to resolve Camping activities take a –2 circumstance penalty for the remainder of this camping session.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.vpH13xgAqX4zsU6o]{Camp Management: Critical Failure}</p>"
                },
                "Healer's Blessing": {
                    "name": "Healer's Blessing",
                    "text": "<p>When the party rests during this camp, each character regains twice the normal amount of Hit Points from the rest (an amount equal to double their Constitution modifier—minimum 2—multiplied by their level). The effect isn’t cumulative with the critical success effect of a basic meal.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.eaWmjDOIvUF9aDbq]{Dawnflower's Blessing}</p>"
                },
                "Enhance Campfire": {
                    "name": "Enhance Campfire",
                    "text": "<p>All cooking activities that take place for the remainder of the camping session gain a +1 circumstance bonus. This bonus increases to +2 if the PCs are at least 11th level.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.NFPQHxvpJd2vsKMe]{Enhance Campfire}</p>"
                },
                "Enhance Weapons": {
                    "name": "Enhance Weapons",
                    "text": "<p>Each PC chooses one melee weapon. That melee weapon gains a +1 circumstance bonus to damage rolls during the next encounter it’s used in; this bonus expires at the end of that encounter or after 24 hours, whichever comes first.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.ZKJlIqyFgbKDACnG]{Enhance Weapons}</p>"
                },
                "Intimidating Posture": {
                    "name": "Intimidating Posture",
                    "text": "<p>The camp’s intimidating nature scares off less powerful encounters. If a Low or Trivial random encounter is rolled at any point during the camp, treat it as no encounter instead. The PCs still earn any XP they would have otherwise earned for defeating the encounter in combat when they wake the next day and notice the telltale signs of flight from the skipped encounter.</p>"
                },
                "Maintain Armor": {
                    "name": "Maintain Armor",
                    "text": "<p>One PC chooses one suit of armor or a broken shield. If the PC chooses a suit of armor, that suit of armor grants the wearer temporary Hit Points equal to half their level during the next encounter it’s worn; these temporary Hit Points expire at the end of the encounter or after 24 hours. If the PC chooses a broken shield, you restore the broken shield to full HP. An additional PC can choose a suit of armor or broken shield once the party is 3rd level, and then again every 2 levels thereafter.</p>"
                },
                "Set Alarms": {
                    "name": "Set Alarms",
                    "text": "<p>The first time the campsite is attacked by enemies during the next 24 hours, the alarms trigger and alert the PCs. Sleeping characters do not take the normal –4 status penalty when rolling initiative during such an attack, while characters who are awake gain a +2 circumstance bonus to their initiative check.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.ptjs54eoEX8EAQNq]{Set Alarms}</p>"
                },
                "Set Traps": {
                    "name": "Set Traps",
                    "text": "<p>If the campsite is attacked by enemies during the next 24 hours, the invaders suffer a –1 item penalty to all attack rolls and skill checks on the first round of combat as they navigate the distracting traps. Any enemy whose initiative result is less than Trapper's Thievery DC is also flat-footed from the traps until the start of their turn on the second round of combat.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.PSBOS7ZEl9RGWBqD]{Set Traps}</p>"
                },
                "Undead Guardians": {
                    "name": "Undead Guardians",
                    "text": "<p>If the camp is attacked during the period of rest, these spirits of the dead rise up as undead guardians to defend you and your allies.</p><p>These undead guardians manifest as shrieking ghostlike spirits. While their exact shape is determined by the GM, their effect in battle remains the same. Each round during combat, one PC can choose to be defended by the undead guardians (and gain a +1 status bonus to AC for 1 round) or to have them aid their attacks (and gain a +1 status bonus to all melee Strikes for 1 round).</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.KysTaC245mOnSnmE]{Undead Guardians}</p>"
                },
                "Water Hazards": {
                    "name": "Water Hazards",
                    "text": "<p>If the campsite is attacked by enemies during the next 24 hours, the attackers suffer a –2 circumstance penalty to Initiative checks as they’re forced to deal with unexpectedly deep puddles, sudden currents in standing water, or thick patches of muddy earth. This penalty increases to –3 once the party reaches 11th level.</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.LN6mH7Muj4hgvStt]{Water Hazards}</p>"
                },
                "Wilderness Survival": {
                    "name": "Wilderness Survival",
                    "text": "<p>Any attempts to Cook a Meal or Treat Disease gain a +1 item bonus during this camping session. If the party level is 11 or higher, the bonus increases to +2</p><p>@UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.v9i9W49PeJ9NkfXX]{Wilderness Survival}</p>"
                },
                "Prepare Campsite": {
                    "name": "Prepare Campsite",
                    "text": "<p>Concentrate, Linguistic, Exploration, Move</p><p>You spend 2 hours searching the hex for a safe and secure location to make camp and then setting up the campsite itself by attempting a Survival check against the Zone DC of the region you’re located in.</p><p>Once a campsite is prepared, you can use the Prepare Campsite activity in this same hex again in the future (but no more than once per 24 hours) to automatically achieve the same degree of success with only an hour of work.</p><hr /><p><strong>Critical Success</strong> You find the perfect spot for a camp. Flat checks to determine encounters at the campsite for the next 24 hours have a DC 2 higher than normal, and the first hour spent performing Camping activities does not incur the usual flat check for random encounters.</p><p><strong>Success</strong> You find a serviceable spot for a camp and for Camping activities.</p><p><strong>Failure</strong> Your campsite will work, but it’s not the best. Campsite activities that require checks take a –2 penalty. @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.X1OvR5j1cAXZ4Lbp]{Prepare Campsite: Failure}</p><p><strong>Critical Failure</strong> The campsite is a mess. You can use it to rest and to perform daily preparations, but it isn’t good enough to allow for Campsite activities at all. Worse, your attempt to secure a campsite has possibly attracted unwanted attention—attempt a flat check against the zone’s Encounter DC. If successful, a random encounter automatically occurs</p>"
                }
            }
        },
        "Camping Quickstart": {
            "name": "Camping Quickstart",
            "pages": {
                "Configure Regions": {
                    "name": "Configure Regions",
                    "text": "<ol><li><p>Click on the 3 dots in the title bar and select <strong>Regions</strong></p></li><li><p>Set the appropriate region names</p></li><li><p>If you are <strong>not using the official module</strong>, import the <strong>Random Encounters</strong> compendium and adjust combat tracks and roll tables</p></li></ol><img src=\"modules/pf2e-kingmaker-tools/img/camping/tutorial/1.webp\" />"
                },
                "Populate Camping Actors": {
                    "name": "Populate Camping Actors",
                    "text": "<ol><li><p>Drag and Drop actors from the actors sidebar onto the plus tile in the camping actor list below the time tracker</p></li></ol><img src=\"modules/pf2e-kingmaker-tools/img/camping/tutorial/2.webp\" />"
                },
                "Prepare Campsite": {
                    "name": "Prepare Campsite",
                    "text": "<ol><li><p>Drop and Drag an actor from the actor list onto Prepare Campsite and roll it</p></li></ol><img src=\"modules/pf2e-kingmaker-tools/img/camping/tutorial/3.webp\" />"
                },
                "Choose Camping Activities": {
                    "name": "Choose Camping Activities",
                    "text": "<ol><li><p>Drag and Drop actors from the actor list onto activities and roll their checks</p></li><li><p>When done, click the <strong>&gt;</strong> button to the right of the activities</p></li></ol><img src=\"modules/pf2e-kingmaker-tools/img/camping/tutorial/4.webp\" />"
                },
                "Choose Recipes": {
                    "name": "Choose Recipes",
                    "text": "<ol><li><p>Drag and Drop actors from the actor list onto each recipe and roll it</p></li><li><p><strong>Favorite Meals</strong> are configured in the 3 dots menu in the title bar</p></li><li><p>Each actor can subsist manually using a @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.0NhBWcZQf1GHp73f]{Subsist: Provisions} macro to add temporary Provision items to their inventory; those are consumed before rations</p></li><li><p>The sidebar shows the total available rations and ingredients above the total consumed ingredients from unrolled recipes below. </p></li></ol><img src=\"modules/pf2e-kingmaker-tools/img/camping/tutorial/5.webp\" />"
                },
                "Rest": {
                    "name": "Rest",
                    "text": "<ol><li><p>Click the Rest button to rest</p></li><li><p>If your rest is interrupted, click it again to complete it</p></li></ol><img src=\"modules/pf2e-kingmaker-tools/img/camping/tutorial/6.webp\" />"
                },
                "Read the full Documentation": {
                    "name": "Read the full Documentation",
                    "text": "<ol><li><p>The full documentation can be viewed by clicking the 3 dots menu and choosing <strong>Help</strong></p></li></ol><img src=\"modules/pf2e-kingmaker-tools/img/camping/tutorial/7.webp\" />"
                }
            }
        },
        "Kingdom Events": {
            "name": "Kingdom Events",
            "pages": {
                "Archaeological Find (Event +0)": {
                    "name": "Archaeological Find (Event +0)",
                    "text": "<p><strong>Beneficial</strong>, <strong>Hex</strong></p><p><strong>Location</strong> A claimed hex of the GM’s choosing but not in the influence of a settlement</p><p><strong>Event</strong> You hear that a well-preserved ruin in a remote reach of your kingdom may contain historical artifacts connected to people who lived in your land long ago. You can send a team of archaeologists to investigate.</p><p><strong>Kingdom skill</strong> Exploration; <strong>Leader</strong> Viceroy</p><hr /><p><strong>Critical Success</strong> The site proves to be an ancient settlement that greatly predates the  expansion into the region. Your people are delighted by the discovery. Reduce Unrest by [[/r 1d4]], and until the end of your next Kingdom turn, all Culture- and Economy-based skill checks gain a +2 circumstance bonus. If any of your settlements has a Museum, you put archaeological findings from this hex on display to the further delight of your citizens. Reduce Unrest by an additional 1.</p><p><strong>Success</strong> The site proves to be remains of an old camp. The discovery is interesting but not particularly surprising. Reduce Unrest by 2.</p><p><strong>Failure</strong> The site proves to be the remains of a relatively recent village abandoned during a previous attempt to settle the lands. Nothing particularly interesting is discovered.</p><p><strong>Critical Failure</strong> You never hear from your archaeologists again. Increase Unrest by [[/r 1d4]] and Decay by 1. You can try to investigate this site again as a Region activity during the Activity phase of any Kingdom turn by attempting another Exploration check, but as the investigation has proven dangerous, the DC increases by 2.</p>"
                },
                "Assassination Attempt (Event +1)": {
                    "name": "Assassination Attempt (Event +1)",
                    "text": "<p><strong>Dangerous</strong></p><p><strong>Event</strong> One of your leaders or prominent citizens is targeted by assassins. The GM determines who hired these assassins, then attempts a @Check[type:flat|dc:11|showDC:all]. On a success, the target is an NPC assigned to a leadership role. On a failure (or if the PCs have no NPC leaders), the target is a notable NPC in the kingdom, preferably one with whom the PCs have established a friendly relationship.</p><p><strong>Kingdom skill</strong> Intrigue; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The assassins are caught, driven off, or otherwise thwarted without ever endangering their targets. The targeted NPC may not even realize they were in danger, but criminal elements in your nation take notice. Reduce Unrest by [[/r 1d4]] and reduce one Ruin of your choice by 1.</p><p><strong>Success</strong> The assassins reach their target but are driven off or defeated before the NPC is harmed.</p><p><strong>Failure</strong> The assassins reach their target and manage to harm but not kill the target before they are driven off or defeated. Gain [[/r 1d4]] Unrest, and if the NPC was a leader, they are removed from that leadership role until the end of the next Kingdom turn.</p><p><strong>Critical Failure</strong> The assassins slay the NPC and escape. If the NPC was a leader, that leadership role is now vacant. Gain [[/r 2d4]] Unrest and [[/r 1d4]] points to Decay.</p><hr /><p>Special If this event occurs while the kingdom is at war, increase the event’s level modifier to +3.</p>"
                },
                "Bandit Activity (Event +1)": {
                    "name": "Bandit Activity (Event +1)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong></p><p><strong>Event</strong> Bandits have begun to prey upon your kingdom! </p><p><strong>Kingdom skill</strong> Defense; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The bandits are captured, run off, or defeated, and merchants can confidently ply their wares. Reduce Unrest by [[/r 1d4]], and during the next Kingdom turn, you gain a +1 circumstance bonus to Economy-based checks.</p><p><strong>Success</strong> The bandits are prevented from preying upon your people, but they continue to be active. Your Resource Dice are reduced by 1 at the start of your next Kingdom turn.</p><p><strong>Failure</strong> The bandits plunder caravans and remote storehouses, and merchants grow cautious and afraid. Gain 1 Unrest, and at the start of your next Kingdom turn, your Resource Dice are reduced by 4.</p><p><strong>Critical Failure</strong> Bandits rampage the land, and even start to encroach into your settlements. Gain [[/r 1d4]] Unrest, increase a Ruin of your choice by 1, and at the start of your next Kingdom turn your Resource Dice are halved or reduced by 4, whichever results in a lower total.</p><hr /><p><strong>Resolution</strong> You can end this continuous event with a critical success on the check. Alternately, if the PCs are eager to seek out the bandits, the GM could build a short side quest to play out their attempt to defeat them.</p>"
                },
                "Boomtown (Event +0)": {
                    "name": "Boomtown (Event +0)",
                    "text": "<p><strong>Beneficial</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> The smallest settlement in the nation </p><p><strong>Event</strong> Commerce and trade booms in one of your settlements, drawing many join the flurry of activity.</p><p><strong>Kingdom skill</strong> Trade; <strong>Leader</strong> Treasurer</p><hr /><p><strong>Critical Success</strong> At the start of the next Kingdom turn, you gain 4 bonus Resource Dice. For the rest of that turn, item bonuses from structures in the settlement are doubled; this increase can exceed the normal maximum item bonus your structures can provide.</p><p><strong>Success</strong> You gain 2 bonus Resource Dice at the start of the next Kingdom turn. For the remainder of that turn, the item bonus granted by one of the settlement’s structures (chosen by the players) is doubled; this increase can exceed the normal maximum item bonus your structures can provide.</p><p><strong>Failure</strong> You gain 1 bonus Resource Die at the start of the next Kingdom turn.</p><p><strong>Critical Failure</strong> The boom is brief before it bursts like a bubble, leaving many merchants jealous and frustrated about not being able to take part. You gain 2 fewer Resource Dice on your next Kingdom turn.</p><hr /><p><strong>Special</strong> Boomtown events create a large amount of unexpected waste and trash. If a boomtown event occurs in a settlement without a dump, the result of the Trade check is worsened one degree.</p>"
                },
                "Building Demand (Event -1)": {
                    "name": "Building Demand (Event -1)",
                    "text": "<p><strong>Continuous</strong>,<strong> Dangerous</strong>,<strong> Settlement</strong></p><p><strong>Location</strong> The largest settlement in the nation </p><p><strong>Event</strong> The citizens of the affected settlement demand that a particular structure be either built or demolished (equal chance of either). If the citizens demand a new structure, the GM chooses one as close to the kingdom’s level as possible, preferably one that decreases Unrest when built. If the citizens demand a structure be demolished, the GM chooses one that best fits the storyline of the campaign, preferably one whose item bonus or other benefits have been rendered obsolete by newer structures. If you are willing to commit each upcoming Civic activity granted by this settlement to attempting the requested Build Structure or Demolish activity until they succeed, you do not attempt the check.</p><p><strong>Kingdom skill</strong> Politics; <strong>Leader</strong> Viceroy</p><hr /><p><strong>Critical Success</strong> You persuade the citizens to give up their demands.</p><p><strong>Success</strong> You quell the citizens’ demands for now, but they are not happy about your refusal to comply. Gain 1 Unrest. </p><p><strong>Failure</strong> The citizens continue their demands and some refuse to work in protest. Gain 1 Unrest and roll 2 fewer Resource dice at the start of your next turn.</p><p><strong>Critical Failure</strong> As failure, but violence during the protests also increases Decay by 1.</p><hr /><p><strong>Resolution</strong> You can end this continuous event by critically succeeding or succeeding at the check or successfully building or demolishing the requested structure.</p>"
                },
                "Crop Failure (Event +0)": {
                    "name": "Crop Failure (Event +0)",
                    "text": "<p><strong>Dangerous</strong>, <strong>Hex</strong></p><p><strong>Location</strong> A Farmland hex of the GM’s choice. If there are no Farmlands in the kingdom, this event has no effect. </p><p><strong>Event</strong> Pests, blight, or bad weather damage the harvest.</p><p><strong>Kingdom skill</strong> Agriculture; <strong>Leader</strong> Treasurer</p><hr /><p><strong>Critical Success</strong> You contain the damage from the crop failure without it impacting your kingdom’s resources. </p><p><strong>Success</strong> You contain the crop failure, but not before it impacts your kingdom. Increase your kingdom’s Consumption by 1 during the next Kingdom turn. </p><p><strong>Failure</strong> The crop failure wipes out entire fields. Increase your kingdom’s Consumption by [[/r 1d4+1]] during the next Kingdom turn.</p><p><strong>Critical Failure</strong> As failure, but the crop failure is so devastating that the Farmland is destroyed.</p>"
                },
                "Cult Activity (Event +1)": {
                    "name": "Cult Activity (Event +1)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> A randomly determined settlement of the GM’s choice—the GM should not reveal which one to the PCs until they succeed at this event’s Intrigue check, as until then the location of the cult’s hideout should remain a mystery to solve!</p><p><strong>Event</strong> A religious cult opposed to the kingdom’s goals or established religions begins kidnapping, converting, or sacrificing citizens. The cult remains secret and hidden in one of the nation’s settlements, operating out of a covert temple or safehouse somewhere in the settlement. You must attempt the Intrigue check to locate the cult each Kingdom turn until you succeed in doing so; then, you must attempt the Folklore check each Kingdom turn until you defeat the cult.</p><p><strong>Kingdom skill</strong> Intrigue; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> You discover which settlement houses the cult’s headquarters. When you attempt Folklore checks to defeat the cult, reduce the DC by 5.</p><p><strong>Success</strong> As critical success, but without reducing the Folklore DC. Increase Unrest by 1 as a result of the cult’s activities.</p><p><strong>Failure</strong> You fail to determine where the cult’s headquarters are. Increase Unrest by 1 as a result of the cult’s activities.</p><p><strong>Critical Failure</strong> As failure, but increase Unrest by [[/r 1d4]] and increase Corruption by 1.</p><p><strong>Kingdom skill</strong> Folklore; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> The cult is destroyed. Reduce Unrest by [[/r 1d6]] and reduce one Ruin of your choice by 1. Gain [[/r 1d6]] Luxury Commodities from valuables recovered from the cult headquarters.</p><p><strong>Success</strong> The cult is driven out of town but not destroyed. Choose one of the following rewards: reduce Unrest by [[/r 1d4]], reduce one Ruin by 1, or gain [[/r 1d4]] Luxury Commodities.</p><p><strong>Failure</strong> The cult persists and expands its nefarious plans. Gain 1 Unrest and attempt a @Check[type:flat|dc:6] flat check; if you fail this check, increase Corruption by 1.</p><p><strong>Critical Failure</strong> The cult’s activities grow particularly blatant and disruptive. Increase Unrest by [[/r 1d4]] and Corruption by 1.</p><hr /><p><strong>Resolution</strong> After the cult’s headquarters are discovered, to end this continuous event the PCs must defeat the cult by succeeding at the Folklore check. Optionally, the GM can build a short adventure for the PCs to infiltrate the cult headquarters and defeat them in encounter mode.</p><hr /><p><strong>Special</strong> If this event occurs in a settlement with a Sewer System, you take a –2 item penalty to Intrigue checks to discover the cult’s hideout. If this event occurs while the PCs are playing through Chapter 5, increase the event’s level modifier to +3. The cult in this case is always associated with the worship of Lamashtu.</p>"
                },
                "Diplomatic Overture (Event +0)": {
                    "name": "Diplomatic Overture (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> Another nation or group sends an ambassador to your kingdom. The group sending the overture is randomly selected from the Negotiation DCs sidebar on page 519. If the kingdom has established diplomatic relations with that group, the event proceeds with the Statecraft check below. If the kingdom has not yet established diplomatic relations with the group, this event instead gives the kingdom the opportunity to immediately use the Send Diplomatic Envoy Leadership activity.</p><p><strong>Kingdom skill</strong> Statecraft; <strong>Leader</strong> Emissary</p><hr /><p><strong>Critical Success</strong> The diplomatic meeting is incredibly successful, and you can choose two of the following benefits: gain 5 Commodities of your choice, gain an additional 2 Resource Dice at the start of your next turn, or automatically establish a trade agreement with the group.</p><p><strong>Success</strong> As success, but choose only one benefit. </p><p><strong>Failure</strong> Your meeting is cordial but unproductive. </p><p><strong>Critical Failure</strong> Your diplomatic meeting goes poorly. Unless you bribe the group with either 5 Commodities of your choice or 10 RP, they break off diplomatic relations with you.  Reestablishing diplomatic relations can be attempted via future Send Diplomatic Envoy activities in the usual manner, but with a –2 circumstance penalty.</p>"
                },
                "Discovery (Event +0)": {
                    "name": "Discovery (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> Scholars unearth a bit of ancient lore or devise important new research of their own.</p><p><strong>Kingdom skill</strong> Scholarship; <strong>Leader</strong> Counselor </p><hr /><p><strong>Critical Success</strong> Your discovery brings glory and a boon to your resources! At the start of your next Kingdom turn, gain 1 Fame or Infamy point (as appropriate) and gain 6 bonus Resource Dice. Your people are amazed. Reduce Unrest by 2.</p><p><strong>Success</strong> Your discovery is a helpful (but not overly amazing) boon to your kingdom’s resources. On your next turn, gain 3 bonus Resource Dice. </p><p><strong>Failure</strong> Your discovery is of some academic interest but ultimately of limited use. Gain 1 bonus Resource Die at the start of your next turn.</p><p><strong>Critical Failure</strong> Your discovery turns out to be a dead end and a wasteful boondoggle. Reduce your total Resource Dice by 2 next turn.</p>"
                },
                "Drug Den (Event +1)": {
                    "name": "Drug Den (Event +1)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> The largest settlement in the kingdom; the GM secretly selects one of the Residential lots to house a drug den.</p><p><strong>Event</strong> One of the Residential lots in your settlement has become an illicit hive for trading harmful and addictive drugs, and as long as it continues to operate, it could bring ruin to your entire kingdom.</p><p><strong>Kingdom skill</strong> Intrigue; <strong>Leader</strong> Counselor</p><hr /><p><strong>Critical Success</strong> You uncover and stop the drug ring before it causes a lot of damage, bringing counseling to those who may need it.</p><p><strong>Success</strong> You work to minimize the damage done by the illicit drug trade, but the activity continues. Gain 1 Unrest. </p><p><strong>Failure</strong> Drug dealers continue to spread their influence. Addiction increases and harms productivity, and drug-related crime grows. Increase Unrest, Crime, and Decay by 1 each.</p><p><strong>Critical Failure</strong> Your attempt is a total failure. Increase Unrest by [[/r 1d4]] and increase Crime and Decay (one score by 1, the other score by 2). In addition, the Residential lot that the drug den was located in is reduced to Rubble. The drug den then moves to another lot chosen by the GM (see Location, above).</p><hr /><p><strong>Resolution</strong> A critical success on the check ends this continuous event. Optionally, the GM can instead build a short adventure for the PCs to infiltrate the drug den and defeat the criminals in encounter mode.</p>"
                },
                "Economic Surge (Event +2)": {
                    "name": "Economic Surge (Event +2)",
                    "text": "<p><strong>Beneficial</strong>, <strong>Continuous</strong></p><p><strong>Event</strong> Trade and productivity have been booming throughout your kingdom.</p><p><strong>Kingdom skill</strong> Trade; <strong>Leader</strong> Treasurer</p><hr /><p><strong>Critical Success</strong> A trade bonanza brings unexpected profits. Gain 2 bonus Resource Dice at the start of your next Kingdom turn.</p><p><strong>Success</strong> As critical success but you gain only 1 bonus Resource Die at the start of your next Kingdom turn.</p><p><strong>Failure</strong> The economic surge slows for a bit; if you failed at this check on your previous Kingdom turn, the Economic Surge event ends.</p><p><strong>Critical Failure</strong> The economic surge comes to an end. </p><hr /><p><strong>Resolution</strong> This continuous event ends following either a critical failure or two consecutive failures on the check.</p>"
                },
                "Expansion Demand (Event +0)": {
                    "name": "Expansion Demand (Event +0)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong></p><p><strong>Event</strong> The citizens of your kingdom want expansion! If you successfully Claimed a Hex this turn, the result of your check for this event is improved one degree. </p><p><strong>Kingdom skill</strong> Exploration; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> Your citizens are pleased with the growth of the kingdom.</p><p><strong>Success</strong> You satisfy the citizens’ demands for growth, but if you don’t successfully Claim a Hex during your next Kingdom turn, increase Unrest by 1.</p><p><strong>Failure</strong> Your citizens remain unhappy with your kingdom’s growth. Increase Unrest by 1. If you don’t successfully Claim a hex during your next Kingdom turn, increase Unrest by 1 again.</p><p><strong>Critical Failure</strong> As failure, but increase the Unrest by 2.</p><hr /><p><strong>Resolution</strong> Achieve either a success or critical success at this event.</p>"
                },
                "Festive Invitiation (Event +0)": {
                    "name": "Festive Invitiation (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> Your kingdom’s leaders are invited to a festival in a region in which the kingdom has established diplomatic relations. The GM chooses an existing diplomatic ally to send the invitation and should customize the details of that event to match that ally; if your kingdom has no diplomatic relations, this event has no effect. When your leaders attend the festival, you can bring up to 4 Resource Dice as “gifts” to the festival; reduce the number of Resource Dice you roll on the next Kingdom turn by this amount</p><p><strong>Kingdom skill</strong> Arts; <strong>Leader</strong> Ruler</p><hr /><p><strong>Critical Success</strong> You entertain and delight your host and bolster your alliance with their people, and they gratefully reciprocate your gifts. For each Resource Die you brought as a gift, choose a type of Commodity. Then roll the die; you gain that amount of that Commodity. Attempt a @Check[type:flat|dc:11]. If you are successful, your ally extends a Diplomatic Overture or a Visiting Celebrity event (equal chance of either) during the Event phase of your next Kingdom turn (in addition to any other event that would occur).</p><p><strong>Success</strong> The festival is a delight. If you brought Resource Dice as gifts, choose a Commodity. You gain an amount of that Commodity equal to the number of Resource Dice you brought as gifts.</p><p><strong>Failure</strong> The festival was entertaining enough, but if you brought Resource Dice as gifts, they’re not reciprocated.</p><p><strong>Critical Failure</strong> One of your leaders committed a faux pas during the festival, and the celebration ends prematurely. Attempt a @Check[type:flat|dc:11]. If you fail, your host cuts ties with your kingdom; gain 1 Unrest. (In the future, you may attempt to reestablish diplomatic relations in the usual way.)</p>"
                },
                "Feud (Event +0)": {
                    "name": "Feud (Event +0)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> Two settlements of the GM’s choice. If the kingdom doesn’t have at least two settlements, then this event has no effect.</p><p><strong>Event</strong> A rivalry between influential groups (nobles, guilds, politicians, etc.) from two different settlements has escalated and may soon turn violent.</p><p><strong>Kingdom skill</strong> Politics; <strong>Leader</strong> Counselor</p><hr /><p><strong>Critical Success</strong> You mediate the rivals’ differences and not only get them to drop their feud, but also broker an alliance between the two. The feud ends, and the rivals are particularly productive during the next turn. Gain 2 bonus Resource Dice at the beginning of the next Kingdom turn.</p><p><strong>Success</strong> You get the rivals to back down, though their mutual dislike simmers behind the scenes. The feud continues into the next turn. </p><p><strong>Failure</strong> You fail to quiet the rivals and they continue duels, rumormongering, intrigue, and strife. The conflict prevents you from recruiting armies in the two affected settlements until the next Kingdom turn. Increase Unrest by 1.</p><p><strong>Critical Failure</strong> The rivals ignore royal commands and disrupt both settlements with their private war. The ongoing feud prevents you from recruiting armies in the two affected settlements until the feud ends. In addition, skirmishing increases Unrest by 2 and one Ruin of your choice by 1; these increases are doubled to 4 Unrest and 2 Ruin if you critically failed this</p><p>check last turn.</p><hr /><p><strong>Resolution</strong> The feud ends when you achieve a critical success on the check. If this continuous event has occurred for at least 3 consecutive Kingdom turns, you may choose to resolve it at the end of a Kingdom turn by spending 4 Resource Dice of RP to pay off the feuding factions.</p>"
                },
                "Food Shortage (Event +1)": {
                    "name": "Food Shortage (Event +1)",
                    "text": "<p><strong>Dangerous</strong></p><p><strong>Event</strong> Spoilage, treachery, or bad luck has caused a food shortage this turn.</p><p><strong>Kingdom skill</strong> Agriculture; <strong>Leader</strong> Treasurer</p><hr /><p><strong>Critical Success</strong> Through careful rationing, you manage to get through the shortage without harm.</p><p><strong>Success</strong> Your shortages are manageable, with some workers going hungry. Your kingdom’s Consumption is increased by 1 at the start of the next turn. Attempt a @Check[type:flat|dc:6]. On a failure, this event reoccurs next turn (in addition to any other event that would occur).</p><p><strong>Failure</strong> The shortages are severe. Your kingdom’s Consumption is increased by 1 per settlement at the start of the next turn. Attempt a @Check[type:flat|dc:16]. On a failure, this event reoccurs next turn (in addition to any other event that would occur).</p><p><strong>Critical Failure</strong> The shortages are catastrophic. Increase Unrest by 2 and Strife by 1, and your kingdom’s Consumption is increased by 1 per settlement at the start of the next turn. This event reoccurs next turn (in addition to any other event that would occur).</p>"
                },
                "Food Surplus (Event +0)": {
                    "name": "Food Surplus (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> Local crops thrive, hunters do very well, or livestock numbers are greater than expected. If this event occurs, it immediately ends any ongoing food shortage event. </p><p><strong>Kingdom skill</strong> Agriculture; <strong>Leader</strong> Treasurer</p><hr /><p><strong>Critical Success</strong> Your bumper crops include wild harvests that allow you to skip the entire Pay Consumption step of the Upkeep phase of your next Kingdom turn. Gain [[/r 1d6]] Food Commodities.</p><p><strong>Success</strong> Your excess crops lead to increased supplies. Treat your Consumption during the next Kingdom turn as 2 lower than its actual score and gain [[/r 1d6]] Food Commodities.</p><p><strong>Failure</strong> The food surplus isn’t as huge as you’d expected. Treat your Consumption during the next turn as 1 lower than its actual score.</p><p><strong>Critical Failure</strong> What you thought was an excess of food is infested with spoilage, ergot, or other contamination. Increase Unrest by 1 and one Ruin of your choice by1.</p>"
                },
                "Good Weather (Event +1)": {
                    "name": "Good Weather (Event +1)",
                    "text": "<p><strong>Benficial</strong>, <strong>Fortune</strong></p><p><strong>Event</strong> Good weather raises spirits among citizens.</p><p><strong>Kingdom skill</strong> Wilderness; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> The glorious climate puts everyone in an excellent mood. Reduce Unrest by [[/r 1d6]], and once during your next Kingdom turn when you attempt an Agriculture, Boating, Exploration, or Wilderness check, you can roll twice and take the better result.</p><p><strong>Success</strong> Extended good weather makes life pleasant and easy. Reduce Unrest by [[/r 1d4]].</p><p><strong>Failure</strong> Good weather produces a short but pleasant respite. Reduce Unrest by 1.</p><p><strong>Critical Failure</strong> The good weather doesn’t last long enough to help.</p>"
                },
                "Inquisition (Event +1)": {
                    "name": "Inquisition (Event +1)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong></p><p><strong>Event</strong> Demagogues and zealots mobilize public opinion against a particular ancestry, religion, kingdom, behavior, or leader. This particular inquisition’s dogma and beliefs are driven by a combination of fear, hatred, and ignorance, yet its members are nevertheless compelling and charismatic.</p><p><strong>Kingdom skill</strong> Folklore; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> Choose to either pacify or defeat the inquisitors. If you pacify them, the inquisition event ends but the inquisitors remain active—if this event occurs again, they are even more headstrong; increase the event’s level modifier by 2. If you defeat them, the inquisition ends but the violence of the event increases one Ruin of your choice by 1.</p><p><strong>Success</strong> You protect the targeted victims of the inquisition, though the inquisition’s ideas continue to spread. Increase Unrest by 1.</p><p><strong>Failure</strong> The inquisitors strike out in force. Gain [[/r 1d4]] Unrest and increase two Ruins of your choice by 1.</p><p><strong>Critical Failure</strong> As failure, but the Inquisition targets a specific structure in one of your settlements (the GM selects a structure appropriate to the inquisition’s nature of intolerance or hatred). Attempt a basic Defense check. If you fail, that structure is reduced to Rubble and increase Decay by 1.</p><hr /><p><strong>Resolution</strong> This event continues until you achieve a critical success at resolving the event. Alternately, the inquisition can be ended by having the PCs go on a short quest to infiltrate the inquisition’s headquarters to confront and defeat its leaders.</p>"
                },
                "Justice Prevails (Event +0)": {
                    "name": "Justice Prevails (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> The authorities catch a notorious criminal, exonerate a wrongfully accused innocent, shut down a major criminal operation, or thwart a plot against a settlement. Whatever the case, some injustice that has long vexed your citizens has finally been resolved.</p><p><strong>Kingdom skill</strong> Statecraft; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The triumph of law and justice invites celebration. Reduce Unrest by [[/r 1d6]] and reduce each Ruin by 1. Alternately, if you’re suffering from a continuous Bandit Activity, Cult Activity, Drug Den, Inquisition, Sacrifices, Sensational Crime, Squatters, or Vandals event, you can instead cause that event to end.</p><p><strong>Success</strong> A celebration of the common good delights the locals. Reduce Unrest by [[/r 1d4]] or reduce two Ruins of your choice by 1 each.</p><p><strong>Failure</strong> Justice is done, but at a cost of bad publicity. If you don’t Quell Unrest at least once during the next Kingdom turn, the kingdom gains [[/r 1d4]] Unrest at the end of the next turn.</p><p><strong>Critical Failure</strong> The victory is undercut by backdoor deals that let the guilty escape justice or reveal unpleasant secrets. Gain [[/r 1d4]] Unrest, 2 Crime, and 1 point to another Ruin of your choice.</p>"
                },
                "Land Rush (Event +1)": {
                    "name": "Land Rush (Event +1)",
                    "text": "<p><strong>Dangerous</strong>, <strong>Hex</strong></p><p><strong>Location</strong> An unclaimed hex adjacent to your kingdom’s border</p><p><strong>Event</strong> Overeager settlers attempt to construct Farmland or a Work Site (as chosen by the GM) at their own expense in the wilderness, and they begin squabbling over the site’s ownership.</p><p><strong>Kingdom skill</strong> Politics; <strong>Leader</strong> Viceroy</p><hr /><p><strong>Critical Success</strong> You mediate the conflict among the settlers, and in thanks, they agree to join your kingdom. You automatically claim the Hex, gaining 10 kingdom XP (page 540) and increasing your kingdom’s Size by 1 (this affects all statistics determined by Size; see page 532). You immediately gain the benefits of the Farmland or Work Site the settlers built. Decrease Unrest by 1.</p><p><strong>Success</strong> You mediate the conflict among the settlers, and they agree to join your kingdom if you pay them 4 Resource Dice of RP. If you do so, treat this as a critical success. If you refuse, treat this as a Failure. </p><p><strong>Failure</strong> The settlers refuse any overture to join your kingdom and their bickering continues, ultimately resulting in the destruction of their hard work and many deaths. Your kingdom isn’t significantly impacted, but your failure to handle the situation generates unease. Increase Unrest by 1.</p><p><strong>Critical Failure</strong> As failure, but the fighting spills over into your kingdom before it resolves itself. Increase Unrest by [[/r 1d4]] and two Ruins of your choice by 1.</p>"
                },
                "Local Disaster (Event +0)": {
                    "name": "Local Disaster (Event +0)",
                    "text": "<p><strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> A randomly determined settlement Event A disaster strikes the settlement, be it fire, flooding, earthquakes, an architectural failure, or the like. </p><p><strong>Kingdom skill</strong> Industry; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> You prepared well for the disaster and the settlement survives intact and undamaged. </p><p><strong>Success</strong> The settlement still functions despite the loss of some resources. During the next turn, reduce your Resource Dice total by 2.</p><p><strong>Failure</strong> Several lots in the settlement are torn up, including at least one structure. Gain 1 Decay and place rubble into three lots of the PCs’ choice in the settlement’s Urban Grid. During the next turn, reduce your Resource Dice total by 4.</p><p><strong>Critical Failure</strong> Destruction is widespread. Roll [[/r 1d6]] and gain that number of points of Decay. Then select an equal number of adjacent blocks in your settlement and place rubble into one lot of your choice within each selected block. If a structure is in that lot, it’s reduced to rubble. During the next turn, reduce your Resource Dice total by 6.</p><hr /><p><strong>Special</strong> If this event occurs in a settlement with a cemetery, fewer resources are needed to properly honor those who die during the event. Halve all Resource Dice reductions created by this event.</p>"
                },
                "Monster Activity (Event +0)": {
                    "name": "Monster Activity (Event +0)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Hex</strong></p><p><strong>Location</strong> A claimed hex chosen by the GM that isn’t in the influence of a settlement</p><p><strong>Event</strong> A monster, or even an entire group of monsters attacks the kingdom! Determine the encounter by rolling on the random encounter table that is the same level as the kingdom’s level. If the kingdom is 20th level, roll on the next highest zone and apply the elite adjustments (Pathfinder Bestiary 6) to the creatures.</p><p><strong>Kingdom skill</strong> Defense; <strong>Leader</strong> Ruler</p><hr /><p><strong>Critical Success</strong> The monsters are slain or driven off without harm to your kingdom. Even better, an unexpected claim of treasure gained from the monster lair grants [[/r 1d4]] Luxuries and 2 bonus Resource Dice on the next turn.</p><p><strong>Success</strong> The monsters attack some of your citizens but are driven off before they do too much damage. The threat persists, and while fear continues to slowly spread, your kingdom suffers no physical damage at this time. Increase Unrest by 1.</p><p><strong>Failure</strong> The monsters’ rampage terrorizes the countryside and results in frightening rumors even in the heart of the kingdom’s safest cities. The closest Farmland or Work Site to the monster’s hex is destroyed. Gain [[/r 1d4]] Unrest and 1 Decay.</p><p><strong>Critical Failure</strong> As failure, but the monsters’ assaults spread into the settlement closest to the monster’s hex, spreading the danger they represent more and more through your kingdom. If any of your settlement’s borders aren’t protected by water or a wall, or if the monster can fly or swim (as appropriate) across any of your protective borders, the monster enters the settlement and one structure chosen by the players is reduced to rubble. Gain [[/r 1d4]] Unrest and 2 Decay. Otherwise, the monsters’ ability to harm the settlement is hampered by your defenses. Gain 1 Unrest and one of the settlement’s walls is destroyed; uncheck it on your Urban Grid.</p><hr /><p><strong>Resolution</strong> This event continues until you achieve a critical success on the check or until the PCs step in to track down and defeat the monster(s) themselves.</p>"
                },
                "Natural Disaster (Event +2)": {
                    "name": "Natural Disaster (Event +2)",
                    "text": "<p><strong>Dangerous</strong></p><p><strong>Event</strong> A natural cataclysm such as a wildfire, devastating weather, earthquake, or flood (as determined by the GM) devastates your kingdom. While in a worst-case scenario the disaster’s immediate and most destructive effects affect a single settlement, many of its effects are larger in scope and can affect the entire kingdom.</p><p><strong>Kingdom skill</strong> Wilderness; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> You prepared well for the disaster. While disruptive, the damage is minimized. </p><p><strong>Success</strong> Your quick response keeps your people safe and allows you to recover quickly. During the next turn, reduce your Resource Dice total by 4. </p><p><strong>Failure</strong> The disaster causes severe damage. Choose one claimed hex in which you have a Farmland or Work Site; that feature is destroyed. Gain 1 Decay and [[/r 1d6]] Unrest. During the next turn, reduce your Resource Dice total by 6.</p><p><strong>Critical Failure</strong> Multiple hexes are totally devastated. Choose [[/r 1d6]] claimed hexes in which you have Farmlands or Work Sites; those features are destroyed. Gain 1 Decay for each hex affected, and gain [[/r 2d6]] Unrest. In addition, one settlement of your choice is particularly hard hit; that settlement immediately suffers the effects of a Local Disaster (page 560). During the next turn, reduce your Resource Dice total by 8.</p>"
                },
                "Nature's Blessing (Event +0)": {
                    "name": "Nature's Blessing (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> A natural event, such as a bloom of rare wildflowers in a previously empty field, a glorious omen in the night sky like the northern lights, or the return to prominence of a previously rare type of wildlife raises your kingdom’s morale and inspires its creators.</p><p><strong>Kingdom skill</strong> Arts; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> The glow of the blessing brings lasting delight. During your next turn, the results of checks to Craft Luxuries or Create a Masterpiece are improved one degree. Decrease Unrest by [[/r 1d6]].</p><p><strong>Success </strong>Your blessing touches the hearts of all. You gain a +1 status bonus to Culture- and Stability-based checks on your next Kingdom turn. </p><p><strong>Failure</strong> The blessing inspires some of your people but not all of them.</p><p><strong>Critical Failure</strong> Arguments over the meaning of the blessing taint people’s goodwill. Increase Unrest by 1.</p>"
                },
                "New Subjects (Event +0)": {
                    "name": "New Subjects (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> A small group of intelligent creatures joins your kingdom and submits to your rule, bringing along their knowledge of hidden places within your kingdom. (The exact nature and ancestry of these new subjects is determined by the GM.)</p><p><strong>Kingdom skill</strong> Statecraft; <strong>Leader</strong> Emissary</p><hr /><p><strong>Critical Success</strong> Your subjects blend in seamlessly and are welcomed by your citizens, while bringing their own unique contributions to your kingdom. You gain 6 bonus Resource Dice at the start of the next Kingdom turn, and you gain an additional Region activity during the Activity phase of the next Kingdom turn.</p><p><strong>Success</strong> Your new subjects are welcomed, and their contributions help in the short term. Gain 3 bonus Resource Dice next turn.</p><p><strong>Failure</strong> Your new subjects endure discrimination from intolerant citizens in your kingdom, but they nonetheless bring willing hands to work and such resources as they possess. Increase Unrest by 1 but gain 1 bonus Resource Die next turn.</p><p><strong>Critical Failure</strong> Your new subjects encounter discrimination and xenophobia, and they are eventually driven back into the wild. Increase Unrest by [[/r 1d4]] and Strife by 1.</p>"
                },
                "Noblesse Oblige (Event +0)": {
                    "name": "Noblesse Oblige (Event +0)",
                    "text": "<p><strong>Benficial</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> A settlement that includes at least one mansion or noble villa. If there are no settlements in the kingdom with these structures, this event doesn’t occur. </p><p><strong>Event</strong> A noble family or wealthy benefactor offers to build an improvement to beautify the settlement. </p><p><strong>Kingdom skill</strong> Arts; <strong>Leader</strong> Viceroy</p><hr /><p><strong>Critical Success</strong> The nobles build a monument and a park in lots of the players’ choice at no expense to the kingdom (the Build Structure activity is not required). </p><p><strong>Success</strong> The nobles pay the RP and Commodity cost of either a monument or a park, provided the party uses the Civic activity granted by this settlement in the next Kingdom turn to Build the Structure. The Build Structure check automatically succeeds.</p><p><strong>Failure</strong> Although the nobles had good intentions, bickering among individual aristocrats ultimately prevents the project from ever taking place.</p><p><strong>Critical Failure</strong> As failure, but the bickering persists. Gain 1 Unrest and attempt a @Check[type:flat|dc:11]. On a failure, your kingdom suffers a Feud event on the next turn’s Event phase (in addition to any other event).</p>"
                },
                "Outstanding Success (Event +0)": {
                    "name": "Outstanding Success (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> One of your kingdom’s citizens brings glory to the kingdom, be it through an artistic masterpiece, an architectural marvel, a grand voyage of discovery, a landmark academic treatise, a new magical theory, or a similar discovery, as decided upon by the party.</p><p><strong>Kingdom skill</strong> Arts; <strong>Leader</strong> Counselor</p><hr /><p><strong>Critical Success</strong> The citizen’s success is truly legendary. Gain 3 bonus Resource Dice on your next turn.</p><p><strong>Success</strong> This success brings fame and fortune to your kingdom. Gain 1 bonus Resource Die on your next turn. </p><p><strong>Failure</strong> The success inspires imitators and rapidly loses its specialness, but you suffer no jealousy-driven backlash. </p><p><strong>Critical Failure</strong> Scandal! Either the artist’s sinister motives are exposed by their sudden fame, competitors work to undermine them, or the public simply refuses to accept the success.  Increase Unrest by 1 and Corruption by 1.</p>"
                },
                "Pilgrimage (Event +1)": {
                    "name": "Pilgrimage (Event +1)",
                    "text": "<p><strong>Benficial</strong></p><p><strong>Event</strong> A large number of pilgrims flock to your settlements to celebrate their high holy days or to bask in your kingdom’s faith. If your kingdom does not have at least one shrine, temple, or cathedral, this event does not occur. </p><p><strong>Kingdom skill</strong> Folklore; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> Pilgrims visit all of your settlements to engage in acts of worship. Not only do they provide their own food and supplies, but they also bring gifts to your shrines, temples, and cathedrals. Gain [[/r 1d6]] Luxuries, reduce Unrest by [[/r 1d6]], and reduce one Ruin of your choice by 1.</p><p><strong>Success</strong> The pilgrims celebrate their holy days at your settlements, and their good cheer and attitudes prove infectious. Reduce Unrest by [[/r 1d4]].</p><p><strong>Failure</strong> As success, but the pilgrims put a strain on your kingdom’s resources. Increase Consumption by [[/r 1d4]] on the next turn.</p><p><strong>Critical Failure</strong> The pilgrims hold their festivals, but their devout displays by a few strident zealots who stay behind stir up controversy with locals of other faiths. Increase Corruption by 1 and increase Consumption by [[/r 1d4]] on the next turn.</p>"
                },
                "Plague (Event +1)": {
                    "name": "Plague (Event +1)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> The largest settlement in the kingdom </p><p><strong>Kingdom skill</strong> Defense; <strong>Leader</strong> Ruler</p><p><strong>Event</strong> A deadly sickness strikes one of your settlements. You take a –2 status penalty to all Civic activities made in a settlement suffering from a plague unless the settlement has a sewer system.</p><hr /><p><strong>Critical Success</strong> You halt the spread of the plague and are able to cure it, but even so, the plague’s effects reduce your Resource Dice on the next turn by 2.</p><p><strong>Success</strong> The plague continues! Gain [[/r 1d4]] Unrest and increase one of your Ruins by 1.</p><p><strong>Failure</strong> The plague spreads and claims more victims. Gain [[/r 1d6]] Unrest and increase all of your Ruins by 1.</p><p><strong>Critical Failure</strong> As failure, but the plague spreads to the nearest unaffected settlement in your kingdom. Treat additional plagues in different settlements as separate continuous Plague events.</p><hr /><p><strong>Resolution</strong> This Plague event ends if you achieve a critical success on the check or after you achieve a total of 4 successes with the Provide Care activity (a critical success with Provide Care counts as 2 successes in this case). </p><hr /><p><strong>Special</strong> If the plague strikes a settlement that has no dumps, filth in the streets allows the disease to spread more easily. You take a –4 item penalty to checks to resolve this event. On the other hand, if a plague-stricken settlement has a sewer system, the increased sanitation provides a +2 item bonus to checks to resolve this event.</p>"
                },
                "Political Calm (Event -1)": {
                    "name": "Political Calm (Event -1)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> A sudden absence of political machinations and distracting intrigue coincides with a rise in public approval for its leaders.</p><p><strong>Kingdom skill</strong> Politics; <strong>Leader</strong> Ruler</p><hr /><p><strong>Critical Success</strong> You capitalize upon the public approval with efficiency and speed. Reduce Unrest by [[/r 1d6]] or reduce one Ruin of your choice by 1. Gain a +2 status bonus to all checks made to resolve events during your next Kingdom turn.</p><p><strong>Success</strong> Loyalty is up across the board. Reduce Unrest by [[/r 1d4]].</p><p><strong>Failure</strong> The calm is a refreshing change, but people sense it cannot last. Reduce Unrest by 1.</p><p><strong>Critical Failure</strong> The calm simply hides deeper plotting simmering in the shadows. Increase one Ruin by 1.</p>"
                },
                "Public Scandal (Event +0)": {
                    "name": "Public Scandal (Event +0)",
                    "text": "<p><strong>Dangerous</strong></p><p><strong>Event</strong> One of your NPC leaders is implicated in a crime or an embarrassing situation. If you have no NPC leaders, this event involves a PC leader only if the GM determines that the PC leader has been acting in a way that could cause a scandal; otherwise this event does not occur.</p><p><strong>Kingdom skill</strong> Intrigue; <strong>Leader</strong> Counselor</p><hr /><p><strong>Critical Success</strong> You quiet the scandal before it spawns more than rumors.</p><p><strong>Success</strong> Word gets out, but an apology and careful words manage to blunt the outrage. Gain 1 Unrest. </p><p><strong>Failure</strong> The people are very unhappy with their leader’s behavior. Gain [[/r 1d4]] Unrest and increase Corruption by 1. </p><p><strong>Critical Failure</strong> The people are outraged by the scandal and demand the leader be replaced. Gain [[/r 1d6]] Unrest and increase a Ruin of your choice by 1. Then immediately use the New Leadership kingdom activity (page 520) to attempt to replace the leader. If you fail, this event occurs again with the same leadership role on the kingdom’s next Event phase. If the leader involved in the scandal takes any leadership role during the next [[/r 1d4]] Kingdom turns, this event occurs again with that character at the focus of the scandal.</p>"
                },
                "Remarkable Treasure (Event +2)": {
                    "name": "Remarkable Treasure (Event +2)",
                    "text": "<p><strong>Beneficial</strong>, <strong>Fortune</strong></p><p><strong>Event</strong> Adventurers from outside of your kingdom discover a cache of rare and unusual treasures while exploring wilderness claimed by your nation. </p><p><strong>Kingdom skill</strong> Exploration; <strong>Leader</strong> Emissary</p><hr /><p><strong>Critical Success</strong> The adventurers are only too eager to share their discoveries with the kingdom. The treasures buoy the local economy and spawn a rush of prospectors out looking for their own treasures. Gain [[/r 1d6]] Luxuries and decrease Unrest by [[/r 1d4]]. Gain one Fame or Infamy point (as appropriate) at the start of the next Kingdom turn. If you Hire Adventurers during your next Kingdom turn, roll twice for the skill check and take the better result.</p><p><strong>Success</strong> The adventurers agree to share their discoveries with the kingdom. Gain [[/r 1d4]] Luxuries and decrease Unrest by [[/r 1d4]].</p><p><strong>Failure</strong> The adventurers aren’t particularly eager to share their discoveries, but the excitement of the news still helps delight the populace. Reduce Unrest by 1. </p><p><strong>Critical Failure</strong> The adventurers are particularly hostile or even disrespectful toward your kingdom and its citizens. Your citizens see them less as heroes and more as bandits plundering the nation’s resources, or even outright villains. Whether this perception is right or not, the damage is done. Gain 1 Unrest. The GM should consider building up these adventurers as recurring antagonists in future events.</p>"
                },
                "Sacrifices (Event +2)": {
                    "name": "Sacrifices (Event +2)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Hex</strong></p><p><strong>Location</strong> A claimed hex in the area of influence of a settlement secretly chosen by the GM </p><p><strong>Event</strong> A cabal of cultists begin snatching citizens and preparing them for sacrifice to their vile god. The cultists maintain a hidden base of operations somewhere near one of the kingdom’s settlements.</p><p><strong>Kingdom skill</strong> Exploration; <strong>Leader</strong> Emissary</p><hr /><p><strong>Critical Success</strong> The cultists are defeated, and many of your captured citizens are rescued.</p><p><strong>Success</strong> The cult continues to function, but you have managed to determine which hex their base of operations is located in. The DC to defeat the Sacrifices event is reduced by 4 in subsequent turns. Increase Unrest by 1.</p><p><strong>Failure</strong> The cultists prey on travelers, hunters, trappers, and anyone else who strays too far from civilization. Increase Unrest by [[/r 1d4]] and one Ruin of your choice by 1.</p><p><strong>Critical Failure</strong> As failure, but the cultists start snatching victims from your settlements. If you’ve already determined where they’ve based their operations, they successfully relocate to a new secret hex as chosen by the GM, and the DC to defeat the cultists returns to normal. Increase Unrest by [[/r 1d6]] and two Ruins of your choice by 2.</p><hr /><p><strong>Resolution</strong> A critical success ends this continuous event. The GM can instead build a short adventure for the PCs to track down and defeat the sinister cultists in encounter mode, provided the PCs know where to go to confront the cultists!</p>"
                },
                "Sensational Crime (Event +1)": {
                    "name": "Sensational Crime (Event +1)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> A randomly determined settlement in the kingdom Event A notorious serial killer, deadly arsonist, flamboyant jewel thief, or otherwise sensational criminal plagues your kingdom.</p><p><strong>Kingdom skill</strong> Intrigue; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The criminal has been caught and the one-person crime wave ends. Reduce Crime by 2, and reduce one other Ruin of your choice by 2. In addition, if you achieve this level of success on the turn this event begins, the criminal was caught in the act of perpetrating their first crime but prevented from completing it; in this case, you discourage future criminals—reduce Crime by 1.</p><p><strong>Success</strong> You foil the criminal’s current plans and perhaps arrest some accomplices, but the mastermind gets away to plot future crimes. Increase Unrest by 1. </p><p><strong>Failure</strong> The criminal succeeds in their crime and escapes justice. Increase Unrest by [[/r 1d4]] and Crime by 1.</p><p><strong>Critical Failure</strong> As failure, but the criminal also makes fools out of law enforcement, frames an innocent for the crime, or taunts the authorities for their failure. Increase Unrest by [[/r 1d6]], Crime by 2, and one other Ruin of your choice by 2.</p><hr /><p><strong>Resolution</strong> This continuous event ends when you achieve a critical success on the check. Alternately, the GM could create a short adventure to allow the PCs to step in, track down, and confront the criminal to end the event.</p>"
                },
                "Squatters (Event -1)": {
                    "name": "Squatters (Event -1)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> The settlement with the highest Consumption in the kingdom or the largest settlement in the kingdom (as chosen by the GM)</p><p><strong>Kingdom skill</strong> Politics; <strong>Leader</strong> Viceroy</p><p><strong>Event</strong> An empty lot in your settlement is taken over by desperate people unable to find adequate work or housing. They set up camp with tents, wagons, and shanties. You cannot use the lot for anything until the squatters are given places to live.</p><hr /><p><strong>Critical Success</strong> You find opportunities for the squatters to improve their lot in life.</p><p><strong>Success</strong> The squatters are removed from their lot, and they try to relocate and reintegrate with other citizens, but there is some strife. Increase Unrest by 1. </p><p><strong>Failure</strong> The squatters refuse to leave their lot and other citizens are split, with some decrying their mistreatment while others call for harsh measures to drive them out. Increase Unrest by [[/r 1d4]]. </p><p><strong>Critical Failure</strong> As failure, but on your next Kingdom turn attempt a @Check[type:flat|dc:6]; on failure, the squatters spread to the nearest empty lot in the settlement, creating a separate continuous Squatters event starting with your next Kingdom turn. In addition, the squatters increase the settlement’s Consumption by 1 each month until the event is resolved.</p><hr /><p><strong>Resolution</strong> This continuous event ends when you achieve a critical success on the check or when you build a Residential structure in the lot the Squatters have chosen to live in.</p><hr /><p><strong>Special</strong> If the settlement has a Sewer System, most of the squatters opt to live there instead; gain a +2 item bonus to checks to resolve this event.</p>"
                },
                "Undead Uprising (Event +0)": {
                    "name": "Undead Uprising (Event +0)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> The settlement with the most cemeteries or (if no settlements have cemeteries) the largest settlement Event A malign force, be it a sinister curse, a nefarious necromancer, or an invasion of ghouls, vampires, or other undead-creating monsters, causes the dead to rise from their graves and threaten the settlement.</p><p><strong>Kingdom skill</strong> Folklore; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> The undead are defeated.</p><p><strong>Success</strong> The undead are temporarily contained with little physical damage to your settlement, but the populace still grow fearful each night. Increase Unrest by 1. </p><p><strong>Failure</strong> The undead prey upon your citizens! Increase Unrest by [[/r 1d4]] and one Ruin of your choice by 1. </p><p><strong>Critical Failure</strong> The undead gain the advantage and bring disaster. Increase Unrest by [[/r 2d4]], all Ruins by 1, and one non-cemetery lot in your settlement (chosen by the players) is reduced to rubble.</p><hr /><p><strong>Resolution</strong> A critical success on the check ends this continuous event. Alternately, the GM can create a short adventure for the PCs to track down and destroy the source of the undead uprising.</p><hr /><p><strong>Special</strong> Increase the event’s level modifier by 1 for each Graveyard in the settlement, to a maximum of +4.</p>"
                },
                "Unexpected Find (Event +0)": {
                    "name": "Unexpected Find (Event +0)",
                    "text": "<p><strong>Benficial</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> The kingdom’s newest settlement </p><p><strong>Event</strong> Local citizens discover a forgotten magic item while working on a construction site or while clearing out an old storage area.</p><p><strong>Kingdom skill</strong> Trade; <strong>Leader</strong> Ruler</p><hr /><p><strong>Critical Success</strong> The citizens donate the magic item to the PCs as thanks. The item is either a permanent item or four consumable items (equal chance of each) of a level equal to your kingdom. The exact item discovered is determined by the GM. If the PCs decide to donate the discovery to the community, reduce Unrest by [[/r 2d4]].</p><p><strong>Success</strong> The magic treasure is donated to the community; reduce Unrest by [[/r 1d4]].</p><p><strong>Failure</strong> The found item is grudgingly donated to the community; reduce Unrest by 1.</p><p><strong>Critical Failure</strong> The recovered item is stolen before it can be donated, found to be cursed, or turns out to be worthless junk. Increase Unrest by 1.</p>"
                },
                "Vandals (Event +1)": {
                    "name": "Vandals (Event +1)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> A randomly determined settlement </p><p><strong>Event</strong> Vandals, troublemakers, and dissidents destroy property in your settlement.</p><p><strong>Kingdom skill</strong> Industry; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> You root out the vandals and stop them from causing any damage.</p><p><strong>Success</strong> The vandals are caught in the act of damaging an area in your settlement. The event ends, but on the next turn, the damage done reduces your Resource Dice by 2.</p><p><strong>Failure</strong> The vandals damage and deface several minor structures in the settlement and remain uncaught for now. Fortunately, the damage done can be easily repaired, but you start the next turn with 4 fewer Resource Dice. </p><p><strong>Critical Failure</strong> The vandals also manage to reduce one structure (chosen by the players) to rubble. Increase Unrest by [[/r 1d4]] and reduce your Resource Dice next turn by 4.</p><hr /><p><strong>Resolution</strong> This event ends when you succeed at the check.</p>"
                },
                "Visiting Celebrity (Event +1)": {
                    "name": "Visiting Celebrity (Event +1)",
                    "text": "<p><strong>Beneficial</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> A randomly determined settlement </p><p><strong>Event</strong> A celebrity from another nation or even a distant land visits one of your settlements, causing a sudden influx of notoriety, visitors, and lavish spending. The GM determines the  nature of the visiting celebrity.</p><p><strong>Kingdom skill</strong> Arts; <strong>Leader</strong> Emissary</p><hr /><p><strong>Critical Success</strong> The visit is a rousing success. Not only are your citizens delighted by the visitor, but the visitor is quite taken with your kingdom and leaves you with a parting gift. Choose two of the following: gain 4 bonus Resource Dice next turn, gain [[/r 1d6]] Luxury commodities, or reduce Unrest by [[/r 1d6]]. </p><p><strong>Success</strong> The visit is a success, and the celebrity enjoys their time in your kingdom. Choose one of the parting gifts from those listed in the critical success result.</p><p><strong>Failure</strong> The visitor has an agreeable if pedestrian visit. Reduce Unrest by 1.</p><p><strong>Critical Failure</strong> The visitor leaves unimpressed and spreads reports of their unpleasant visit abroad. Increase Unrest by [[/r 1d4]]. The next time your kingdom has a Visiting Celebrity, increase that event’s level modifier by 2.</p>"
                },
                "Wealthy Immigrant (Event +2)": {
                    "name": "Wealthy Immigrant (Event +2)",
                    "text": "<p><strong>Beneficial</strong>, <strong>Continuous</strong>, <strong>Settlement</strong></p><p><strong>Location</strong> The kingdom’s capital Event A rich merchant or prominent noble from another land is impressed with your kingdom and asks to construct an estate in your kingdom’s capital. If you give permission, proceed with this event. If you deny the request, this event doesn’t occur; the next time you have a Wealthy Immigrant event, increase the event’s level modifier by 1.</p><p><strong>Kingdom skill</strong> Industry; <strong>Leader</strong> Emissary</p><hr /><p><strong>Critical Success</strong> The immigrant constructs a noble villa, free of charge and without you having to Build the Structure in an available spot in the capital. If there isn’t enough room in the capital, the immigrant builds in the largest settlement that has enough room.</p><p><strong>Success</strong> As critical success, except the immigrant instead constructs a mansion.</p><p><strong>Failure</strong> The immigrant isn’t quite sure where they want to build, but they continue looking.</p><p><strong>Critical Failure</strong> After sending representatives, the immigrant decides not to build a home in your settlement after all, disappointing the local aristocracy. Increase Unrest by 1.</p><hr /><p><strong>Resolution</strong> Achieve a success, critical success, or critical failure against this event.</p>"
                },
                "Monster Hunt (Event +0)": {
                    "name": "Monster Hunt (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> This event takes place at the end of the next Kingdom turn, as numerous eager adventurers join together and scour the wilderness for another monster trophy to add to the tavern’s growing collection.</p><p><strong>Kingdom Skill</strong> Wilderness; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The eager monster hunters confront and defeat a Huge (or larger) monster in the wilderness. The GM can determine the exact type of monster hunted down (but it shouldn’t be a specific creature still awaiting discovery by the PCs in a hex encounter). Trophies from the monster are put on display in a tavern or other public building in the capital city. Gain one additional Fame or Infamy point (as appropriate) at the start of the next Kingdom turn and reduce Unrest by [[/r 1d6]].</p><p><strong>Success</strong> As critical success, but the monster hunters track down and slay a Large monster in the wilderness. Reduce Unrest by [[/r 1d4]].</p><p><strong>Failure</strong> The monster hunters fail in their attempt to hunt a creature, but the kingdom was, if only for a short while, distracted by the attempt. Reduce Unrest by 1. Critical Failure The monster hunters confront a Huge (or larger) monster but fail to defeat it. Worse, the monster follows the surviving hunters back home and attacks the kingdom’s capital city! Increase Unrest by [[/r 1d4]] and one Ruin of the players’ choice by 1. The monster then retreats to the wilderness, but it continues to be a danger. A Monster Activity event automatically takes place during the next Kingdom turn as this creature continues to threaten the region.</p>"
                },
                "Barbarian Immigrants (Event +2)": {
                    "name": "Barbarian Immigrants (Event +2)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> Once the PCs defeat the barbarians, they scatter back into the surrounding wilderness, but some of them are drawn by your reputation and look to join the PCs’ kingdom. This event occurs during the first Kingdom turn after the barbarians defeat.</p><p><strong>Kingdom Skill</strong> Statecraft; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> A large number of barbarians are welcomed into several settlements. Their presence helps to bolster a sense of security (decrease Unrest by [[/r 1d6]]), and also helps to curtail bandit and monster activity. From this point on, kingdom checks made to resolve the following random events gain a +2 circumstance bonus: Bandit Activity, Monster Activity, and Undead Uprising.</p><p><strong>Success</strong> As critical success, but decrease Unrest by [[/r 1d4]] and the circumstance bonus is only +1.</p><p><strong>Failure</strong> The integration of the barbarians into the kingdom is a bit rougher than expected and doesn’t provide additional defense against events. Reduce Unrest by 1.</p><p><strong>Critical Failure</strong> The barbarians and citizens clash violently. Increase Unrest by [[/r 1d4]] and one Ruin of the players’ choice by 1; the barbarians then scatter back into the wilderness.</p>"
                },
                "The Local Paper (Event +0)": {
                    "name": "The Local Paper (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> This event takes place on the one Kingdom Turn after the turn during which the PCs build their first printing house. Access to the printing press allows for the production of an initially modest weekly flyer that gathers news and presents stories of interest. Over time, this flyer grows in size, potentially becoming something akin to a local newspaper, but only if your printing house can keep up with the demand. While it doesn’t directly impact the effects of this event, you should encourage your players to come up with a fun name for their kingdom’s paper.</p><p><strong>Kingdom skill</strong> Industry; <strong>Leader</strong> Counselor</p><hr /><p><strong>Critical Success</strong> You gain access to the Read All About It leadership activity. More importantly, your industrious editors prove to be more than up to the task of keeping the presses running, and the people of the kingdom take to the new paper with delight. Reduce unrest by [[/r 1d4]], and at the start of your next Kingdom Turn, you gain one additional Fame or Infamy point.</p><p><strong>Success</strong> You gain access to the Read All About It leadership activity, and while your people enjoy the paper, it’s always a grind to hit your deadlines. Reduce Unrest by 1.</p><p><strong>Failure</strong> You gain access to the Read All About It leadership activity, but the stress of hitting deadlines puts a strain on your editors. Increase Unrest by 1.</p><p><strong>Critical Failure</strong> You fail to get the local paper off the ground, and your frustrated editors spread word of how you mismanaged the affair. Increase Unrest by [[/r 1d4]] and Strife by 1.</p>"
                },
                "Special Edition (Event +0)": {
                    "name": "Special Edition (Event +0)",
                    "text": "<p><strong>Beneficial</strong></p><p><strong>Event</strong> A famous writer approaches your printing house with an offer to produce a special, limited edition of one of their previously published works, or a brand new edition of a previously unpublished story. This event can occur multiple times at the GM’s discretion, but never more than twice a game year.</p><p><strong>Kingdom skill</strong> Arts; <strong>Leader</strong> Counselor</p><hr /><p><strong>Critical Success</strong> The special edition proves to be a rousing success! At the start of your next Kingdom Turn, you gain two bonus Resource Dice and [[/r 1d4]] Luxury commodities.</p><p><strong>Success</strong> The special edition is popular but takes a while to sell out. At the start of your next Kingdom Turn, you gain one bonus Resource Die.</p><p><strong>Failure</strong> The special edition fails to connect with any readers and provides no significant benefit to your nation as a result.</p><p><strong>Critical Failure</strong> The special edition is controversial in some way and incites anger in a key portion of your population. Increase one Ruin of your choice by 1.</p>"
                },
                "Goblin Backlash (Event -2)": {
                    "name": "Goblin Backlash (Event -2)",
                    "text": "<p><strong>Continuous</strong>, <strong>Dangerous</strong></p><p><strong>Event</strong> Your citizens doubt your wisdom in appointing a goblin and worry that his unsavory personality traits might cause issues for the kingdom overall. If the goblin companion is still chaotic evil, you take a –2 circumstance penalty in resolving this event.</p><p><strong>Kingdom Skill</strong> Politics; <strong>Leader</strong> Ruler</p><hr /><p><strong>Critical Success</strong> You convince the citizens that the goblin will do well, and use his appointment to prove that you are seeking to build a diverse kingdom where anyone can find a role in shaping its destiny. The event ends, and your citizens grow more accepting of all people. Word of your kingdom’s acceptance of normally shunned elements of society spreads, and from this point on, you gain a +1 circumstance bonus to all New Leadership, Quell Unrest, and Pledge of Fealty checks.</p><p><strong>Success</strong> You prevent the unrest from growing, but the citizens continue to grumble and grouse about the goblin into the next kingdom turn.</p><p><strong>Failure</strong> The people rise up, with protests and even a few riots taking place as concerned citizens fan the flames of dissent in the kingdom. Gain 1 Unrest.</p><p><strong>Critical Failure</strong> As failure, but gain [[/r 1d4]] Unrest. In addition, an Assassination Attempt event takes place immediately after resolving this event, with the goblin as the target. The assassin itself should be a non-good, previously unnamed NPC citizen in the PC’s kingdom. They weren’t hired by anyone, instead acting on their own to remove a perceived threat (the goblin) to the kingdom’s well-being.</p><hr /><p><strong>Resolution</strong> You can end this continuous event with a critical success on the check. Alternately, if the PCs remove the goblin from his leadership position (including if he’s killed), the event ends. If the PCs do this though, and then attempt to install the goblin as a leader at a later date, this event occurs again but its level is increased by 1.</p>"
                },
                "Public Outburst (Event +0)": {
                    "name": "Public Outburst (Event +0)",
                    "text": "<p><strong>Dangerous</strong></p><p><strong>Event</strong> The citizens of the kingdom grow particularly nervous and fearful about the spread of monster attacks, with more reports of monsters bursting out of random victims. Each time this event occurs, increase the event’s level modifier by 1 to a maximum of +2, at which point the curse has become the populace’s greatest fear. The PCs must work to calm the nation and convince the people that they are doing everything they can to stop this supernatural affliction.</p><p><strong>Kingdom Skill</strong> Politics; <strong>Leader</strong> Ruler</p><hr /><p><strong>Critical Success</strong> The citizens are comforted by promises. This occurrence of Public Outburst does not increase the level modifier of the next occurrence. </p><p><strong>Success</strong> The citizens are somewhat comforted, and you prevent Unrest from rising.</p><p><strong>Failure</strong> Rumors that the affliction might be beyond the party’s capability to stop make it difficult to quell fear. Increase Unrest by 1.</p><p><strong>Critical Failure</strong> As failure, but the rumors spread more quickly and have kernels of truth to them. Increase Unrest by [[/r 1d4]], and at the end of the next day, a Cult event automatically happens.</p>"
                },
                "Too Close to Home (Event +1)": {
                    "name": "Too Close to Home (Event +1)",
                    "text": "<p><strong>Dangerous, Hex</strong></p><p><strong>Location</strong> A hex of the GM’s choosing within the influence of the settlement that’s closest to the PCs’ current location. </p><p><strong>Event</strong> A monster blooms from a citizen and begins to rampage the area. The type of monster should be chosen by the GM; its level should equal the party’s level + 1 (a Low threat encounter). The PCs can choose to resolve this event with a Kingdom skill check, or they can travel to the hex the monster is rampaging in to challenge it in encounter mode. If they don’t defeat the monster by the end of the next day, treat this event as having a Critical Failure result.</p><p><strong>Kingdom Skill</strong> Defense; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The monster is defeated before any more lives are lost.</p><p><strong>Success</strong> The monster is defeated but may have slain some citizens. Attempt a @Check[type:flat|dc:11|showDC:all]. On a failure, a few locals were slain; increase Unrest by 1. </p><p><strong>Failure</strong> The monster slays several citizens before it is defeated. Increase Unrest by 1.</p><p><strong>Critical Failure</strong> The monster continues to rampage unopposed. This event becomes Continuous and occurs every day until the monster is defeated; additional Cult events still occur as normal. Increase Unrest by [[/r 1d4]] and Decay by 1.</p>"
                },
                "Urban Outbreak (Event +2)": {
                    "name": "Urban Outbreak (Event +2)",
                    "text": "<p><strong>Dangerous, Settlement</strong></p><p><strong>Location</strong> The settlement the PCs are currently located in, or the closest settlement to the PCs’ location if they’re not in a settlement.</p><p><strong>Event</strong> A monster blooms from a citizen in the city itself and runs rampage through the streets! The type of monster should be chosen by the GM; its level should equal the party’s level + 2 (a Moderate threat encounter). The PCs can choose to resolve this event with a Kingdom skill check, or they can travel to the settlement the monster is rampaging in to challenge it in encounter mode. If they don’t defeat the monster by the end of the next day, treat this event as having a Critical Failure result.</p><p><strong>Kingdom Skill</strong> Defense; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The monster is defeated before any more lives are lost.</p><p><strong>Success</strong> The monster is defeated but slew a citizen. Increase Unrest by 1.</p><p><strong>Failure</strong> The monster slays several citizens before it is defeated. Increase Unrest by [[/r 1d4]] and Decay by 1.</p><p><strong>Critical Failure</strong> The monster continues to rampage unopposed. This event becomes Continuous and occurs every day until the monster is defeated; additional Cult events still occur as normal. Increase Unrest by [[/r 1d6]] and Decay by 2.</p>"
                },
                "The Bard's Trial (Event +0)": {
                    "name": "The Bard's Trial (Event +0)",
                    "text": "<p><strong>Continuous, Downtime, Leadership</strong></p><p>A PC spends the day working to fight against the bard's efforts to spread rumors, misinformation, and propaganda against your kingdom. A PC can use Deception to fight fire with fire by slandering or redirecting the bard's efforts to backfire on him. A PC can use Diplomacy to convince the citizens that the kingdom’s leaders are making the right choices and have the nation’s best interests at heart. A PC can use Intimidation to try to frighten the bard out of town or to make citizens wary about speaking out against the government. All three choices can build up Support points, but the repercussions for failing vary according to the skill chosen to fight the bard's efforts. Regardless of the skill chosen, it’s a DC 24 check.</p><hr /><p><strong>Critical Success</strong> The party gains 2 Support Points. The next Fight Propaganda check attempted by a PC gains a +2 circumstance bonus as a result of the positive momentum of their efforts.</p><p><strong>Success</strong> The party gains 1 Support Point.</p><p><strong>Failure</strong> The party loses 1 Support Point.</p><p><strong>Critical Failure</strong> The party loses 1 Support Point, but also suffers an additional penalty to the kingdom as a whole, depending on which skill check was attempted to Fight Propaganda.</p><ul><li><p><strong>Deception</strong> The bard exposes some of the PCs’ deceitful acts to the public, inspiring criminals in the kingdom to step up their game using similar tactics performed by the PC. Increase the kingdom’s Crime by 1 and Unrest by 1.</p></li><li><p><strong>Diplomacy</strong> The bard seizes on the PC’s poor attempt to be diplomatic and spins those failures into “evidence” of corruption among the city’s leadership. Increase the kingdom’s Corruption by 1 and Unrest by 1.</p></li><li><p><strong>Intimidation</strong> The bard takes advantage of the PC’s bullying to drive citizens to engage in riots and vandalism. Increase the kingdom’s Decay by 1 and Unrest by 1.</p></li></ul><h3>Support Point Thresholds</h3><p>As the PCs build Support Points by Fighting Propaganda, they erode The bard's influence over the kingdom. To completely defeat him, the party must achieve 15 Support Points, but the following Support Point thresholds grant additional bonuses along the way.</p><p><strong>5 Support Points</strong> The skill check that resulted in achieving this threshold gains momentum. As long as the Support Points maintain a minimum threshold of 5, future checks attempted to Fight Propaganda using this same skill gain a +2 status bonus. If Support Points are reduced below 5, this bonus is lost; it can be regained (potentially with a new type of skill) by reaching the threshold of 5 points again.</p><p><strong>10 Support Points</strong> The bard's campaign has suffered significant setbacks, and he now reduces accumulated Support Points by only 1 per day that the PCs don’t continue to Fight his Propaganda. The party can have him arrested (and move on to the bard's trial) at this point, but doing so is a bit premature and causes those in the kingdom who are still swayed by his influence to become disgruntled. Increase the kingdom’s Unrest by [[/r 1d6]] and Strife by 2.</p><p><strong>15 Support Points</strong> The bard's campaign is defeated, and the bard can now be arrested without any negative repercussions; move on to the bard's trial.</p>"
                },
                "Old Devil Comes Calling (Event +3)": {
                    "name": "Old Devil Comes Calling (Event +3)",
                    "text": "<p><strong>Continuous, Dangerous, Settlement</strong></p><p><strong>Location</strong> The closest settlement to the kobold's cavern.</p><p><strong>Event</strong> The devil (@UUID[Compendium.pf2e.pathfinder-bestiary-2.Actor.i8C4jqI3VdozylBL]{Cornugon}) comes looking for the kobolds, finds them allied with the PCs, and works from behind the scenes in a nearby settlement to wreak havoc and bolster the cult he didn’t know he had, spreading his influence through the kingdom.</p><p><strong>Kingdom Skill</strong> Intrigue; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> Kingdom agents manage to isolate the source of the diabolic influence: The devil has made a hidden lair within the settlement; the PCs have discovered where this secret den is located, and can finally take direct action to resolve the event (see resolution, below).</p><p><strong>Success</strong> The devil’s influence spreads, but the speed of its growth is stemmed by the investigations. Increase Unrest by 1 and one Ruin of the party’s choice by 1.</p><p><strong>Failure</strong> The devil’s cult gains ground as he begins to destroy the kingdom from within. Increase Unrest by [[/r 1d4]] and three Ruins of the party’s choice by 1.</p><p><strong>Critical Failure</strong> As failure, but the devil also corrupts an NPC leader, convincing them to join his cult and abandon their responsibilities to the kingdom. Treat that leadership role as vacant until this event is resolved or the NPC leader is replaced or redeemed.</p><hr /><p><strong>Resolution</strong> Once the PCs get a critical success (or at your discretion, after the PCs undertake an adventure of your own design to discover the devil’s lair), they can drive the devil out of their kingdom by attacking and defeating him (in which case you’ll need to play the battle out in a location of your choice), or they can attempt a Hire Adventurers activity to do the same. If, by the Event phase of the next Kingdom turn, the devil hasn’t been defeated, he moves to a new settlement and the event continues.</p><p></p>"
                },
                "Discover Desperate Spies (Event +3)": {
                    "name": "Discover Desperate Spies (Event +3)",
                    "text": "<p style=\"box-sizing:border-box;user-select:text;margin:0.5em 0px;min-height:unset;color:rgb(25, 24, 19);font-family:Signika, sans-serif;font-size:14px;font-style:normal;font-variant-ligatures:normal;font-variant-caps:normal;font-weight:400;letter-spacing:normal;orphans:2;text-indent:0px;text-transform:none;white-space:normal;widows:2;word-spacing:0px;-webkit-text-stroke-width:0px;text-decoration-thickness:initial;text-decoration-style:initial;text-decoration-color:initial;text-align:start\"><span style=\"font-family:Signika, sans-serif\"><strong style=\"box-sizing:border-box;user-select:text\">Continuous, Dangerous, Settlement</strong></span></p><p><strong>Location</strong> The kingdom’s capital city.</p><p><strong>Event</strong> The kobold spies slink and skulk around the city, looking for weaknesses to report back to Hargulka and taking advantage of opportunities to perform minor acts of vandalism and sabotage. Once this story event begins, it continues daily for a week. Each day, the kingdom attempts a skill check to resolve the event.</p><p><strong>Kingdom Skill</strong> Defense or Intrigue (secret), DC 23; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The two kobold spies are captured and kept imprisoned until the PCs have a chance to speak to them.</p><p><strong>Success</strong> Rumors of kobold spies in town begin to spread. Attempt a @Check[type:flat|dc:11]; on a failure, increase Unrest by 1.</p><p><strong>Failure</strong> Someone or something in town is causing trouble. Increase Unrest by 1.</p><p><strong>Critical Failure</strong> Not only do the kobolds continue to cause trouble (increase Unrest by 1), but they also perform acts of vandalism and sabotage. Increase Decay by 1. </p><hr /><p><strong>Resolution</strong> This daily event ends on a Critical Success or after 7 days have passed.</p>"
                },
                "The Founding of A Village (Event +0)": {
                    "name": "The Founding of A Village (Event +0)",
                    "text": "<p><strong>Beneficial, Hex</strong></p><p><strong>Location</strong> Hex Encounter.</p><p><strong>Event</strong> The PCs are approached by a ruddy, friendly, and energetic couple. They have plans to establish a village where, until recently, a pair of @UUID[Compendium.pf2e.pathfinder-bestiary-2.Actor.UnWr8QSMq2VZUQhX] dwelled. The couple ask the PCs for support getting their village started.</p><p><strong>Kingdom Skill</strong> Exploration; <strong>Leader</strong> Warden</p><hr /><p><strong>Critical Success</strong> The village is founded. If this hex isn’t part of the PCs’ kingdom, it’s automatically claimed and added to the kingdom. The village is automatically integrated into the kingdom as a village that has 1 Water border. It occupies one block on the Urban Grid, and all 4 of its lots have structures built. These consist of the following: houses, inn, and town hall.</p><p><strong>Success</strong> As critical success, but the village isn’t automatically claimed and added to the kingdom unless the PCs have already claimed that hex. Otherwise, the village becomes a freehold.</p><p><strong>Failure</strong> As success, but clashes with additional @UUID[Compendium.pf2e.pathfinder-bestiary-2.Actor.UnWr8QSMq2VZUQhX] and other dangerous local monsters cause the PCs to expend additional resources to help the Rezbins found their village. At the start of the next Kingdom turn, the PCs gain 2 fewer Resource Dice.</p><p><strong>Critical Failure</strong> The couple and any assistants provided by the PCs are slaughtered by monsters before they can get started. If the PCs haven’t finished this chapter yet, then the couple are captured by trolls, and they could potentially be rescued (after which the couple thankfully return to the task of founding the village, and the PCs automatically gain a success as above). In the short term, the bad news increases Unrest by 1, Decay by 1, and reduces the Resource Dice gained at the start of the next Kingdom turn by 4.</p>"
                },
                "Return of the Mercenaries (Event +0)": {
                    "name": "Return of the Mercenaries (Event +0)",
                    "text": "<p><strong>Dangerous</strong></p><p>Event After the PCs disrupted the mercenaries’ plans and slaughtered several of their lower-ranking members during the raid on the manor in Chapter 1, the mercenary killers have seethed and plotted. As word of the PCs’ new nation spreads, the mercenaries take note and send a new group of killers south to infiltrate the kingdom. These mercenaries make their presence known by attempting a very public attack on the kingdom to send a clear message to its leaders: They do not forget! Once this kingdom event is completed, whether the mercenaries continue to cause periodic trouble for the PCs is left to you to decide. For example, you could link them to some random events like Assassination Attempts, Bandit Activity, Feuds, Public Scandals, Sensational Crimes, and Vandals.</p><p><strong>Kingdom Skill</strong> Intrigue; <strong>Leader</strong> Emissary</p><hr /><p><strong>Critical Success</strong> Your agents intercept the mercenaries before they can even get started on their nefarious plans. Reduce Unrest by [[/r 1d4]], and the next time a random event occurs that includes mercenaries influence, treat the rolled result as one degree of success better than the actual result.</p><p><strong>Success</strong> The mercenaries set their plans in motion, but the kingdom’s defenses stop them before they cause any damage. Nevertheless, public knowledge that the mercenaries have taken an interest in the kingdom increases Unrest by 1.</p><p><strong>Failure</strong> The mercenaries are successful in their plot to attack the kingdom. They publicly rob a caravan of merchants, murder some citizens in broad daylight, or vandalize several buildings while leaving their mark of three black tears as proof of their action. Increase Unrest by [[/r 1d4]] and one Ruin of your choice by 1.</p><p><strong>Critical Failure</strong> As failure, but the mercenaries also manage to establish a foothold in the kingdom. Increase Crime by 2 (this increase stacks with any potential increase to Crime from the Failure result), and the next time there’s a random event that includes mercenaries influence, treat the rolled result as one degree of success worse than the actual result.</p>"
                },
                "Troll Sightings (Event +0)": {
                    "name": "Troll Sightings (Event +0)",
                    "text": "<p><strong>Dangerous, Ongoing</strong></p><p>Event Trolls have grown more common and more aggressive along the borders of the kingdom, and their attacks on travelers, hunters, and others coming and going from the kingdom undermine the nation’s sense of safety and well-being.</p><p>This event should occur once the PCs reach 5th level, or once they come within one hex of the troll's area. The event then continues to repeat during every Kingdom turn’s event phase automatically until it is resolved, in addition to any other potential events that might take place during the turn.</p><p><strong>Kingdom Skill</strong> Defense; <strong>Leader </strong>Warden</p><hr /><p><strong>Critical Success</strong> The trolls are rebuffed with ease, with no damage to the kingdom. Even better, the kingdom’s scouts manage to track the trolls back to their home, revealing their lair to the PCs.</p><p><strong>Success</strong> Kingdom forces manage to hold the trolls back, but worry still spreads—increase Unrest by 1.</p><p><strong>Failure</strong> The trolls manage to slaughter a few victims despite the kingdom’s best efforts. Increase Unrest by [[/r 1d4]] and Decay by 1.</p><p><strong>Critical Failure</strong> As Failure, but the trolls manage to also invade the kingdom and raze some of its lands. If the kingdom has any Farmlands, one randomly determined Farmland is reduced back to its original terrain and must be rebuilt. If it has no farmlands, one hex along the border  is lost.</p><hr /><p><strong>Resolution</strong> This event ends once the PCs defeat the trolls</p>"
                },
                "Trouble with a weird gnome (Event +0)": {
                    "name": "Trouble with a weird gnome (Event +0)",
                    "text": "<p><strong>Dangerous</strong></p><p><strong>Kingdom Skill</strong> Intrigue; <strong>Leader</strong> Magister</p><hr /><p><strong>Critical Success</strong> Kingdom investigators and spellcasters confirm that the weird gnome is likely no gnome at all, but a mischievous trickster fey, potentially from a supernatural place. This knowledge allows your kingdom to both respond to the mischief more quickly and soothes the worries of the citizens. Decrease Unrest by 1.</p><p><strong>Success</strong> Kingdom investigators fail to track down the gnome, and while sightings eventually taper off, the damage is done and the citizens continue to worry. Increase Unrest by 1.</p><p><strong>Failure</strong> No explanation for the weird gnome’s antics are ever arrived at, and in addition to making the citizens uneasy, some of the gnome’s pranks had lasting effects. Increase Unrest by 1 and one Ruin of the party’s choice by 1</p><p><strong>Critical Failure</strong> As failure, but increase Unrest by 2 and two Ruins of the party’s choice by 1.</p>"
                },
                "Rampage of the Monster (Event +4)": {
                    "name": "Rampage of the Monster (Event +4)",
                    "text": "<p><strong>Dangerous, Settlement</strong></p><p><strong>Location</strong> A settlement of the GM’s choice (preferably the PCs’ capital city)</p><p><strong>Event</strong> The city was attacked by a terrifying monster of immense size that crashed into the town and potentially killed dozens before it had its fill of destruction and lumbered off into the hills.</p><p><strong>Kingdom Skill</strong> Defense (if the settlement has only Water borders, then the monster has a more difficult time reaching the settlement; increase the rolled result by one degree of success); <strong>Leader</strong> Warden (even if the Warden is a PC and thus wasn’t present during this event, the PC’s prior service as the kingdom’s Warden still allows them to influence this event)</p><hr /><p><strong>Critical Success</strong> The enormous monster inflicted only relatively minor damage, and while it wounded dozens, miraculously no one was killed. Increase Unrest by 1.</p><p><strong>Success</strong> The monster managed to destroy a portion of the city, killed a few citizens, and wounded dozens. Increase Unrest by [[/r 1d4]] and Decay by 1. Choose one Walled border or one lot with a structure in it; that structure or improvement is destroyed.</p><p><strong>Failure</strong> The monster rampaged through the settlement, killing dozens and laying waste to structures. Increase Unrest by [[/r 1d6]] and Decay by [[/r 1d4]]. Choose one Walled border and two lots with structures in it; those structures and improvements are destroyed.</p><p><strong>Critical Failure</strong> As Failure, but the monster’s rampage is even more devastating. Increase Unrest by [[/r 2d4]] and Decay by [[/r 1d6]]. Choose one Walled border and four lots with structures in it; those structures or improvements are destroyed.</p><hr /><p><strong>Resolution</strong> If the PCs don’t defeat the monster by the next Kingdom turn, it becomes a Monster Activity event (page 560). Award the PCs 30 Kingdom XP for this event.</p>"
                }
            }
        },
        "Licenses": {
            "name": "Licenses",
            "pages": {
                "Licenses": {
                    "name": "Licenses",
                    "text": "<h1>OPEN GAME LICENSE Version 1.0a</h1><p>The following text is the property of Wizards of the Coast, Inc. and is Copyright 2000 Wizards of the Coast, Inc (\" Wizards\"). All Rights Reserved.</p><ol><li><p>Definitions: (a)\"Contributors\" means the copyright and/or trademark owners who have contributed Open Game Content; ( b)\"Derivative Material\" means copyrighted material including derivative works and translations (including into other computer languages), potation, modification, correction, addition, extension, upgrade, improvement, compilation, abridgment or other form in which an existing work may be recast, transformed or adapted; (c) \"Distribute\" means to reproduce, license, rent, lease, sell, broadcast, publicly display, transmit or otherwise distribute; (d)\"Open Game Content\" means the game mechanic and includes the methods, procedures, processes and routines to the extent such content does not embody the Product Identity and is an enhancement over the prior art and any additional content clearly identified as Open Game Content by the Contributor, and means any work covered by this License, including translations and derivative works under copyright law, but specifically excludes Product Identity. (e) \"Product Identity\" means product and product line names, logos and identifying marks including trade dress; artifacts; creatures characters; stories, storylines, plots, thematic elements, dialogue, incidents, language, artwork, symbols, designs, depictions, likenesses, formats, poses, concepts, themes and graphic, photographic and other visual or audio representations; names and descriptions of characters, spells, enchantments, personalities, teams, personas, likenesses and special abilities; places, locations, environments, creatures, equipment, magical or supernatural abilities or effects, logos, symbols, or graphic designs; and any other trademark or registered trademark clearly identified as Product identity by the owner of the Product Identity, and which specifically excludes the Open Game Content; (f) \"Trademark\" means the logos, names, mark, sign, motto, designs that are used by a Contributor to identify itself or its products or the associated products contributed to the Open Game License by the Contributor ( g) \"Use\", \"Used\" or \"Using\" means to use, Distribute, copy, edit, format, modify, translate and otherwise create Derivative Material of Open Game Content. (h) \"You\" or \"Your\" means the licensee in terms of this agreement.</p></li><li><p>The License: This License applies to any Open Game Content that contains a notice indicating that the Open Game Content may only be Used under and in terms of this License. You must affix such a notice to any Open Game Content that you Use. No terms may be added to or subtracted from this License except as described by the License itself. No other terms or conditions may be applied to any Open Game Content distributed using this License.</p></li><li><p>Offer and Acceptance: By Using the Open Game Content You indicate Your acceptance of the terms of this License.</p></li><li><p>Grant and Consideration: In consideration for agreeing to use this License, the Contributors grant You a perpetual, worldwide, royalty-free, non-exclusive license with the exact terms of this License to Use, the Open Game Content.</p></li><li><p>Representation of Authority to Contribute: If You are contributing original material as Open Game Content, You represent that Your Contributions are Your original creation and/or You have sufficient rights to grant the rights conveyed by this License.</p></li><li><p>Notice of License Copyright: You must update the COPYRIGHT NOTICE portion of this License to include the exact text of the COPYRIGHT NOTICE of any Open Game Content You are copying, modifying or distributing, and You must add the title, the copyright date, and the copyright holder's name to the COPYRIGHT NOTICE of any original Open Game Content you Distribute.</p></li><li><p>Use of Product Identity: You agree not to Use any Product Identity, including as an indication as to compatibility, except as expressly licensed in another, independent Agreement with the owner of each element of that Product Identity. You agree not to indicate compatibility or co-adaptability with any Trademark or Registered Trademark in conjunction with a work containing Open Game Content except as expressly licensed in another, independent Agreement with the owner of such Trademark or Registered Trademark. The use of any Product Identity in Open Game Content does not constitute a challenge to the ownership of that Product Identity. The owner of any Product Identity used in Open Game Content shall retain all rights, title and interest in and to that Product Identity.</p></li><li><p>Identification: If you distribute Open Game Content You must clearly indicate which portions of the work that you are distributing are Open Game Content.</p></li><li><p>Updating the License: Wizards or its designated Agents may publish updated versions of this License. You may use any authorized version of this License to copy, modify and distribute any Open Game Content originally distributed under any version of this License.</p></li><li><p>Copy of this License: You MUST include a copy of this License with every copy of the Open Game Content You Distribute.</p></li><li><p>Use of Contributor Credits: You may not market or advertise the Open Game Content using the name of any Contributor unless You have written permission from the Contributor to do so.</p></li><li><p>Inability to Comply: If it is impossible for You to comply with any of the terms of this License with respect to some or all of the Open Game Content due to statute, judicial order, or governmental regulation then You may not Use any Open Game Material so affected.</p></li><li><p>Termination: This License will terminate automatically if You fail to comply with all terms herein and fail to cure such breach within 30 days of becoming aware of the breach. All sublicenses shall survive the termination of this License.</p></li><li><p>Reformation: If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.</p></li><li><p>COPYRIGHT NOTICE Open Game License v 1.0 Copyright 2000, Wizards of the Coast, Inc.</p></li></ol><ul><li><p>PFRPG 2e Kingdom Building, Camping &amp; Weather. Copyright 2022. Bernhard Posselt</p></li><li><p>Pathfinder Kingmaker Adventure Path © 2022, Paizo Inc.; Authors: Steve Helt, Tim Hitchcock, James Jacobs, Ron Lundeen, Rob McCreary, Jason Nelson, Richard Pett, Neil Spicer, and Greg A. Vaughan.</p></li><li><p>Pathfinder Kingmaker Companion Guide © 2022, Paizo Inc.; Authors: Alex Augunas, Russ Brown, Jeremy Corff, Steven T. Helt, Eric Hindley, James Jacobs, Victoria Jaczko, Jeff Lee, Tom McQueen, Jason Nelson, Chris Perrin, Richard Pett, David N. Ross, and Mike Welham.</p></li><li><p>Pathfinder Core Rulebook (Second Edition) © 2019, Paizo Inc.; Designers: Logan Bonner, Jason Bulmahn, Stephen Radney-MacFarland, and Mark Seifter.</p></li><li><p>Pathfinder Gamemastery Guide © 2020, Paizo Inc.; Authors: Alexander Augunas, Jesse Benner, John Bennett, Logan Bonner, Clinton J. Boomer, Jason Bulmahn, James Case, Paris Crenshaw, Jesse Decker, Robert N. Emerson, Eleanor Ferron, Jaym Gates, Matthew Goetz, T.H. Gulliver, Kev Hamilton, Sasha Laranoa Harving, BJ Hensley, Vanessa Hoskins, Brian R. James, Jason LeMaitre, Lyz Liddell, Luis Loza, Colm Lundberg, Ron Lundeen, Stephen Radney-MacFarland, Jessica Redekop, Alistair Rigg, Mark Seifter, Owen K.C. Stephens, Amber Stewart, Christina Stiles, Landon Winkler, and Linda Zayas-Palmer.</p></li></ul>"
                },
                "GNU AFFERO GENERAL PUBLIC LICENSE Version 3": {
                    "name": "GNU AFFERO GENERAL PUBLIC LICENSE Version 3",
                    "text": "<p>                    GNU AFFERO GENERAL PUBLIC LICENSE</p><p>                       Version 3, 19 November 2007</p><p> Copyright (C) 2007 Free Software Foundation, Inc. &lt;https://fsf.org/&gt;</p><p> Everyone is permitted to copy and distribute verbatim copies</p><p> of this license document, but changing it is not allowed.</p><p>                            Preamble</p><p>  The GNU Affero General Public License is a free, copyleft license for</p><p>software and other kinds of works, specifically designed to ensure</p><p>cooperation with the community in the case of network server software.</p><p>  The licenses for most software and other practical works are designed</p><p>to take away your freedom to share and change the works.  By contrast,</p><p>our General Public Licenses are intended to guarantee your freedom to</p><p>share and change all versions of a program--to make sure it remains free</p><p>software for all its users.</p><p>  When we speak of free software, we are referring to freedom, not</p><p>price.  Our General Public Licenses are designed to make sure that you</p><p>have the freedom to distribute copies of free software (and charge for</p><p>them if you wish), that you receive source code or can get it if you</p><p>want it, that you can change the software or use pieces of it in new</p><p>free programs, and that you know you can do these things.</p><p>  Developers that use our General Public Licenses protect your rights</p><p>with two steps: (1) assert copyright on the software, and (2) offer</p><p>you this License which gives you legal permission to copy, distribute</p><p>and/or modify the software.</p><p>  A secondary benefit of defending all users' freedom is that</p><p>improvements made in alternate versions of the program, if they</p><p>receive widespread use, become available for other developers to</p><p>incorporate.  Many developers of free software are heartened and</p><p>encouraged by the resulting cooperation.  However, in the case of</p><p>software used on network servers, this result may fail to come about.</p><p>The GNU General Public License permits making a modified version and</p><p>letting the public access it on a server without ever releasing its</p><p>source code to the public.</p><p>  The GNU Affero General Public License is designed specifically to</p><p>ensure that, in such cases, the modified source code becomes available</p><p>to the community.  It requires the operator of a network server to</p><p>provide the source code of the modified version running there to the</p><p>users of that server.  Therefore, public use of a modified version, on</p><p>a publicly accessible server, gives the public access to the source</p><p>code of the modified version.</p><p>  An older license, called the Affero General Public License and</p><p>published by Affero, was designed to accomplish similar goals.  This is</p><p>a different license, not a version of the Affero GPL, but Affero has</p><p>released a new version of the Affero GPL which permits relicensing under</p><p>this license.</p><p>  The precise terms and conditions for copying, distribution and</p><p>modification follow.</p><p>                       TERMS AND CONDITIONS</p><p>  0. Definitions.</p><p>  \"This License\" refers to version 3 of the GNU Affero General Public License.</p><p>  \"Copyright\" also means copyright-like laws that apply to other kinds of</p><p>works, such as semiconductor masks.</p><p>  \"The Program\" refers to any copyrightable work licensed under this</p><p>License.  Each licensee is addressed as \"you\".  \"Licensees\" and</p><p>\"recipients\" may be individuals or organizations.</p><p>  To \"modify\" a work means to copy from or adapt all or part of the work</p><p>in a fashion requiring copyright permission, other than the making of an</p><p>exact copy.  The resulting work is called a \"modified version\" of the</p><p>earlier work or a work \"based on\" the earlier work.</p><p>  A \"covered work\" means either the unmodified Program or a work based</p><p>on the Program.</p><p>  To \"propagate\" a work means to do anything with it that, without</p><p>permission, would make you directly or secondarily liable for</p><p>infringement under applicable copyright law, except executing it on a</p><p>computer or modifying a private copy.  Propagation includes copying,</p><p>distribution (with or without modification), making available to the</p><p>public, and in some countries other activities as well.</p><p>  To \"convey\" a work means any kind of propagation that enables other</p><p>parties to make or receive copies.  Mere interaction with a user through</p><p>a computer network, with no transfer of a copy, is not conveying.</p><p>  An interactive user interface displays \"Appropriate Legal Notices\"</p><p>to the extent that it includes a convenient and prominently visible</p><p>feature that (1) displays an appropriate copyright notice, and (2)</p><p>tells the user that there is no warranty for the work (except to the</p><p>extent that warranties are provided), that licensees may convey the</p><p>work under this License, and how to view a copy of this License.  If</p><p>the interface presents a list of user commands or options, such as a</p><p>menu, a prominent item in the list meets this criterion.</p><p>  1. Source Code.</p><p>  The \"source code\" for a work means the preferred form of the work</p><p>for making modifications to it.  \"Object code\" means any non-source</p><p>form of a work.</p><p>  A \"Standard Interface\" means an interface that either is an official</p><p>standard defined by a recognized standards body, or, in the case of</p><p>interfaces specified for a particular programming language, one that</p><p>is widely used among developers working in that language.</p><p>  The \"System Libraries\" of an executable work include anything, other</p><p>than the work as a whole, that (a) is included in the normal form of</p><p>packaging a Major Component, but which is not part of that Major</p><p>Component, and (b) serves only to enable use of the work with that</p><p>Major Component, or to implement a Standard Interface for which an</p><p>implementation is available to the public in source code form.  A</p><p>\"Major Component\", in this context, means a major essential component</p><p>(kernel, window system, and so on) of the specific operating system</p><p>(if any) on which the executable work runs, or a compiler used to</p><p>produce the work, or an object code interpreter used to run it.</p><p>  The \"Corresponding Source\" for a work in object code form means all</p><p>the source code needed to generate, install, and (for an executable</p><p>work) run the object code and to modify the work, including scripts to</p><p>control those activities.  However, it does not include the work's</p><p>System Libraries, or general-purpose tools or generally available free</p><p>programs which are used unmodified in performing those activities but</p><p>which are not part of the work.  For example, Corresponding Source</p><p>includes interface definition files associated with source files for</p><p>the work, and the source code for shared libraries and dynamically</p><p>linked subprograms that the work is specifically designed to require,</p><p>such as by intimate data communication or control flow between those</p><p>subprograms and other parts of the work.</p><p>  The Corresponding Source need not include anything that users</p><p>can regenerate automatically from other parts of the Corresponding</p><p>Source.</p><p>  The Corresponding Source for a work in source code form is that</p><p>same work.</p><p>  2. Basic Permissions.</p><p>  All rights granted under this License are granted for the term of</p><p>copyright on the Program, and are irrevocable provided the stated</p><p>conditions are met.  This License explicitly affirms your unlimited</p><p>permission to run the unmodified Program.  The output from running a</p><p>covered work is covered by this License only if the output, given its</p><p>content, constitutes a covered work.  This License acknowledges your</p><p>rights of fair use or other equivalent, as provided by copyright law.</p><p>  You may make, run and propagate covered works that you do not</p><p>convey, without conditions so long as your license otherwise remains</p><p>in force.  You may convey covered works to others for the sole purpose</p><p>of having them make modifications exclusively for you, or provide you</p><p>with facilities for running those works, provided that you comply with</p><p>the terms of this License in conveying all material for which you do</p><p>not control copyright.  Those thus making or running the covered works</p><p>for you must do so exclusively on your behalf, under your direction</p><p>and control, on terms that prohibit them from making any copies of</p><p>your copyrighted material outside their relationship with you.</p><p>  Conveying under any other circumstances is permitted solely under</p><p>the conditions stated below.  Sublicensing is not allowed; section 10</p><p>makes it unnecessary.</p><p>  3. Protecting Users' Legal Rights From Anti-Circumvention Law.</p><p>  No covered work shall be deemed part of an effective technological</p><p>measure under any applicable law fulfilling obligations under article</p><p>11 of the WIPO copyright treaty adopted on 20 December 1996, or</p><p>similar laws prohibiting or restricting circumvention of such</p><p>measures.</p><p>  When you convey a covered work, you waive any legal power to forbid</p><p>circumvention of technological measures to the extent such circumvention</p><p>is effected by exercising rights under this License with respect to</p><p>the covered work, and you disclaim any intention to limit operation or</p><p>modification of the work as a means of enforcing, against the work's</p><p>users, your or third parties' legal rights to forbid circumvention of</p><p>technological measures.</p><p>  4. Conveying Verbatim Copies.</p><p>  You may convey verbatim copies of the Program's source code as you</p><p>receive it, in any medium, provided that you conspicuously and</p><p>appropriately publish on each copy an appropriate copyright notice;</p><p>keep intact all notices stating that this License and any</p><p>non-permissive terms added in accord with section 7 apply to the code;</p><p>keep intact all notices of the absence of any warranty; and give all</p><p>recipients a copy of this License along with the Program.</p><p>  You may charge any price or no price for each copy that you convey,</p><p>and you may offer support or warranty protection for a fee.</p><p>  5. Conveying Modified Source Versions.</p><p>  You may convey a work based on the Program, or the modifications to</p><p>produce it from the Program, in the form of source code under the</p><p>terms of section 4, provided that you also meet all of these conditions:</p><p>    a) The work must carry prominent notices stating that you modified</p><p>    it, and giving a relevant date.</p><p>    b) The work must carry prominent notices stating that it is</p><p>    released under this License and any conditions added under section</p><p>    7.  This requirement modifies the requirement in section 4 to</p><p>    \"keep intact all notices\".</p><p>    c) You must license the entire work, as a whole, under this</p><p>    License to anyone who comes into possession of a copy.  This</p><p>    License will therefore apply, along with any applicable section 7</p><p>    additional terms, to the whole of the work, and all its parts,</p><p>    regardless of how they are packaged.  This License gives no</p><p>    permission to license the work in any other way, but it does not</p><p>    invalidate such permission if you have separately received it.</p><p>    d) If the work has interactive user interfaces, each must display</p><p>    Appropriate Legal Notices; however, if the Program has interactive</p><p>    interfaces that do not display Appropriate Legal Notices, your</p><p>    work need not make them do so.</p><p>  A compilation of a covered work with other separate and independent</p><p>works, which are not by their nature extensions of the covered work,</p><p>and which are not combined with it such as to form a larger program,</p><p>in or on a volume of a storage or distribution medium, is called an</p><p>\"aggregate\" if the compilation and its resulting copyright are not</p><p>used to limit the access or legal rights of the compilation's users</p><p>beyond what the individual works permit.  Inclusion of a covered work</p><p>in an aggregate does not cause this License to apply to the other</p><p>parts of the aggregate.</p><p>  6. Conveying Non-Source Forms.</p><p>  You may convey a covered work in object code form under the terms</p><p>of sections 4 and 5, provided that you also convey the</p><p>machine-readable Corresponding Source under the terms of this License,</p><p>in one of these ways:</p><p>    a) Convey the object code in, or embodied in, a physical product</p><p>    (including a physical distribution medium), accompanied by the</p><p>    Corresponding Source fixed on a durable physical medium</p><p>    customarily used for software interchange.</p><p>    b) Convey the object code in, or embodied in, a physical product</p><p>    (including a physical distribution medium), accompanied by a</p><p>    written offer, valid for at least three years and valid for as</p><p>    long as you offer spare parts or customer support for that product</p><p>    model, to give anyone who possesses the object code either (1) a</p><p>    copy of the Corresponding Source for all the software in the</p><p>    product that is covered by this License, on a durable physical</p><p>    medium customarily used for software interchange, for a price no</p><p>    more than your reasonable cost of physically performing this</p><p>    conveying of source, or (2) access to copy the</p><p>    Corresponding Source from a network server at no charge.</p><p>    c) Convey individual copies of the object code with a copy of the</p><p>    written offer to provide the Corresponding Source.  This</p><p>    alternative is allowed only occasionally and noncommercially, and</p><p>    only if you received the object code with such an offer, in accord</p><p>    with subsection 6b.</p><p>    d) Convey the object code by offering access from a designated</p><p>    place (gratis or for a charge), and offer equivalent access to the</p><p>    Corresponding Source in the same way through the same place at no</p><p>    further charge.  You need not require recipients to copy the</p><p>    Corresponding Source along with the object code.  If the place to</p><p>    copy the object code is a network server, the Corresponding Source</p><p>    may be on a different server (operated by you or a third party)</p><p>    that supports equivalent copying facilities, provided you maintain</p><p>    clear directions next to the object code saying where to find the</p><p>    Corresponding Source.  Regardless of what server hosts the</p><p>    Corresponding Source, you remain obligated to ensure that it is</p><p>    available for as long as needed to satisfy these requirements.</p><p>    e) Convey the object code using peer-to-peer transmission, provided</p><p>    you inform other peers where the object code and Corresponding</p><p>    Source of the work are being offered to the general public at no</p><p>    charge under subsection 6d.</p><p>  A separable portion of the object code, whose source code is excluded</p><p>from the Corresponding Source as a System Library, need not be</p><p>included in conveying the object code work.</p><p>  A \"User Product\" is either (1) a \"consumer product\", which means any</p><p>tangible personal property which is normally used for personal, family,</p><p>or household purposes, or (2) anything designed or sold for incorporation</p><p>into a dwelling.  In determining whether a product is a consumer product,</p><p>doubtful cases shall be resolved in favor of coverage.  For a particular</p><p>product received by a particular user, \"normally used\" refers to a</p><p>typical or common use of that class of product, regardless of the status</p><p>of the particular user or of the way in which the particular user</p><p>actually uses, or expects or is expected to use, the product.  A product</p><p>is a consumer product regardless of whether the product has substantial</p><p>commercial, industrial or non-consumer uses, unless such uses represent</p><p>the only significant mode of use of the product.</p><p>  \"Installation Information\" for a User Product means any methods,</p><p>procedures, authorization keys, or other information required to install</p><p>and execute modified versions of a covered work in that User Product from</p><p>a modified version of its Corresponding Source.  The information must</p><p>suffice to ensure that the continued functioning of the modified object</p><p>code is in no case prevented or interfered with solely because</p><p>modification has been made.</p><p>  If you convey an object code work under this section in, or with, or</p><p>specifically for use in, a User Product, and the conveying occurs as</p><p>part of a transaction in which the right of possession and use of the</p><p>User Product is transferred to the recipient in perpetuity or for a</p><p>fixed term (regardless of how the transaction is characterized), the</p><p>Corresponding Source conveyed under this section must be accompanied</p><p>by the Installation Information.  But this requirement does not apply</p><p>if neither you nor any third party retains the ability to install</p><p>modified object code on the User Product (for example, the work has</p><p>been installed in ROM).</p><p>  The requirement to provide Installation Information does not include a</p><p>requirement to continue to provide support service, warranty, or updates</p><p>for a work that has been modified or installed by the recipient, or for</p><p>the User Product in which it has been modified or installed.  Access to a</p><p>network may be denied when the modification itself materially and</p><p>adversely affects the operation of the network or violates the rules and</p><p>protocols for communication across the network.</p><p>  Corresponding Source conveyed, and Installation Information provided,</p><p>in accord with this section must be in a format that is publicly</p><p>documented (and with an implementation available to the public in</p><p>source code form), and must require no special password or key for</p><p>unpacking, reading or copying.</p><p>  7. Additional Terms.</p><p>  \"Additional permissions\" are terms that supplement the terms of this</p><p>License by making exceptions from one or more of its conditions.</p><p>Additional permissions that are applicable to the entire Program shall</p><p>be treated as though they were included in this License, to the extent</p><p>that they are valid under applicable law.  If additional permissions</p><p>apply only to part of the Program, that part may be used separately</p><p>under those permissions, but the entire Program remains governed by</p><p>this License without regard to the additional permissions.</p><p>  When you convey a copy of a covered work, you may at your option</p><p>remove any additional permissions from that copy, or from any part of</p><p>it.  (Additional permissions may be written to require their own</p><p>removal in certain cases when you modify the work.)  You may place</p><p>additional permissions on material, added by you to a covered work,</p><p>for which you have or can give appropriate copyright permission.</p><p>  Notwithstanding any other provision of this License, for material you</p><p>add to a covered work, you may (if authorized by the copyright holders of</p><p>that material) supplement the terms of this License with terms:</p><p>    a) Disclaiming warranty or limiting liability differently from the</p><p>    terms of sections 15 and 16 of this License; or</p><p>    b) Requiring preservation of specified reasonable legal notices or</p><p>    author attributions in that material or in the Appropriate Legal</p><p>    Notices displayed by works containing it; or</p><p>    c) Prohibiting misrepresentation of the origin of that material, or</p><p>    requiring that modified versions of such material be marked in</p><p>    reasonable ways as different from the original version; or</p><p>    d) Limiting the use for publicity purposes of names of licensors or</p><p>    authors of the material; or</p><p>    e) Declining to grant rights under trademark law for use of some</p><p>    trade names, trademarks, or service marks; or</p><p>    f) Requiring indemnification of licensors and authors of that</p><p>    material by anyone who conveys the material (or modified versions of</p><p>    it) with contractual assumptions of liability to the recipient, for</p><p>    any liability that these contractual assumptions directly impose on</p><p>    those licensors and authors.</p><p>  All other non-permissive additional terms are considered \"further</p><p>restrictions\" within the meaning of section 10.  If the Program as you</p><p>received it, or any part of it, contains a notice stating that it is</p><p>governed by this License along with a term that is a further</p><p>restriction, you may remove that term.  If a license document contains</p><p>a further restriction but permits relicensing or conveying under this</p><p>License, you may add to a covered work material governed by the terms</p><p>of that license document, provided that the further restriction does</p><p>not survive such relicensing or conveying.</p><p>  If you add terms to a covered work in accord with this section, you</p><p>must place, in the relevant source files, a statement of the</p><p>additional terms that apply to those files, or a notice indicating</p><p>where to find the applicable terms.</p><p>  Additional terms, permissive or non-permissive, may be stated in the</p><p>form of a separately written license, or stated as exceptions;</p><p>the above requirements apply either way.</p><p>  8. Termination.</p><p>  You may not propagate or modify a covered work except as expressly</p><p>provided under this License.  Any attempt otherwise to propagate or</p><p>modify it is void, and will automatically terminate your rights under</p><p>this License (including any patent licenses granted under the third</p><p>paragraph of section 11).</p><p>  However, if you cease all violation of this License, then your</p><p>license from a particular copyright holder is reinstated (a)</p><p>provisionally, unless and until the copyright holder explicitly and</p><p>finally terminates your license, and (b) permanently, if the copyright</p><p>holder fails to notify you of the violation by some reasonable means</p><p>prior to 60 days after the cessation.</p><p>  Moreover, your license from a particular copyright holder is</p><p>reinstated permanently if the copyright holder notifies you of the</p><p>violation by some reasonable means, this is the first time you have</p><p>received notice of violation of this License (for any work) from that</p><p>copyright holder, and you cure the violation prior to 30 days after</p><p>your receipt of the notice.</p><p>  Termination of your rights under this section does not terminate the</p><p>licenses of parties who have received copies or rights from you under</p><p>this License.  If your rights have been terminated and not permanently</p><p>reinstated, you do not qualify to receive new licenses for the same</p><p>material under section 10.</p><p>  9. Acceptance Not Required for Having Copies.</p><p>  You are not required to accept this License in order to receive or</p><p>run a copy of the Program.  Ancillary propagation of a covered work</p><p>occurring solely as a consequence of using peer-to-peer transmission</p><p>to receive a copy likewise does not require acceptance.  However,</p><p>nothing other than this License grants you permission to propagate or</p><p>modify any covered work.  These actions infringe copyright if you do</p><p>not accept this License.  Therefore, by modifying or propagating a</p><p>covered work, you indicate your acceptance of this License to do so.</p><p>  10. Automatic Licensing of Downstream Recipients.</p><p>  Each time you convey a covered work, the recipient automatically</p><p>receives a license from the original licensors, to run, modify and</p><p>propagate that work, subject to this License.  You are not responsible</p><p>for enforcing compliance by third parties with this License.</p><p>  An \"entity transaction\" is a transaction transferring control of an</p><p>organization, or substantially all assets of one, or subdividing an</p><p>organization, or merging organizations.  If propagation of a covered</p><p>work results from an entity transaction, each party to that</p><p>transaction who receives a copy of the work also receives whatever</p><p>licenses to the work the party's predecessor in interest had or could</p><p>give under the previous paragraph, plus a right to possession of the</p><p>Corresponding Source of the work from the predecessor in interest, if</p><p>the predecessor has it or can get it with reasonable efforts.</p><p>  You may not impose any further restrictions on the exercise of the</p><p>rights granted or affirmed under this License.  For example, you may</p><p>not impose a license fee, royalty, or other charge for exercise of</p><p>rights granted under this License, and you may not initiate litigation</p><p>(including a cross-claim or counterclaim in a lawsuit) alleging that</p><p>any patent claim is infringed by making, using, selling, offering for</p><p>sale, or importing the Program or any portion of it.</p><p>  11. Patents.</p><p>  A \"contributor\" is a copyright holder who authorizes use under this</p><p>License of the Program or a work on which the Program is based.  The</p><p>work thus licensed is called the contributor's \"contributor version\".</p><p>  A contributor's \"essential patent claims\" are all patent claims</p><p>owned or controlled by the contributor, whether already acquired or</p><p>hereafter acquired, that would be infringed by some manner, permitted</p><p>by this License, of making, using, or selling its contributor version,</p><p>but do not include claims that would be infringed only as a</p><p>consequence of further modification of the contributor version.  For</p><p>purposes of this definition, \"control\" includes the right to grant</p><p>patent sublicenses in a manner consistent with the requirements of</p><p>this License.</p><p>  Each contributor grants you a non-exclusive, worldwide, royalty-free</p><p>patent license under the contributor's essential patent claims, to</p><p>make, use, sell, offer for sale, import and otherwise run, modify and</p><p>propagate the contents of its contributor version.</p><p>  In the following three paragraphs, a \"patent license\" is any express</p><p>agreement or commitment, however denominated, not to enforce a patent</p><p>(such as an express permission to practice a patent or covenant not to</p><p>sue for patent infringement).  To \"grant\" such a patent license to a</p><p>party means to make such an agreement or commitment not to enforce a</p><p>patent against the party.</p><p>  If you convey a covered work, knowingly relying on a patent license,</p><p>and the Corresponding Source of the work is not available for anyone</p><p>to copy, free of charge and under the terms of this License, through a</p><p>publicly available network server or other readily accessible means,</p><p>then you must either (1) cause the Corresponding Source to be so</p><p>available, or (2) arrange to deprive yourself of the benefit of the</p><p>patent license for this particular work, or (3) arrange, in a manner</p><p>consistent with the requirements of this License, to extend the patent</p><p>license to downstream recipients.  \"Knowingly relying\" means you have</p><p>actual knowledge that, but for the patent license, your conveying the</p><p>covered work in a country, or your recipient's use of the covered work</p><p>in a country, would infringe one or more identifiable patents in that</p><p>country that you have reason to believe are valid.</p><p>  If, pursuant to or in connection with a single transaction or</p><p>arrangement, you convey, or propagate by procuring conveyance of, a</p><p>covered work, and grant a patent license to some of the parties</p><p>receiving the covered work authorizing them to use, propagate, modify</p><p>or convey a specific copy of the covered work, then the patent license</p><p>you grant is automatically extended to all recipients of the covered</p><p>work and works based on it.</p><p>  A patent license is \"discriminatory\" if it does not include within</p><p>the scope of its coverage, prohibits the exercise of, or is</p><p>conditioned on the non-exercise of one or more of the rights that are</p><p>specifically granted under this License.  You may not convey a covered</p><p>work if you are a party to an arrangement with a third party that is</p><p>in the business of distributing software, under which you make payment</p><p>to the third party based on the extent of your activity of conveying</p><p>the work, and under which the third party grants, to any of the</p><p>parties who would receive the covered work from you, a discriminatory</p><p>patent license (a) in connection with copies of the covered work</p><p>conveyed by you (or copies made from those copies), or (b) primarily</p><p>for and in connection with specific products or compilations that</p><p>contain the covered work, unless you entered into that arrangement,</p><p>or that patent license was granted, prior to 28 March 2007.</p><p>  Nothing in this License shall be construed as excluding or limiting</p><p>any implied license or other defenses to infringement that may</p><p>otherwise be available to you under applicable patent law.</p><p>  12. No Surrender of Others' Freedom.</p><p>  If conditions are imposed on you (whether by court order, agreement or</p><p>otherwise) that contradict the conditions of this License, they do not</p><p>excuse you from the conditions of this License.  If you cannot convey a</p><p>covered work so as to satisfy simultaneously your obligations under this</p><p>License and any other pertinent obligations, then as a consequence you may</p><p>not convey it at all.  For example, if you agree to terms that obligate you</p><p>to collect a royalty for further conveying from those to whom you convey</p><p>the Program, the only way you could satisfy both those terms and this</p><p>License would be to refrain entirely from conveying the Program.</p><p>  13. Remote Network Interaction; Use with the GNU General Public License.</p><p>  Notwithstanding any other provision of this License, if you modify the</p><p>Program, your modified version must prominently offer all users</p><p>interacting with it remotely through a computer network (if your version</p><p>supports such interaction) an opportunity to receive the Corresponding</p><p>Source of your version by providing access to the Corresponding Source</p><p>from a network server at no charge, through some standard or customary</p><p>means of facilitating copying of software.  This Corresponding Source</p><p>shall include the Corresponding Source for any work covered by version 3</p><p>of the GNU General Public License that is incorporated pursuant to the</p><p>following paragraph.</p><p>  Notwithstanding any other provision of this License, you have</p><p>permission to link or combine any covered work with a work licensed</p><p>under version 3 of the GNU General Public License into a single</p><p>combined work, and to convey the resulting work.  The terms of this</p><p>License will continue to apply to the part which is the covered work,</p><p>but the work with which it is combined will remain governed by version</p><p>3 of the GNU General Public License.</p><p>  14. Revised Versions of this License.</p><p>  The Free Software Foundation may publish revised and/or new versions of</p><p>the GNU Affero General Public License from time to time.  Such new versions</p><p>will be similar in spirit to the present version, but may differ in detail to</p><p>address new problems or concerns.</p><p>  Each version is given a distinguishing version number.  If the</p><p>Program specifies that a certain numbered version of the GNU Affero General</p><p>Public License \"or any later version\" applies to it, you have the</p><p>option of following the terms and conditions either of that numbered</p><p>version or of any later version published by the Free Software</p><p>Foundation.  If the Program does not specify a version number of the</p><p>GNU Affero General Public License, you may choose any version ever published</p><p>by the Free Software Foundation.</p><p>  If the Program specifies that a proxy can decide which future</p><p>versions of the GNU Affero General Public License can be used, that proxy's</p><p>public statement of acceptance of a version permanently authorizes you</p><p>to choose that version for the Program.</p><p>  Later license versions may give you additional or different</p><p>permissions.  However, no additional obligations are imposed on any</p><p>author or copyright holder as a result of your choosing to follow a</p><p>later version.</p><p>  15. Disclaimer of Warranty.</p><p>  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY</p><p>APPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT</p><p>HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY</p><p>OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,</p><p>THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR</p><p>PURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM</p><p>IS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF</p><p>ALL NECESSARY SERVICING, REPAIR OR CORRECTION.</p><p>  16. Limitation of Liability.</p><p>  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING</p><p>WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS</p><p>THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY</p><p>GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE</p><p>USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF</p><p>DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD</p><p>PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),</p><p>EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF</p><p>SUCH DAMAGES.</p><p>  17. Interpretation of Sections 15 and 16.</p><p>  If the disclaimer of warranty and limitation of liability provided</p><p>above cannot be given local legal effect according to their terms,</p><p>reviewing courts shall apply local law that most closely approximates</p><p>an absolute waiver of all civil liability in connection with the</p><p>Program, unless a warranty or assumption of liability accompanies a</p><p>copy of the Program in return for a fee.</p><p>                     END OF TERMS AND CONDITIONS</p><p>            How to Apply These Terms to Your New Programs</p><p>  If you develop a new program, and you want it to be of the greatest</p><p>possible use to the public, the best way to achieve this is to make it</p><p>free software which everyone can redistribute and change under these terms.</p><p>  To do so, attach the following notices to the program.  It is safest</p><p>to attach them to the start of each source file to most effectively</p><p>state the exclusion of warranty; and each file should have at least</p><p>the \"copyright\" line and a pointer to where the full notice is found.</p><p>    &lt;one line to give the program's name and a brief idea of what it does.&gt;</p><p>    Copyright (C) &lt;year&gt;  &lt;name of author&gt;</p><p>    This program is free software: you can redistribute it and/or modify</p><p>    it under the terms of the GNU Affero General Public License as published</p><p>    by the Free Software Foundation, either version 3 of the License, or</p><p>    (at your option) any later version.</p><p>    This program is distributed in the hope that it will be useful,</p><p>    but WITHOUT ANY WARRANTY; without even the implied warranty of</p><p>    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the</p><p>    GNU Affero General Public License for more details.</p><p>    You should have received a copy of the GNU Affero General Public License</p><p>    along with this program.  If not, see &lt;https://www.gnu.org/licenses/&gt;.</p><p>Also add information on how to contact you by electronic and paper mail.</p><p>  If your software can interact with users remotely through a computer</p><p>network, you should also make sure that it provides a way for users to</p><p>get its source.  For example, if your program is a web application, its</p><p>interface could display a \"Source\" link that leads users to an archive</p><p>of the code.  There are many ways you could offer source, and different</p><p>solutions will be better for different programs; see section 13 for the</p><p>specific requirements.</p><p>  You should also get your employer (if you work as a programmer) or school,</p><p>if any, to sign a \"copyright disclaimer\" for the program, if necessary.</p><p>For more information on this, and how to apply and follow the GNU AGPL, see</p><p>&lt;https://www.gnu.org/licenses/&gt;.</p><p></p>"
                }
            }
        },
        "Manual": {
            "name": "Manual",
            "pages": {
                "Armies": {
                    "name": "Armies",
                    "text": "<p>This module uses the built in army actor type. Since 1.0.0, the workaround implementation has been removed.</p><h2>Recruitable Armies</h2><p>To make armies show up in the Recruit Army window, import the actor from the compendium into a folder called <strong>Recruitable Armies</strong> and make the players the owners. Custom actors will also be picked up if those conditions apply.</p><p>By default, it is assumed that army tokens are unlinked (<strong>Prototype Token -&gt; Identity -&gt; Link Actor Data = unchecked</strong>). This means that all changes made on the actor in the actor sidebar are synced to all tokens on all scenes, unless they are overridden. You can override data by double-clicking on the token itself and make changes on that sheet.</p><p>If you wish to link actor data instead so that editing a token on a scene and in the sidebar changes the same data, you need to change the prototype token property, copy the recruited army and move it out of the <strong>Recruitable Armies</strong> folder.</p><h2>Custom Tactics</h2><p>By default, all tactics lower than the army's level that support the armies type are listed in the train army browser. If you wish to add your own tactics, simply create an Item of type \"Campaign Feature\" in your items tab and set the following things</p><ul><li><p><strong>Campaign</strong>: Kingmaker</p></li><li><p><strong>Category</strong>: Army Tactic</p></li><li><p><strong>Traits</strong> (under the name input): Infantry, Siege, Cavalry or Skirmisher</p></li></ul><h2>Automation Notes</h2><p>Kingdom Sheet:</p><ul><li>Consumption is automated by summing up all consumption values of all visible tokens across all scenes. If your actor is unlinked, it will be calculated on by token basis, otherwise it will only be calculated once per actor</li></ul>"
                },
                "Kingdom Building": {
                    "name": "Kingdom Building",
                    "text": "<h2>Homebrew Built-in Changes</h2><ul><li><p><a href=\"https://paizo.com/threads/rzs43olf?Kingmaker-Adventure-Path-2E-Errata#19\">Based on James Jacob's answers</a>, event XP is bumped to 40XP from 30XP and the event modifier acts as a level modifier for the <a href=\"https://2e.aonprd.com/Rules.aspx?ID=575\">XP Awards table</a></p></li><li><p><a href=\"https://paizo.com/threads/rzs43xjp?How-do-I-calculate-settlement-level#3\">Based on James Jacob's answer</a> Settlement Level is calculated by taking the number of blocks with at least one structure in it</p></li><li><p><strong>Deliberate Planning</strong> had its Status Bonus changed to a Circumstance Bonus. Reasoning for that is that not a single leadership activity grants a status bonus, it's all Circumstance Bonuses. Plus a +1 Status bonus is obsolete from level 1.</p></li><li><p>Using a similar line of reasoning, Kingdom Feats provide Circumstance Bonuses instead of Status Bonuses; if you want to use Status Bonuses, you can choose the Status Bonus variants (or V&amp;K alternatives)</p></li><li><p>Occult Shop ups the limit for Occult and not Magical items in your settlements</p></li><li><p>Worksites need to be in a claimed hex to be counted.</p></li></ul><h2>Vance &amp; Kerenshara Integration</h2><p><a href=\"https://docs.google.com/document/d/1NHksCXkXbjtrv-26VgFHNbyYldatVwag9lM44IWxIXo/edit?pli=1#heading=h.2bowazxvnvid\">Vance &amp; Kerenshara Homebrew</a> (and the subsequent <a href=\"https://docs.google.com/document/d/1CWQZMA5MZA8zDpG5QFWB-crF7j5LtfmV8nbRndOujg0/edit?tab=t.0\">1.1 addition</a>) adds a multitude of adjustments and fixes to Kingdom Building. The module allows you to opt into many changes using the <strong>Config</strong> button on the Kingdom Sheet, except for the following:</p><ul><li><p>Construction Time will not be implemented (use a journal)</p></li><li><p>Renown will not be implemented (use a journal)</p></li><li><p>No changes to the turn structure is made; you are expected to simply reuse the existing structure and keep action cost in mind (2 actions for Retrain and checks with skills that you are not specialized in)</p></li><li><p>Similarly no visual help is provided for keeping track of available actions during the activity phase (3 for PCs, 2 for NPCs) nor for remembering the additional civic actions granted by a Town Hall (1), Castle (2) or Palace(2) (which I advise you don't use unless you want to increase kingdom turn length even more)</p></li></ul><h2>Official Adventure Integration</h2><ul><li><p>By default, the Kingdom Sheet uses data from the main hexmap scene if enabled; this means that claimed hexes, worksites and farmlands will be populated correctly from your hex map</p></li><li><p>Placing armies onto scenes that are owned by the players will automatically update update their consumption on the sheet</p></li><li><p><strong>There is no support for the buildings shipped with the official module since they don't cover many areas (infrastructure, V&amp;K &amp; home brew)! </strong>Instead, this module ships its own structures; those are automatically linked to the Foundry built-in token images.</p></li></ul><h2>Kingdom Sheet</h2><p>The Kingdom sheet auto-calculates almost everything related to kingdom building. You launch it exclusively with the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.1LmPW2OlHgJvedY8]{View Kingdom} Macro.</p><p>On first launch, it copies an actor with the name <strong>Kingdom Sheet</strong> into your actors folder. This actor is used to store the sheet data and can be placed anywhere but you must not change its name. Then proceed with configuring the sheet:</p><ol><li><p>Edit the <strong>Kingdom Sheet</strong> actor's permissions in Foundry's <strong>Actors</strong> tab by right clicking on the kingdom sheet actor. Set every PC as <strong>Owner</strong> if you want them to change values on the sheet, otherwise choose <strong>Observer</strong></p></li><li><p>Fill in the details in the <strong>Status</strong> tab. Leaders need to be drag and dropped from the actors sidebar and must be either a <strong>Character</strong> or <strong>NPC</strong>. If you are playing with the companion guide, make sure to set the appropriate invested bonus (or the leader type drop down when using V&amp;K Leadership Bonuses)</p></li><li><p>Configure your hex map in the <strong>Status</strong> tab:</p><p>First you need to decide which method you use for tracking kingdom size, worksites and farmlands. By default, the <strong>Official Module</strong> is configured. You can set the preferred method in your kingdom sheet settings:</p><ul><li><p><strong>Official Module</strong>: take worksites, farmlands and kingdom size from the official module's hex map</p></li><li><p><strong>Manual</strong>: manually configure your worksites, farmlands and kingdom size in the <strong>Status</strong> tab</p></li><li><p><strong>Tile/Drawing Based</strong>: associate selected drawings/tiles with meta information using the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.tsqRp4OXdkrzRajS]{Edit Realm Tile/Drawing} macro; claimed hex tiles/drawings placed on a configured scene increase your size, worksite and farmland tiles placed inside the claimed hex tiles/drawings increase their respective values. The example image below shows drawings that were made using the <strong>Draw Polygon</strong> tool and have a pattern background image configured.</p><ul><li><p>View your hexmap scene, then scroll to the bottom of the <strong>Status</strong> tab and click the <strong>Set Stolen Lands Hex Map to Current Scene</strong></p></li><li><p>Edit the Scene configuration: in the <strong>Basics</strong> tab, change <strong>Permissions</strong> from <strong>GM Only</strong> to <strong>All Players</strong></p></li></ul><img src=\"modules/pf2e-kingmaker-tools/docs/images/tilebased.png\" /></li></ul></li><li><p>Set the appropriate skill proficiencies in the <strong>Skills</strong> and feats in the <strong>Feats</strong> tab.</p></li><li><p>Import or create a capital settlement scene. This module ships a few example scenes that come with pre-configured settlement block tiles. If you wish to use your own scenes, be sure to read up on how automatic block tile calculation is implemented in the <strong>Settlements</strong> and <strong>Structures</strong> section further below!</p></li><li><p>Import all structures from the <strong>Structures</strong> compendium</p></li><li><p>Drag and drop the <strong>Townhall</strong> structure from Foundry's <strong>Actors</strong> tab onto a block in your capital scene</p></li><li><p>While viewing your capital scene, go into <strong>Settlements</strong> tab and click <strong>Add Current Scene</strong>.</p><img src=\"modules/pf2e-kingmaker-tools/docs/images/settlements-tab.png\" /></li><li><p>Edit the added settlement and change the <strong>Type</strong> to <strong>Capital</strong></p></li></ol><p>Now you are able to run your first kingdom turn. Change to the <strong>Turn</strong> tab.</p><p>Actions flow from top to bottom if they are numbered. the <strong>?</strong> buttons will open the activities description. If there are more than 1 button per line, you need to make a choice.</p><p>Make sure to set the <strong>Active Settlement</strong> in the sidebar to the settlement the PCs are in or where the kingdom event to resolve takes place. At the end of the Kingdom Turn, hit the <strong>End Turn</strong> button. This will move all values in their <strong>Next</strong> columns to their <strong>Now</strong> ones.</p><img src=\"modules/pf2e-kingmaker-tools/docs/images/turn.png\" /><h2>Settlements</h2><p>Settlements are created as scenes on which you can place structure tokens. Before being able to use a settlement, you first need to add it to your <strong>Settlements</strong> in your kingdom sheet. First, change to the <strong>Settlements</strong> tab, then click <strong>Add Current Scene</strong></p><img src=\"modules/pf2e-kingmaker-tools/docs/images/settlements-tab.png\" /><p>This module ships a <strong>Settlement Scenes</strong> compendium which contains 5 settlement types:</p><ul><li><p>One with no water borders</p></li><li><p>4 with 1-4 water borders</p></li></ul><p>All scenes come with block tiles, onto which you can place your structures. These tiles use a special flag to not accidentally consider your own tiles as blocks. You can place them on your own scenes by simply copying it over and modifying them to your liking.</p><p>You can resize the tiles, change their background image, but you must not rotate them. Only rectangular shapes will work. The module ships a 1x4 and 4x1 tile at the same location as the 2x2 image that you can use to spice things ups.</p><p>By default, placing a structure into a block automatically increases the settlement's level. If you do not want this kind of automation, you can turn it off in the kingdom sheet settings. You can also disable it on per scene basis in the settlement configuration.</p><h2>Structures</h2><p>Structures are implemented as NPC stat blocks, including the correct sizes. Their description is in the public notes. You will need to import all structures from the Structures compendium to make them show up in the Build Structure activity popup. The module will include all structures in your game in that window, so you can create custom structures as well.</p><img src=\"modules/pf2e-kingmaker-tools/docs/images/structures.png\" /><p>All structures in a settlement can be automatically summed up and calculated and can be viewed in your settlements tab by clicking the Inspect button.</p><p>Settlement level is calculated by placing structure tokens on special block tiles that are included in the <strong>Settlement Scenes </strong>compendium. If you wish to use your own scenes, import a single scene, copy the block tile to your own scene and, if required, change the background image.</p><p>You can set the <strong>Slowed</strong> condition after a <strong>Build Structure</strong> <strong>Failure</strong> to indicate that construction is delayed. It will be excluded from all modifier calculations.</p><p>If you want to home brew structure rules, you can use the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.DNVjHLroQKfN8y4V]{Edit Structure Rules} Macro.</p><p>A guide on structure rules can be found in the <a href=\"https://github.com/BernhardPosselt/pf2e-kingmaker-tools/blob/master/docs/structure-rules.md\">GitHub Repo</a> and requires the use of JSON.</p><h2>Automation Notes</h2><ul><li><p>Many Kingdom Feats are not fully automated. You can check that by taking a look at the Auto column in the Feats tab. Details are visible by hovering over the <strong>(x)</strong> symbol with your cursor.</p></li></ul>"
                },
                "Weather": {
                    "name": "Weather",
                    "text": "<p>By default, when your clock advances to a new day, weather is rolled automatically for the current month. If you prefer rolling manually, turn off auto rolling in the settings and use the provided @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.JRURoF9WSle1Waud]{Roll Weather} macro or manage it manually with the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.HrP9RsXVhlfn6wNS]{Set Current Weather} macro.</p><p>Visual effects rely on the built-in weather effects. This means that all scenes' weather effects will be overridden by the currently active weather when viewing that scene.</p><p>If you want to allow a certain scene to override this behavior, use the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.RA7iXfcHQlsiNcj6]{Scene Weather Settings} macro and disable syncing weather. Note that this will also prevent the usage of the <strong>Set Current Weather</strong> macro, but you can decide to reuse the weather playlist functionality by enabling <strong>Sync Weather Playlist</strong> in the scene's weather settings.</p><p>If your party moves indoors, you can disable the current weather effect using @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.ZHxd6N09A2QCayS0]{Toggle Shelter from Weather}</p><p>In addition, you can configure sound effects that are played by creating playlists with the following names:</p><ul><li><p><strong>weather.sunny</strong></p></li><li><p><strong>weather.rain</strong></p></li><li><p><strong>weather.snow</strong></p></li><li><p><strong>weather.fog</strong></p></li><li><p><strong>weather.blizzard</strong></p></li><li><p><strong>weather.rainStorm</strong></p></li><li><p><strong>weather.leaves</strong></p></li></ul><h2>Official Adventure Integration</h2><p>If you are using the official module, <strong>rain</strong>, <strong>snow</strong>, <strong>rainStorm</strong> and <strong>blizzard</strong> are autoconfigured for you, but you can still override the mechanism by creating the appropriately named playlists</p>"
                },
                "Combat Tracks": {
                    "name": "Combat Tracks",
                    "text": "<p>The CRPG ships with various combat tracks that depend on the region. If Combat Tracks are enabled, it tries to find a playlist in the following order:</p><ol><li><p>Combat playlist of the first actor with a playlist on the combat tracker (Configurable via @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.sFJkolazth08xYOH]{Set Combat Playlist} Macro by selecting a token)</p></li><li><p>Combat playlist of the active scene (Configurable via <strong>Set Combat Playlist</strong> Macro by not selecting a token)</p></li><li><p>Combat playlist of the current region (configured in the Camping Sheet)</p></li></ol><p>If any playlist is found, at the start of combat, that playlist is played and the active scene's playlist is disabled.</p><p>Afterward, the games active scene's playlist is started again.</p><p>If you wish to quickly disable combat tracks, e.g. when fighting a boss, you can use the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.qmj42STqKK89f5Sh]{Toggle Combat Tracks} Macro.</p><h2>Official Adventure Integration</h2><p>If you are using the official module, the default and region combat tracks are auto-configured for you after opening the camping sheet for the first time, but you can still override the mechanism by creating the appropriately named playlists</p>"
                },
                "Tokens": {
                    "name": "Tokens",
                    "text": "<h2>Official Kingmaker Module</h2><p>Everything is configured for you out of the box, no manual intervention needed.</p><h2>Without Official Module</h2><p>If you haven't purchased or enabled the official module, this module will pre-configure token mappings for you automatically. Your tokens are expected to be placed into <strong>Data/pf2e-kingmaker-tools-tokens/</strong> (or if you are on <strong>The Forge</strong>, you need to create the <strong>pf2e-kingmaker-tools-tokens </strong>folder in<strong> Forge Assets </strong>instead). Then, starting inside that folder, create the following structure:</p><ul><li><p><strong>kingmaker/Token - Aecora Silverfire.webp</strong></p></li><li><p><strong>kingmaker/Token - Agai.webp</strong></p></li><li><p><strong>kingmaker/Token - Akiros.webp</strong></p></li><li><p><strong>kingmaker/Token - Akuzhail.webp</strong></p></li><li><p><strong>kingmaker/Token - Alasen.webp</strong></p></li><li><p><strong>kingmaker/Token - Ameon Trask.webp</strong></p></li><li><p><strong>kingmaker/Token - Annamede Belavarah.webp</strong></p></li><li><p><strong>kingmaker/Token - Armag.webp</strong></p></li><li><p><strong>kingmaker/Token - Auchs.webp</strong></p></li><li><p><strong>kingmaker/Token - Avatar of the Lantern King.webp</strong></p></li><li><p><strong>kingmaker/Token - Barbtongued Wyvern.webp</strong></p></li><li><p><strong>kingmaker/Token - Black Tear Cutthroat.webp</strong></p></li><li><p><strong>kingmaker/Token - Bloom Cultist 2.webp</strong></p></li><li><p><strong>kingmaker/Token - Bloom of Lamashtu.webp</strong></p></li><li><p><strong>kingmaker/Token - Bloom Wyvern.webp</strong></p></li><li><p><strong>kingmaker/Token - Bog Mummy Cultist.webp</strong></p></li><li><p><strong>kingmaker/Token - Brush Thylacine.webp</strong></p></li><li><p><strong>kingmaker/Token - Castruccio Irovetti.webp</strong></p></li><li><p><strong>kingmaker/Token - Cephal Lorentus.webp</strong></p></li><li><p><strong>kingmaker/Token - Chief Sootscale.webp</strong></p></li><li><p><strong>kingmaker/Token - Cleansed Cultist.webp</strong></p></li><li><p><strong>kingmaker/Token - Corax.webp</strong></p></li><li><p><strong>kingmaker/Token - Cursed Guardian.webp</strong></p></li><li><p><strong>kingmaker/Token - Cyclops Zombie.webp</strong></p></li><li><p><strong>kingmaker/Token - Darivan.webp</strong></p></li><li><p><strong>kingmaker/Token - Davik Nettles.webp</strong></p></li><li><p><strong>kingmaker/Token - Defaced Naiad Queen.webp</strong></p></li><li><p><strong>kingmaker/Token - Dog.webp</strong></p></li><li><p><strong>kingmaker/Token - Dovan.webp</strong></p></li><li><p><strong>kingmaker/Token - Drelev Guard.webp</strong></p></li><li><p><strong>kingmaker/Token - Elga Verniex.webp</strong></p></li><li><p><strong>kingmaker/Token - Elk.webp</strong></p></li><li><p><strong>kingmaker/Token - Endless Struggle.webp</strong></p></li><li><p><strong>kingmaker/Token - Engelidis.webp</strong></p></li><li><p><strong>kingmaker/Token - Eobald.webp</strong></p></li><li><p><strong>kingmaker/Token - Evindra.webp</strong></p></li><li><p><strong>kingmaker/Token - False Priestess.webp</strong></p></li><li><p><strong>kingmaker/Token - Fetch.webp</strong></p></li><li><p><strong>kingmaker/Token - Fetch.webp</strong></p></li><li><p><strong>kingmaker/Token - Fionn.webp</strong></p></li><li><p><strong>kingmaker/Token - Foras.webp</strong></p></li><li><p><strong>kingmaker/Token - Gaetane.webp</strong></p></li><li><p><strong>kingmaker/Token - Gedovius.webp</strong></p></li><li><p><strong>kingmaker/Token - General Avinash Jurg.webp</strong></p></li><li><p><strong>kingmaker/Token - Ghostly Guard.webp</strong></p></li><li><p><strong>kingmaker/Token - Goblin Bat-Dog.webp</strong></p></li><li><p><strong>kingmaker/Token - Grabbles.webp</strong></p></li><li><p><strong>kingmaker/Token - Grigori 2.webp</strong></p></li><li><p><strong>kingmaker/Token - Gromog.webp</strong></p></li><li><p><strong>kingmaker/Token - Gurija.webp</strong></p></li><li><p><strong>kingmaker/Token - Hannis Drelev 2.webp</strong></p></li><li><p><strong>kingmaker/Token - Happs Bydon.webp</strong></p></li><li><p><strong>kingmaker/Token - Hargulka.webp</strong></p></li><li><p><strong>kingmaker/Token - Hateful Hermit.webp</strong></p></li><li><p><strong>kingmaker/Token - Hillstomper.webp</strong></p></li><li><p><strong>kingmaker/Token - Hooktongue.webp</strong></p></li><li><p><strong>kingmaker/Token - Horagnamon.webp</strong></p></li><li><p><strong>kingmaker/Token - Ilora Nuski.webp</strong></p></li><li><p><strong>kingmaker/Token - Ilthuliak.webp</strong></p></li><li><p><strong>kingmaker/Token - Castruccio Irovetti.webp</strong></p></li><li><p><strong>kingmaker/Token - Jaggedbriar Hag.webp</strong></p></li><li><p><strong>kingmaker/Token - Jamandi Aldori.webp</strong></p></li><li><p><strong>kingmaker/Token - Jin Durwhimmer.webp</strong></p></li><li><p><strong>kingmaker/Token - Jurgrindor.webp</strong></p></li><li><p><strong>kingmaker/Token - Kargstaad.webp</strong></p></li><li><p><strong>kingmaker/Token - Kargstaads Giant.webp</strong></p></li><li><p><strong>kingmaker/Token - Kereek.webp</strong></p></li><li><p><strong>kingmaker/Token - King Vesket.webp</strong></p></li><li><p><strong>kingmaker/Token - Kob Moleg.webp</strong></p></li><li><p><strong>kingmaker/Token - Korog.webp</strong></p></li><li><p><strong>kingmaker/Token - Kressle.webp</strong></p></li><li><p><strong>kingmaker/Token - Kundal Werewolf.webp</strong></p></li><li><p><strong>kingmaker/Token - Leng Envoy.webp</strong></p></li><li><p><strong>kingmaker/Token - Lesser Jabberwock.webp</strong></p></li><li><p><strong>kingmaker/Token - Lickweed.webp</strong></p></li><li><p><strong>kingmaker/Token - Lintwerth.webp</strong></p></li><li><p><strong>kingmaker/Token - Lizardfolk Warrior.webp</strong></p></li><li><p><strong>kingmaker/Token - Logger.webp</strong></p></li><li><p><strong>kingmaker/Token - Malgorzata Niska.web</strong></p></li><li><p><strong>kingmaker/Token - Mandragora Swarm.webp</strong></p></li><li><p><strong>kingmaker/Token - Mastiff of Tindalos.webp</strong></p></li><li><p><strong>kingmaker/Token - Elk.webp</strong></p></li><li><p><strong>kingmaker/Token - Melianse.webp</strong></p></li><li><p><strong>kingmaker/Token - Minognos-Ushad.webp</strong></p></li><li><p><strong>kingmaker/Token - Nighmare Rook.webp</strong></p></li><li><p><strong>kingmaker/Token - Nilak.webp</strong></p></li><li><p><strong>kingmaker/Token - Nishkiv.webp</strong></p></li><li><p><strong>kingmaker/Token - Ntavi.webp</strong></p></li><li><p><strong>kingmaker/Token - Nugrah.webp</strong></p></li><li><p><strong>kingmaker/Token - Nyrissa 2.webp</strong></p></li><li><p><strong>kingmaker/Token - Old Crackjaw.webp</strong></p></li><li><p><strong>kingmaker/Token - Oleg.webp</strong></p></li><li><p><strong>kingmaker/Token - Pavetta Stroon.webp</strong></p></li><li><p><strong>kingmaker/Token - Phomandala.webp</strong></p></li><li><p><strong>kingmaker/Token - Pitax Warden.webp</strong></p></li><li><p><strong>kingmaker/Token - Prazil.webp</strong></p></li><li><p><strong>kingmaker/Token - Primal Bandersnatch.webp</strong></p></li><li><p><strong>kingmaker/Token - Qunitessa Maray.webp</strong></p></li><li><p><strong>kingmaker/Token - Rickety Bridge.webp</strong></p></li><li><p><strong>kingmaker/Token - Rigg Gargadilly.webp</strong></p></li><li><p><strong>kingmaker/Token - Fetch.webp</strong></p></li><li><p><strong>kingmaker/Token - Satinder Morne.webp</strong></p></li><li><p><strong>kingmaker/Token - Sepoko.webp</strong></p></li><li><p><strong>kingmaker/Token - Sir Fredo Sinnet.webp</strong></p></li><li><p><strong>kingmaker/Token - Sister of the Bloodshot Eye.webp</strong></p></li><li><p><strong>kingmaker/Token - Skeletal Tiger Lord.webp</strong></p></li><li><p><strong>kingmaker/Token - Smoke-Filled Hallway.webp</strong></p></li><li><p><strong>kingmaker/Token - Stinging Nettle.webp</strong></p></li><li><p><strong>kingmaker/Token - Svetlana.webp</strong></p></li><li><p><strong>kingmaker/Token - Talon Peak Roc.webp</strong></p></li><li><p><strong>kingmaker/Token - Tartuk.webp</strong></p></li><li><p><strong>kingmaker/Token - Terrion Numesti.webp</strong></p></li><li><p><strong>kingmaker/Token - The Beast.webp</strong></p></li><li><p><strong>kingmaker/Token - The Dancing Lady.webp</strong></p></li><li><p><strong>kingmaker/Token - The First Faithful.webp</strong></p></li><li><p><strong>kingmaker/Token - The Gardener.webp</strong></p></li><li><p><strong>kingmaker/Token - The Horned Hunter.webp</strong></p></li><li><p><strong>kingmaker/Token - The Knurly Witch.webp</strong></p></li><li><p><strong>kingmaker/Token - The Lonely Warrior.webp</strong></p></li><li><p><strong>kingmaker/Token - The Misbegotten Troll.webp</strong></p></li><li><p><strong>kingmaker/Token - The Stag Lord.webp</strong></p></li><li><p><strong>kingmaker/Token - The Wriggling Man.webp</strong></p></li><li><p><strong>kingmaker/Token - Threshold Disciple.webp</strong></p></li><li><p><strong>kingmaker/Token - Threshold Hermeticist.webp</strong></p></li><li><p><strong>kingmaker/Token - Threshold Mystic.webp</strong></p></li><li><p><strong>kingmaker/Token - Brush Thylacine.webp</strong></p></li><li><p><strong>kingmaker/Token - Tiger Lord.webp</strong></p></li><li><p><strong>kingmaker/Token - Trapdoor Ogre Spider.webp</strong></p></li><li><p><strong>kingmaker/Token - Tree That Weeps.webp</strong></p></li><li><p><strong>kingmaker/Token - Troll Guard.webp</strong></p></li><li><p><strong>kingmaker/Token - Tulvak.webp</strong></p></li><li><p><strong>kingmaker/Token - Unstable Pit.webp</strong></p></li><li><p><strong>kingmaker/Token - Vilderavn Herald.webp</strong></p></li><li><p><strong>kingmaker/Token - Villamor Koth.webp</strong></p></li><li><p><strong>kingmaker/Token - Virthad.webp</strong></p></li><li><p><strong>kingmaker/Token - Volodmyra.webp</strong></p></li><li><p><strong>kingmaker/Token - Vordakai.webp</strong></p></li><li><p><strong>kingmaker/Token - Werendegar.webp</strong></p></li><li><p><strong>kingmaker/Token - Whimwyrm.webp</strong></p></li><li><p><strong>kingmaker/Token - Wild Hunt Archer.webp</strong></p></li><li><p><strong>kingmaker/Token - Wild Hunt Horse.webp</strong></p></li><li><p><strong>kingmaker/Token - Wild Hunt Hound.webp</strong></p></li><li><p><strong>kingmaker/Token - Wild Hunt Monarch.webp</strong></p></li><li><p><strong>kingmaker/Token - Wild Hunt Scout.webp</strong></p></li><li><p><strong>kingmaker/Token - Winged Owlbear.webp</strong></p></li><li><p><strong>kingmaker/Token - Xae.webp</strong></p></li><li><p><strong>kingmaker/Token - Zorek.webp</strong></p></li><li><p><strong>companions/Token - Amiri.webp</strong></p></li><li><p><strong>companions/Token - Ekundayo.webp</strong></p></li><li><p><strong>companions/Token - Harrim.webp</strong></p></li><li><p><strong>companions/Token - Jaethal.webp</strong></p></li><li><p><strong>companions/Token - Kanerah.webp</strong></p></li><li><p><strong>companions/Token - Kalikke.webp</strong></p></li><li><p><strong>companions/Token - Jubilost.webp</strong></p></li><li><p><strong>companions/Token - Linzi.webp</strong></p></li><li><p><strong>companions/Token - Nok Nok.webp</strong></p></li><li><p><strong>companions/Token - Octavia.webp</strong></p></li><li><p><strong>companions/Token - Regongar.webp</strong></p></li><li><p><strong>companions/Token - Tristian.webp</strong></p></li><li><p><strong>companions/Token - Valerie.webp</strong></p></li><li><p><strong>structures/Academy.webp</strong></p></li><li><p><strong>structures/Alchemy Laboratory.webp</strong></p></li><li><p><strong>structures/Arcanist Tower.webp</strong></p></li><li><p><strong>structures/Arena.webp</strong></p></li><li><p><strong>structures/Bank.webp</strong></p></li><li><p><strong>structures/Barracks.webp</strong></p></li><li><p><strong>structures/Brewery.webp</strong></p></li><li><p><strong>structures/Castle.webp</strong></p></li><li><p><strong>structures/Cathedral.webp</strong></p></li><li><p><strong>structures/Cemetery.webp</strong></p></li><li><p><strong>structures/Construction Yard.webp</strong></p></li><li><p><strong>structures/Dump.webp</strong></p></li><li><p><strong>structures/Embassy.webp</strong></p></li><li><p><strong>structures/Festival Hall.webp</strong></p></li><li><p><strong>structures/Foundry.webp</strong></p></li><li><p><strong>structures/Garrison.webp</strong></p></li><li><p><strong>structures/General Store.webp</strong></p></li><li><p><strong>structures/Granary.webp</strong></p></li><li><p><strong>structures/Guildhall.webp</strong></p></li><li><p><strong>structures/Herbalist.webp</strong></p></li><li><p><strong>structures/Hospital.webp</strong></p></li><li><p><strong>structures/Houses.webp</strong></p></li><li><p><strong>structures/Illicit Market.webp</strong></p></li><li><p><strong>structures/Inn.webp</strong></p></li><li><p><strong>structures/Jail.webp</strong></p></li><li><p><strong>structures/Keep.webp</strong></p></li><li><p><strong>structures/Library.webp</strong></p></li><li><p><strong>structures/Lumberyard.webp</strong></p></li><li><p><strong>structures/Luxury Store.webp</strong></p></li><li><p><strong>structures/Magic Shop.webp</strong></p></li><li><p><strong>structures/Mansion.webp</strong></p></li><li><p><strong>structures/Marketplace.webp</strong></p></li><li><p><strong>structures/Menagerie.webp</strong></p></li><li><p><strong>structures/Military Academy.webp</strong></p></li><li><p><strong>structures/Mill.webp</strong></p></li><li><p><strong>structures/Mint.webp</strong></p></li><li><p><strong>structures/Monument.webp</strong></p></li><li><p><strong>structures/Museum.webp</strong></p></li><li><p><strong>structures/Noble Villa.webp</strong></p></li><li><p><strong>structures/Occult Shop.webp</strong></p></li><li><p><strong>structures/Opera House.webp</strong></p></li><li><p><strong>structures/Orphanage.webp</strong></p></li><li><p><strong>structures/Palace.webp</strong></p></li><li><p><strong>structures/Park.webp</strong></p></li><li><p><strong>structures/Pier.webp</strong></p></li><li><p><strong>structures/Rubble.webp</strong></p></li><li><p><strong>structures/Sacred Grove.webp</strong></p></li><li><p><strong>structures/Secure Warehouse.webp</strong></p></li><li><p><strong>structures/Shrine.webp</strong></p></li><li><p><strong>structures/Smithy.webp</strong></p></li><li><p><strong>structures/Special Artisan.webp</strong></p></li><li><p><strong>structures/Stable.webp</strong></p></li><li><p><strong>structures/Stockyard.webp</strong></p></li><li><p><strong>structures/Stonemason.webp</strong></p></li><li><p><strong>structures/Tannery.webp</strong></p></li><li><p><strong>structures/Tavern, Dive.webp</strong></p></li><li><p><strong>structures/Tavern, Luxury.webp</strong></p></li><li><p><strong>structures/Tavern, Popular.webp</strong></p></li><li><p><strong>structures/Tavern, World Class.webp</strong></p></li><li><p><strong>structures/Temple.webp</strong></p></li><li><p><strong>structures/Tenement.webp</strong></p></li><li><p><strong>structures/Theater.webp</strong></p></li><li><p><strong>structures/Thieves Guild.webp</strong></p></li><li><p><strong>structures/Town Hall.webp</strong></p></li><li><p><strong>structures/Trade Shop.webp</strong></p></li><li><p><strong>structures/University.webp</strong></p></li><li><p><strong>structures/Watchtower.webp</strong></p></li><li><p><strong>structures/Waterfront (Corner).webp</strong></p></li><li><p><strong>structures/Waterfront (Side).webp</strong></p></li></ul><p>In addition, after importing structures from the Structures compendium shipped in this module, you need to run the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.sQ4DCyAFpDGfJSFM]{Structure Token Mapping} macro.</p><p>Choose the <strong>Unofficial</strong> option to use the built in mapping or <strong>Custom</strong> and enter a custom directory to use token images from another module</p>"
                },
                "Camping": {
                    "name": "Camping",
                    "text": "<h2>Usage</h2><img src=\"modules/pf2e-kingmaker-tools/img/camping/docs/camping-activities.webp\" /><p>The basic idea of the sheet is to make camping incredibly fast by:</p><ul><li>keeping previous camp assignments &amp; meal choices</li><li>showing players and GMs if all activities have been performed</li><li>automatically managing Camping and Meal effects</li><li>automating resource management like rations and ingredients</li><li>allowing you to easily override degrees of successes</li></ul><p>First, drag the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.GXeKz3qKlsoxcaTg]{Camping} Macro into your macro bar and run it once. This will create an actor called <strong>Camping Sheet</strong> in your actor directory. Do not rename or delete it since it will be used to store and retrieve data. The data is persisted on the actor's flags property which is not visible to users by opening the default actor sheet.</p><h3>Adding Camping Actors</h3><p>To add actors to your camp, drag and drop them onto the actor list.</p><img src=\"modules/pf2e-kingmaker-tools/img/camping/tutorial/2.webp\" /><p>You can add the following actors:</p><ul><li><p>characters</p></li><li><p>npcs</p></li><li><p>vehicles</p></li><li><p>loot</p></li></ul><p>but only characters will be able to perform checks and consume meals. Because effect syncing is a very slow process, it is <strong>highly discouraged to add all companion actors to the sheet. </strong>Instead, enable their activities in the sheet's settings. The only companion activity that can't be enabled that way is <strong>Camp Management</strong> (because it requires a check). Simply add the companion for that specific activity if required.</p><p><strong>Important</strong>: Note, that users can't drag and drop their own actors from the sidebar by default, so the GM needs to pre-populate it.</p><h3>Hexploration and Time Tracking</h3><p>The sheet automatically calculates your hexploration activities based on the speed of your party actor. You can override the minimum speed by setting the <strong>Minimum Travel Speed</strong> in the sheet's settings (e.g. 40 to simulate horses).</p><p>Clicking the hex icon will advance or retract 1 Hexploration Activitiy. Remaining Hexploration Activities are shown in <strong>Hex. Activities</strong> and are calculated based on the time listed in <strong>Adventuring</strong>. Passing even a single second at the start of the day will therefore reduce your Hexploration activities as RAW.</p><img src=\"modules/pf2e-kingmaker-tools/img/camping/docs/time-tracker.webp\" /><h3>Random Encounters</h3><p>Random encounters are managed at the very top by selecting the region drop down and changing the <strong>Encounter DC</strong> modifier if necessary. They are automatically rolled during rest but can be rolled during the day as well by clicking on the skull and dice button. If you don't want to perform a flat check hit the skull button instead.</p><p>Roll Tables are configured in the sheet's region configuration.</p><p>Keep in mind that the <strong>Encounter DC</strong> is not only modified by the encounter modifier, but also by chosen activities like <strong>Blend into the Night</strong>.</p><p>The rules mention that you increase the Encounter DC for each hour spent during camp and perform a random encounter check. This is widely regarded as a mistake and therefore isn't automated. If you wish to follow RAW, you need manually increase the modifier and check for encounters.</p><p>Out of the box, the official module only ships combat encounters. If you want to roll non combat encounters as well, you can use a <strong>Proxy Random Encounter Table</strong> which is configured in the sheet's settings. The proxy table can roll on subtables based on a formula or the configured roll table for the current region by setting <strong>Result Type</strong> to <strong>Text</strong> and <strong>Result Details</strong> to <strong>Creature</strong>.</p><img src=\"modules/pf2e-kingmaker-tools/docs/images/random-encounter-proxy-table.png\" /><h3>Prepare Campsite</h3><p>When you open up the sheet, the only activity that can be chosen is Prepare Campsite. Drag an actor from the actor list:</p><img src=\"modules/pf2e-kingmaker-tools/img/camping/docs/actor-list.webp\" /><p>onto the Prepare Campsite Tile:</p><img src=\"modules/pf2e-kingmaker-tools/img/camping/docs/prepare-campsite.webp\" /><p>To fill the activity. After rolling the check, a Failure, Success or Critical Success automatically advances the sheet to the <strong>Camping Activities</strong> section and syncs the effects. Otherwise clicking on the <strong>&gt;</strong> button will immediately move to the Eating section. Because no actor had the chance to cook a meal, all meal buttons will be disabled.</p><p>You can track existing campsites on a hex map by setting a <strong>Hexploration Scene</strong> in the sheet's settings. This will save the current party token position and Prepare Campsite degree of success (other than Critical Failure) on the map. If you prepare campsite in the same hex again, you will be asked whether you want to reuse a previous result.</p><h3>Camping Activities</h3><p>In order to perform camping activities, you have to set <strong>Prepare Campsite</strong> to a result other than <strong>Critical Failure</strong> or <strong>-</strong>. Otherwise the <strong>&gt;</strong> button will jump straight to <strong>Eating</strong>.</p><p>To select camping activities, drag and drop your actor from the actor list onto an activity tile. Actors that do not fulfill the minimum proficiency requirements can't select the activity. You can disable this behavior in the settings.</p><p>Most of the existing activities are hidden and can be enabled in <strong>Activities</strong> in the sheet's settings.</p><p>After an activity result has been chosen, its effects are automatically applied to PCs. For this reason you want to complete actions like <strong>Tell Campfire Story</strong> before performing other activities. You can also quickly choose a different result. The previous effects will be removed if necessary, new ones will be applied immediately.</p><p>Some actions like Amiri's <strong>Enhance Weapons</strong> only apply to combat and can't be easily applied to PCs. The will be posted to chat if a random encounter happens during rest.</p><p>If you want to simulate companions taking their actions while in camp, you can enable their activities in the settings to prevent cluttering the activity section. Toggled activities will always be enabled and filtered from the activity selection section.</p><h3>Eating</h3><p>Each character in camp is available in the <strong>Eating</strong> section where you can choose their food for the day. To select a meal, simply drag and drop your actor from the top actor list onto a meal. It will remove the actor from whatever meal was chosen before.</p><p><strong>Favorite Meal</strong>s are configured in the sheet's settings menu. Only actors owned by each PC will be available for selection, but keep in mind that all actors listed in the popup will be updated on a save, potentially overriding saved values from other players. Ideally, no actor is owned by more than one character, but if that's the case, players will need to open the favorite meal popup one after another.</p><p><strong>Subsist</strong> is automated as a Macro: @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.0NhBWcZQf1GHp73f]{Subsist: Provisions} which will add an item called \"Provisions\" to your inventory. Those items are consumed before Rations and are removed after Resting.</p><p>Spells like @UUID[Compendium.pf2e.spells-srd.Item.Mt6ZzkVX8Q4xigFq] or other features that create rations can be handled by running the @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.7MrkVVB6D6UrdtA1] Macro. This macro adds a set number of <strong>Provisions</strong> to the party actor. If you want to automate this, you can set a minimum subsistence in the settings which is added after resting.</p><p>If a PC has chosen the <strong>Cook Meal</strong> activity and <strong>Prepare Campsite</strong> wasn't a Critical Failure, you will be able to perform the check by clicking on the roll button; otherwise the form elements are disabled. Rolling a check will automatically fill in the degree of success and post the buttons to consume ingredients and apply effects to chat. Contrary to camping activities, meal effects are not automatically synced to PCs, because they persist beyond your camping session and because they can stack. For example: you could suffer the Critical Failure from <strong>Discover Special Meal</strong> and then consume a <strong>Basic Meal</strong>.</p><p>The total amount of all carried ingredients and the total amount of consumed ingredients for uncooked recipes (recipes without a result) is listed to the right. There is no automation in place to prevent you from consuming more ingredients than you carry.</p><h3>Resting</h3><p>Rest duration is affected by the following parameters:</p><ul><li>Number of all actors in camp that are enabled in the watch rest settings, plus</li><li><strong>Increase actors keeping watch</strong> rest setting, plus</li><li>1 if <strong>Organize Watch</strong> was a Critical Success, plus</li><li><strong>Fish-on-a-Stick</strong> rest duration effects</li><li><strong>Guns To Clean</strong> setting (affects Daily Preparations)</li></ul><p>You can start a rest by hitting the <strong>Begin Rest</strong> button.</p><p>If you've set a playlist it will be played. If you want to play it only once, then set the <strong>Playback Mode</strong> to <strong>Soundboard Only</strong>.</p><p>By default, one random encounter will be rolled automatically during rest. This can be changed to one every 4 hours (RAW) or none in the sheet's settings. If an encounter occurs, a random point in time between now and the end of the rest will be chosen and time will automatically advance to that point in time. Afterward, a random camping character who is not marked to <strong>Skip Watch</strong> in the sheet's settings will prompt you for a secret Perception check. All companion activities that impose effects on enemies or allies will be published to chat</p><p>Once you finish the random encounter, you can continue the rest by pressing <strong>Continue</strong>. No more random encounters will happen. Time will advance to after your daily preparations.</p><p>Then the following things happen:</p><ul><li>All camping effects will be removed</li><li>All meal effects that expire after resting will be removed</li><li>All damaging or healing meal effects will be rolled and, if possible, applied automatically</li><li>The <strong>Rest for the Night</strong> macro will be executed for all actors in the sidebar</li><li>Additional healing received from <strong>Basic Meal</strong> and <strong>Healers's Blessing</strong> will be applied as will <strong>Shepherd's Pie</strong>'s halving on a critical failure. Doubling and halving healing will cancel out, regardless of how many effects would apply.</li><li>All <strong>Provisions</strong> items will be removed</li><li>All camping activity results are reset to <strong>-</strong></li><li>The <strong>Adventuring</strong> tracker will be reset</li></ul><h2>Automation Notes</h2><p>Meal effects and consumables such as rations are tracked by their name, so <strong>if you rename Rations, ingredients or effects, tracking will be broken</strong>. Compared to RAW, the following rules are not automated:</p><h3>General</h3><ul><li>The encounter DC modifier is not being increased/decreased/reset automatically. Many people have issues with frequency and likelihood of random encounter checks, so we leave this up to the GM.</li><li>For a similar reason, time is not advanced automatically when performing camping activities</li><li>The rules mention that each PC can take exploration actions as desired during Prepare Campsite and Camping Activities. Since these are GM fiat, they aren't implemented on the sheet. Simply open the character sheet and roll the checks manually, choosing the appropriate modifiers</li><li>Fatigued is not applied automatically since automating would more than likely be annoying and there are too many feats and meals to keep track of that change the duration to become fatigued.</li></ul><h3>Camping Activities</h3><ul><li><strong>Camp Management</strong>: There is no concept of sequential activities</li><li><strong>Cook</strong>: RAW, each meal is prepared by a separate cook and ingredients are expended before rolling the check. Currently, only one cook is supported who cooks all of the meals after camping activities are done</li><li><strong>Relax</strong>: Depends on sequential activities and, since this action can be taken by everyone and depends on the order, only a <strong>Relaxed</strong> camping effect is available in the Camping Effects compendium. If you wish to, you can create a custom activity for each PC and give it the Effect UUIDs of @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.QvR2yvuIVQuztCwQ]{Relaxed}, @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-camping-effects.Item.zliIP2agG0TVwKV4]{Relaxed (+1 to next campig check)} and Effect Target <strong>Self</strong> which handles all of the automation</li><li><strong>Provide Aid</strong>: Roll this one as a separate check from your character sheet and apply the circumstance bonus for the roll separately</li><li><strong>Exploration Activities</strong>: Activities that can be taken by more than one PC such as Exploration Activities are not supported since they require a different way of tracking time and have no clear way of automating them. You can execute these directly from your PC's sheet instead</li></ul><h3>Eating</h3><ul><li>Starvation &amp; Fatigue are not tracked</li></ul><h3>Meals</h3><ul><li><p>All meals are automated as much as possible but you will need to manually take care of:</p><ul><li><p><strong>Reducing Conditions</strong>: Can not be done automatically because it is not 100% clear whether you are even allowed to reduce a condition. For instance Encumbered adds the Clumsy 1 condition but reducing it after consuming a meal is almost certainly wrong. The same applies for Curses.</p></li><li><p><strong>Apply damage</strong>: There are no 2e system APIs that allow you to deal damage without a token</p></li></ul></li><li><p>The following traits are lacking from their effects because the 2e system does not support traits on effects. These are important for spells and items that remove conditions limited to these traits such as @UUID[Compendium.pf2e.spells-srd.Item.SUKaxVZW2TlM8lu0]{Cleanse Affliction}:</p><ul><li><p><span style=\"font-family:Signika, sans-serif\"><strong>Poison</strong>:</span></p><ul><li><p><span style=\"font-family:Signika, sans-serif\">Baked Spider (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Broiled Tuskwater (Oysters Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Grilled Silver Eel (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Haggis (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Hearty Purple Soup (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Mastodon Steak (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Onion Soup (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Omelet (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Seasoned Wings And Thighs (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Smoked Trout And Hydra Pate (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Succulent Sausages (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Sweet Pancakes (Critical Failure)</span></p></li></ul></li><li><p><span style=\"font-family:Signika, sans-serif\"><strong>Curse</strong>:</span></p><ul><li><p><span style=\"font-family:Signika, sans-serif\">Black Linnorm Stew: (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Supernatural Mince Pie: (Critical Failure)</span></p></li><li><p><span style=\"font-family:Signika, sans-serif\">Rice-N-Nut Pudding: (Critical Failure)</span></p></li></ul></li></ul></li></ul>"
                }
            }
        },
        "Upgrading Notices": {
            "name": "Upgrading Notices",
            "pages": {
                "Upgrading from versions prior to 2.0": {
                    "name": "Upgrading from versions prior to 2.0",
                    "text": "<p>This version marks a departure from Paizo's CUP to pure OGL and includes a complete overhaul of the camping sheet. <strong>Some changes require manual intervention</strong></p><h2>Manual Migration Steps</h2><p>You will need to migrate somet things manually, namely:</p><ul><li><p>Disable companion kingdom activities if needed</p></li><li><p>Enable additional uses for Magic in the sheet settings if needed</p></li><li><p>Rename regions from <strong>Zone XX</strong> to their Paizo IP equivalent in the Camping Sheet region config</p></li><li><p>Manually configure any previously overridden region playlists in the region config</p></li></ul><h2>Removal of CUP Content</h2><p>I was already overhauling the camping sheet when Paizo announced the <a href=\"https://paizo.com/community/blog/v5748dyo6vh12?New-and-Revised-Licenses\">removal of the CUP license back in July 2024</a> (which was later reversed). Since I've been wanting to resolve licensing issues when combining CUP and AGPL content for quite a while now, this was a perfect opportunity to go OGL only.</p><p>This required me to scrub any mention of Paizo IP from the module, including the module name itself, which is now <strong>Kingdom Building, Camping &amp; Weather. </strong>This should also clear up confusion that I've seen many times about whether you need to the official or unofficial module<strong>.</strong></p><p>In almost all instances, functionality was kept intact by simply renaming offending content. However, there are 2 exceptions to this:</p><ul><li><p>I do not ship companion actor statblocks anymore that weren't previously included. This was more of a maintability issue since the core system changes frequently and automation is not automatically migrated most of the time. Also, the Remaster didn't help</p></li><li><p>The Kingdom Sheet lost automation for appointing companions as leaders. Previously, the sheet automatically toggled the invested checkbox and enabled their features and activities when they were placed in the correct slot. This required override toggles in the settings to undo automation. It was a choice between keeping the old system and renaming the companions (e.g. Cleric Companion 1, Cleric Companion 2) or streamlining it. Now, everything works the same: you need to manually toggle the invested checkbox and enable companion activities like every other disabled activity</p></li><li><p>The Camping Sheet no longer ships Influence/Discover activities for each companion due to similar issues. I don't think <strong>Influence Cleric 1</strong> would have been a paritularly useful thing.</p></li></ul><h3>Kingdom Sheet</h3><ul><li><p>There is no special automation for appointing compansions as leaders anymore. Instead, you whitelist their activities like all other activities under the <strong>Manage Activities</strong> button in the <strong>Turn</strong> tab. You will need to manually toggle the <strong>Invested</strong> checkbox. Some companions provide benefits that need to be enabled in the settings instead. You might need to enable/disable their companion activities or invested flags after upgrading</p></li><li><p>Some activities have been renamed (the temple and lily leadership activities) and might need to be manually disabled/enabled</p></li><li><p>Mentions of Paizo IP in Kingdom Events and Kingdom Activities have been removed or reworded</p></li></ul><h3>Camping Sheet</h3><ul><li><p>Region names are Paizo IP so you will need to configure all Region names manually in the camping region settings. If you have the official module enabled, Combat Tracks &amp; Roll Tables will be prefilled.</p></li><li><p>Some Recipes mentioned Paizo IP. Most of them have been simplified by simply removing the offending name. The following recipes were changed:</p><ul><li><p>Broiled Oysters</p></li><li><p>Supernatural Mince Pie</p></li><li><p>Ragout</p></li><li><p>Giant Scrambled Egg</p></li><li><p>Berry Pie</p></li><li><p>Oysters</p></li><li><p>Omelet</p></li></ul></li><li><p>All Influence and Discover activities have been removed. However, you can now configure a DC per Skill when adding custom camping activities, allowing you to fully stat out the entire array of Influence/Discover checks</p></li></ul><h3>Journal Entries</h3><ul><li><p>Many entries were removed since they were duplicated in the sheets anyways and removing Paizo IP was work intensive</p></li></ul><h2>Tokens</h2><ul><li><p>All GMG NPC mappings have been removed to prepare for the arrival of NPC Core. Imported actors should continue to work, but there will be no image when browsing the Compendium Browser</p></li></ul><h2>New Feature: Camping Sheet Overhaul</h2><ul><li><p>When a new camping sheet is created, it automatically makes all players owners of the sheet to avoid permission issues and displays a quickstart manual to get you going</p></li><li><p>The sheet now calculates Hexploration Activities and allows you to advance or retract a single activity. You can set a minimum speed in the sheet's settings to mimic travel using horses.</p></li><li><p>Camp locations can now be tracked on a hex map. Choose a Hexploration Scene in settings to enable it. The party token position on the map is persisted after Prepare Campsite and will ask you to reuse an existing camp (if one exists). This uses a naive implementation of simply checking token coordinates changing the hex grid will require you to clear existing positions.</p></li><li><p>You can now configure all regions, including their combat tracks and types. New terrain types like Urban and Dungeon have been added to allow you to use the sheet in non hexploration campaigns as well</p></li><li><p>You can now configure the climate in the module settings, allowing you to set custom weather for each month</p></li><li><p>Combat Tracks can now reference a track in addition to a playlists</p></li><li><p>All combat tracks are now configured solely in the Camping Sheet. You don't need to create tracks with special names anymore and existing region tracks are ignored.</p></li><li><p>Companion activities that don't require a check can now be toggled in the camping sheet. This helps keeping the sheet clean and performant if you want to simulate travel with all companions</p></li><li><p>All recipes have been automated as much as possible. The only thing that was not possible to automate was applying damage (no 2e system APIs for that) and the reduction of conditions because those depend on context (e.g. can't reduce Clumsy when Encumbered or conditions from curses). This will post messages and damage to chat to apply them manually</p></li><li><p>Each PC can now choose more than one meal (RAW) but there is still only one designated cook as opposed to RAW.</p></li><li><p>Meal effects are now removed when preparing camp (RAW)</p></li><li><p>Subsist is now fully automated as a macro @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.0NhBWcZQf1GHp73f]{Subsist: Provisions}. This macro adds <strong>Privisions</strong> items to an actor's inventory which get consumed before rations and is removed after resting</p></li><li><p>Similarly, there is now a @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-macros.Macro.7MrkVVB6D6UrdtA1]{Create Food} macro that adds Provisions to the party actor. Use this to automate spells such as @UUID[Compendium.pf2e.spells-srd.Item.Mt6ZzkVX8Q4xigFq]{Create Food}. You can also set a minimum subsistence in the settings to automatically gain this amount after resting.</p></li><li><p>Changing the degree of success dropdown for activities as well as recipes posts all associated messages to chat now</p></li></ul>"
                },
                "Upgrading from versions prior to 3.0": {
                    "name": "Upgrading from versions prior to 3.0",
                    "text": "<p>The 3.0 release partially supports V&amp;K 1.1. rules and required some changes to settings and to how leaders are handled in a kingdom sheet:</p><ul><li><p>All Kingdom Leaders must now link to an NPC or Character actor; a best effort migration is in place which tries to find an NPC or Character actor by name. This might not work if your leaders don't have actors or if the names don't line up perfectly; to change existing leaders, simply drag and drop an actor from the sideebar onto the leader position in the sheet</p></li><li><p>Kingdom settings are now local to your kingdom sheet. This means that if you are running multiple instances, changes won't propagate to other sheets anymore</p></li><li><p>Roll Table UUIDs are now used for kingdom and cult events. This means that roll table names are not required to be unique anymore</p></li></ul>"
                }
            }
        },
        "Weather Events": {
            "name": "Weather Events",
            "pages": {
                "Blizzard (Hazard 6)": {
                    "name": "Blizzard (Hazard 6)",
                    "text": "<p><strong>Survival DC</strong> @Check[type:survival|dc:25|traits:secret] (expert)</p><p><strong>Requirements</strong> A blizzard can occur only during winter.</p><p><strong>Description</strong> A combination of heavy snowfall and wind reduces visibility and temperature significantly.</p><p><strong>Prepare</strong> @Check[type:survival|dc:21] (trained) to notice escalations in the weather or @Check[type:nature|dc:25] (expert) to correctly interpret the behavior of local wildlife.</p><p><strong>Routine (8+ hours)</strong> For the blizzard’s duration, visibility is reduced to such an extent that @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-weather-effects.qc5NAt3xu8sumqEh]{visual Perception checks have a –4 circumstance penalty}. Windstorm conditions (page 125) apply during a blizzard, and the regional temperature drops to severe cold. Once a blizzard starts, an unsheltered character takes [[/r 2d6]] cold damage every hour. During a blizzard, a @Check[type:survival|dc:25] check is enough to find or create shelter to avoid additional cold damage from exposure, but each attempt to do so takes 1 hour.</p><p>Once a blizzard ends, travel through the zone is treated as difficult terrain for a number of days equal to the number of flat checks that were required to end the blizzard.</p><p></p>"
                },
                "Cold Snap (Hazard 1)": {
                    "name": "Cold Snap (Hazard 1)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:16|traits:secret] (trained)</p><p><strong>Requirements</strong> A cold snap can occur at any time except during the summer.</p><p><strong>Description</strong> The temperature drops noticeably, becoming unusually cold for this time of year.</p><p><strong>Prepare</strong> @Check[type:nature|dc:19] (trained) or @Check[type:survival|dc:16] (trained) to realize there’s an imminent shift in weather.</p><p><strong>Routine (24+ hours)</strong> The temperature drops down to an unusually low level. During spring and autumn, the temperature shifts to mild cold. During winter, the temperature shifts to severe cold, during which unsheltered PCs take [[/r 1d6]] cold damage per hour. If a blizzard takes place during a cold snap, the blizzard’s temperature drops to extreme cold, during which unsheltered PCs take [[/r 2d6]] cold damage every 10 minutes.</p>"
                },
                "Flash Flood (Hazard 7)": {
                    "name": "Flash Flood (Hazard 7)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:27|traits:secret] (expert)</p><p><strong>Requirements</strong> The PCs are in a hex that contains hills, mountains, or a river.</p><p><strong>Description</strong> Heavy rainfall upriver or deeper in the mountains causes a sudden rush of water to come cascading downstream or along an otherwise dry riverbed.</p><p><strong>Prepare</strong> @Check[type:survival|dc:21] (trained) to move to high ground before the flash flood hits.</p><p><strong>Routine (1+ hours)</strong> The rushing waters of the flood surge through the area with shocking speed. The PCs roll initiative with Perception or Survival checks; determine the flash flood’s initiative by rolling [[/r 1d20+17]]. On a PC’s turn, they can attempt to move out of the flood’s path. This could be as simple as taking Strides to get out of the way, or this could be complicated by having to succeed at a @Check[type:athletics|dc:25] check to climb to safety.</p><p>You can also complicate escape by having the width of the flood area be more significant, to an extent that even three Strides might not be enough to escape. On the flash flood’s turn, it attempts to Sweep Away any PCs who haven’t escaped its path. A character who is swept away can escape the flood by succeeding at a @Check[type:athletics|dc:25] check as a three-round Interact action to swim to shore or cling to an outcropping, tree, or other solid object; otherwise, the PC will continue to be Swept Away round after round.</p><p>Once the flood ends, the waters of the river left behind remain deep for several more hours or, at your discretion, even days.</p><p><strong>Sweep Away</strong> <span class=\"pf2-icon\">3</span> The flash flood sweeps away characters who haven’t escaped its path. Each character is carried 200 feet downriver (they can avoid this by succeeding at a @Check[type:athletics|dc:30] check to Swim) and takes [[/r 6d6]] bludgeoning damage (@Check[type:reflex|dc:25|basic:true]).</p>"
                },
                "Fog (Hazard 0)": {
                    "name": "Fog (Hazard 0)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:16|traits:secret]</p><p><strong>Description</strong> Thick fog rolls in to obscure the landscape.</p><p><strong>Routine (2+ hours)</strong> As long as the dense fog persists,  @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-weather-effects.fznJUkfpRn2OOcBC]{visual Perception checks have a –2 circumstance penalty}. Fog causes creatures that are further than 15 feet away to be concealed, and it limits maximum visibility to 500 feet.</p><p></p>"
                },
                "Hailstorm, Severe (Hazard 2)": {
                    "name": "Hailstorm, Severe (Hazard 2)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:18|traits:secret] (trained)</p><p><strong>Description</strong> Pellets of frozen ice rain down on the region.</p><p><strong>Prepare</strong> @Check[type:survival|dc:18] (trained) or @Check[type:perception|dc:21|traits:secret] to realize that small showers of hail that have been dropping in the region will soon give way to severe hail.</p><p><strong>Routine (1+ hours)</strong> During a severe hailstorm, periodic flurries of hail measuring an inch or more in diameter buffet the area. Any character who doesn’t have shelter during a severe hailstorm takes [[/r 2d6]] bludgeoning damage (@Check[type:reflex|dc:18|basic:true]) over the course of the hour. A severe hailstorm also limits vision in the same manner as heavy downpour (see below).</p>"
                },
                "Heavy Downpour (Hazard 0)": {
                    "name": "Heavy Downpour (Hazard 0)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:16|traits:secret]</p><p><strong>Description</strong> The clouds above darken, and a significant amount of precipitation unloads over the region.</p><p><strong>Routine (24+ hours)</strong> Rain or snow continues to fall all day, making those caught out in the elements cold and wet. As long as the heavy downpour lasts, @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-weather-effects.9xvn9jhwSpc7q44Y]{visual Perception checks take a –1 circumstance penalty}, causes creatures that are further than 100 feet away to be concealed, and cuts off all visibility at half a mile or more.</p><p>During a heavy downpour, other storms tend to be even more severe. The DC of skill checks made to survive, prepare, or endure the routine of a blizzard, severe hailstorm, supernatural storm, thunderstorm, or windstorm increase by +2 during heavy downpour. Rivers tend to rise during heavy downpours. Shallow points to cross rivers become too deep to ford and remain so for [[/r 1d4]] days after the event.</p><p></p>"
                },
                "Subsidence (Hazard 5+)": {
                    "name": "Subsidence (Hazard 5+)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:22|traits:secret] (expert)</p><p><strong>Description</strong> With little warning, the ground itself suddenly gives way, be it a caused by a small avalanche, rockslide, mudslide, or the sudden opening of a sinkhole.</p><p><strong>Prepare</strong> @Check[type:perception|dc:22|traits:secret] to take a less dangerous path through the region.</p><p><strong>Routine</strong> A subsidence has no duration. Those who aren’t prepared when it occurs attempt a @Check[type:reflex|dc:22].</p><p><strong>Critical Success</strong> The character avoids the unexpected subsidence entirely.</p><p><strong>Success</strong> The character takes [[/r 4d6]] bludgeoning damage from the subsidence.</p><p><strong>Failure</strong> The character takes [[/r 8d6]] bludgeoning damage from the subsidence. If the subsidence is a sinkhole, the character ends up at the bottom of a hole [[/r 1d6*5]] feet down and can clamber out with a successful @Check[type:athletics|dc:22]. If the subsidence is a mudslide, rockslide, or avalanche, the character is knocked prone and swept 200 feet away. </p><p><strong>Critical Failure</strong> The character takes [[/r 16d6]] bludgeoning damage from the subsidence and is buried. Buried PCs are at risk of suffocation; see page 518 of the Core Rulebook for details on how a buried creature can be rescued. </p><h2><strong>Major Subsidence (Hazard 12)</strong></h2><p><strong>Survival</strong> @Check[type:survival|dc:32|traits:secret] (expert)</p><p><strong>Description</strong> With little warning, the ground itself suddenly gives way, be it a caused by a small avalanche, rockslide, mudslide, or the sudden opening of a sinkhole.</p><p><strong>Prepare</strong> @Check[type:perception|dc:32|traits:secret] to take a less dangerous path through the region.</p><p><strong>Routine</strong> A subsidence has no duration. Those who aren’t prepared when it occurs attempt a @Check[type:reflex|dc:32].</p><p><strong>Critical Success</strong> The character avoids the unexpected subsidence entirely.</p><p><strong>Success</strong> The character takes [[/r 8d6]] bludgeoning damage from the subsidence.</p><p><strong>Failure</strong> The character takes [[/r 16d6]] bludgeoning damage from the subsidence. If the subsidence is a sinkhole, the character ends up at the bottom of a hole [[/r 1d6*5]] feet down and can clamber out with a successful @Check[type:athletics|dc:32]. If the subsidence is a mudslide, rockslide, or avalanche, the character is knocked prone and swept 200 feet away. </p><p><strong>Critical Failure</strong> The character takes [[/r 32d6]] bludgeoning damage from the subsidence and is buried. Buried PCs are at risk of suffocation; see page 518 of the Core Rulebook for details on how a buried creature can be rescued. </p>"
                },
                "Supernatural Storm (Hazard 6+)": {
                    "name": "Supernatural Storm (Hazard 6+)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:25|traits:secret] (expert)</p><p><strong>Description</strong> What starts out as a heavy downpour or a windstorm takes a turn for the outlandish, as something strange begins raining down from the heavens above: bolts of fire, acid rain, or even something like a rain of frogs or shards of stained glass.</p><p><strong>Prepare</strong> @Check[type:nature|dc:25] (trained) or @Check[type:survival|dc:25] (trained) to find shelter in the region.</p><p><strong>Routine (1+ hours)</strong> When they occur, characters who aren’t in shelter take [[/r 4d8+18]] points of damage each hour (@Check[type:reflex|dc:25|basic:true]). The type of damage depends on the type of storm, as chosen by you. For example, acid rain would cause acid damage, while a rain of frogs would cause bludgeoning damage.</p><p><strong>Escalated Storm (Level +1)</strong> Supernatural storms can scale upward in level as you need to continue challenging the PCs. <a href=\"https://2e.aonprd.com/Rules.aspx?ID=1049\">Use the tables for building hazards on pages 75–76 of the Pathfinder Gamemastery Guide to set the escalated storm’s DCs</a>—it uses the high DCs for Survival and Prepare from Table 2–13 on page 75 of that book, and the damage value is the Simple Dmg value from Table 2–16 on page 76.</p>"
                },
                "Thunderstorm (Hazard 7+)": {
                    "name": "Thunderstorm (Hazard 7+)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:27|traits:secret] (expert)</p><p><strong>Description</strong> Dark clouds announce their arrival with distant peals of thunder and flashes of lightning.</p><p><strong>Prepare</strong> @Check[type:survival|dc:23] (trained) to minimize chances of being struck by lightning.</p><p><strong>Routine (8+ hours)</strong> A thunderstorm functions as a heavy downpour (page 123) during its duration, but with the added danger of being struck by lightning. If the PCs prepare for a thunderstorm, they can avoid lightning strikes and still travel by taking the Defend exploration activity (taking care to move carefully, staying low, and avoiding trees and the like rather than raising shields).</p><p>A PC who travels without taking this activity or doesn’t seek shelter must attempt a @Check[type:flat|dc:6|showDC:all] each hour; on a failure, that PC is struck by lightning and takes [[/r 8d8]] electricity damage (@Check[type:reflex|dc:25|basic:true]).</p><h2>Thunderstorm (Hazard 13)</h2><p><strong>Survival</strong> @Check[type:survival|dc:37|traits:secret] (expert)</p><p><strong>Description</strong> Dark clouds announce their arrival with distant peals of thunder and flashes of lightning.</p><p><strong>Prepare</strong> @Check[type:survival|dc:32] (trained) to minimize chances of being struck by lightning.</p><p><strong>Routine (8+ hours)</strong> A thunderstorm functions as a heavy downpour (page 123) during its duration, but with the added danger of being struck by lightning. If the PCs prepare for a thunderstorm, they can avoid lightning strikes and still travel by taking the Defend exploration activity (taking care to move carefully, staying low, and avoiding trees and the like rather than raising shields).</p><p>A PC who travels without taking this activity or doesn’t seek shelter must attempt a @Check[type:flat|dc:10] [[/r 1d4]] times each hour; on a failure, that PC is struck by lightning and takes [[/r 14d8]] electricity damage (@Check[type:reflex|dc:33|basic:true]).</p>"
                },
                "Tornado (Hazard 12+)": {
                    "name": "Tornado (Hazard 12+)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:27|traits:secret] (expert)</p><p><strong>Requirements</strong> The PCs are in a hex that contains no significant hills or mountains.</p><p><strong>Description</strong> Strangely colored or ominously shaped clouds often presage the arrival of a distinctive funnel cloud’s arrival in the region.</p><p><strong>Prepare</strong> @Check[type:survival|dc:35] (master) to know how best to prepare for the tornado if no existing shelters are available.</p><p><strong>Routine (1+ hours)</strong> When a tornado touches down, the funnel cloud can wreak amazing damage. While the area affected by a tornado is relatively limited, predicting where the tornado will travel during its brief, destructive lifetime is difficult. Underground chambers can provide shelter from tornadoes, but characters who seek shelter above ground are still in danger. Each hour that a tornado persists in the area, attempt a @Check[type:flat|dc:16] (for each PC sheltering above ground) or a @Check[type:flat|dc:6] (for each PC who isn’t sheltered at all). On a success, that PC is exposed to the tornado’s winds or its hurled debris and must attempt a @Check[type:reflex|dc:32].</p><p><strong>Critical Success</strong> The character avoids the tornado and its debris.</p><p><strong>Success</strong> The character takes [[/r 4d6]] bludgeoning and [[/r 4d6]] piercing damage from hurled debris, but they avoid further damage from that particular tornado for the remainder of the hour.</p><p><strong>Failure</strong> The character takes [[/r 8d6]] bludgeoning and [[/r 8d6]] piercing damage from hurled debris, and they must save against the tornado’s effects again on the following round.</p><p><strong>Critical Failure</strong> As failure, but the character is also lifted into the air and hurled 120 feet in a random direction, taking an additional [[/r 60]] points of bludgeoning damage from the fall.</p><h2>Tornado Swarm (Hazard 17)</h2><p><strong>Survival</strong> @Check[type:survival|dc:34|traits:secret] (expert)</p><p><strong>Requirements</strong> The PCs are in a hex that contains no significant hills or mountains.</p><p><strong>Description</strong> Strangely colored or ominously shaped clouds often presage the arrival of a distinctive funnel cloud’s arrival in the region.</p><p><strong>Prepare</strong> @Check[type:survival|dc:43] (master) to know how best to prepare for the tornado if no existing shelters are available.</p><p><strong>Routine (1+ hours)</strong> When a tornado touches down, the funnel cloud can wreak amazing damage. While the area affected by a tornado is relatively limited, predicting where the tornado will travel during its brief, destructive lifetime is difficult. Underground chambers can provide shelter from tornadoes, but characters who seek shelter above ground are still in danger. Each hour that a tornado persists in the area, attempt 4 @Check[type:flat|dc:16] (for each PC sheltering above ground) or 4 @Check[type:flat|dc:6] (for each PC who isn’t sheltered at all). On a success, that PC is exposed to the tornado’s winds or its hurled debris and must attempt a @Check[type:reflex|dc:38].</p><p><strong>Critical Success</strong> The character avoids the tornado and its debris.</p><p><strong>Success</strong> The character takes [[/r 4d6]] bludgeoning and [[/r 4d6]] piercing damage from hurled debris, but they avoid further damage from that particular tornado for the remainder of the hour.</p><p><strong>Failure</strong> The character takes [[/r 8d6]] bludgeoning and [[/r 8d6]] piercing damage from hurled debris, and they must save against the tornado’s effects again on the following round.</p><p><strong>Critical Failure</strong> As failure, but the character is also lifted into the air and hurled 120 feet in a random direction, taking an additional [[/r 60]] points of bludgeoning damage from the fall.</p>"
                },
                "Wildfire (Hazard 4+)": {
                    "name": "Wildfire (Hazard 4+)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:22|traits:secret] (trained)</p><p><strong>Description</strong> A fire spreads through the region, be it one accidentally started by a poorly maintained campfire, deliberate arson, a lightning strike, or from a supernatural source like a creature’s fiery breath or a fire spell being cast by a bandit in the region. Wildfires cannot  occur during heavy downpours or blizzards, and if such an event starts in the area, it brings an existing wildfire to an end.</p><p><strong>Prepare</strong> @Check[type:survival|dc:18] (trained) or @Check[type:perception|dc:25|traits:secret] to notice plumes of smoke or the tang of smoke in the air.</p><p><strong>Routine (1+ hour)</strong> An unsheltered character must succeed at a @Check[type:reflex|dc:21] or take [[/r 6d6]] fire damage ([[/r 12d6]] fire damage on a critical failure). If the character has sheltered in a temporary shelter or a flammable building, attempt a @Check[type:flat|dc:16] each hour the fire  persists; on a failure, the fire consumes the shelter.</p><h2>Severe Wildfire (Hazard 10)</h2><p><strong>Survival</strong> @Check[type:survival|dc:22|traits:secret] (trained)</p><p><strong>Description</strong> A fire spreads through the region, be it one accidentally started by a poorly maintained campfire, deliberate arson, a lightning strike, or from a supernatural source like a creature’s fiery breath or a fire spell being cast by a bandit in the region. Wildfires cannot  occur during heavy downpours or blizzards, and if such an event starts in the area, it brings an existing wildfire to an end.</p><p><strong>Prepare</strong> @Check[type:survival|dc:18] (trained) or @Check[type:perception|dc:25|traits:secret] to notice plumes of smoke or the tang of smoke in the air.</p><p><strong>Routine (8+ hour)</strong> An unsheltered character must succeed at a @Check[type:reflex|dc:29] or take [[/r 12d6]] fire damage ([[/r 24d6]] fire damage on a critical failure). If the character has sheltered in a temporary shelter or a flammable building, attempt a @Check[type:flat|dc:11] each hour the fire  persists; on a failure, the fire consumes the shelter.</p><p>The heavy smoke in the area is thick enough to function as @UUID[Compendium.pf2e-kingmaker-tools.kingmaker-tools-weather-effects.fznJUkfpRn2OOcBC]{Fog} (page 123).</p>"
                },
                "Windstorm (Hazard 1)": {
                    "name": "Windstorm (Hazard 1)",
                    "text": "<p><strong>Survival</strong> @Check[type:survival|dc:19|traits:secret] (expert)</p><p><strong>Description</strong> High winds wreak havoc and disrupt travel, and they may even cause damage as trees or other objects are blown over.</p><p><strong>Prepare</strong> @Check[type:nature|dc:19] (expert) or @Check[type:survival|dc:16] to know how and where to find shelter from the upcoming storm. </p><p><strong>Routine (24+ hours)</strong> As long as the windstorm persists, the effects of wind on movement (page 517 of the Core Rulebook) are in effect. Overland travel in a windstorm is treated as if moving through difficult terrain. Once every 8 hours, attempt a @Check[type:flat|dc:18]; on a success, a  randomly chosen PC who isn’t sheltered is struck by debris.</p><p><strong>Debris Strike</strong> <span class=\"pf2-icon\">1</span> The targeted PC takes [[/r 2d6]] bludgeoning damage (@Check[type:reflex|dc:16|basic:true]).</p>"
                }
            }
        }
    }
}