{
    "label": "Subclasses",
    "entries": {
        "Acuvore": {
            "name": "Acuvore",
            "description": "<p dir=\"ltr\">The process of becoming an acuvore is unnatural, even when compared to normal liches. Aberrations are inherently creatures that defy the natural order, and for one to become a lich only makes it stranger. Acuvores feed off of psychic energy, typically feasting on the minds of any creature it can get its hands on. In exchange, however, their psychic potential skyrockets as they absorb the minds of more and more creatures. A well-fed acuvore may very well be one of the most psychically potent creatures within reality, much to the chagrin of anything remotely nearby.</p>\n<p dir=\"ltr\">The wake of an acuvore is truly horrifying to behold; their ability to feed on minds works not only on the living, but on the dead as well. Such an effect they have on the minds of those they consume that they damage the very soul itself, with priests under Pharasma claiming that the souls of those they consume arrive in the Boneyard entirely bereft of consciousness, little more than raw soul debris and incapable of being judged. It is for this reason that the Church of Pharasma seeks the immediate destruction of any acuvores once they are discovered, being abominations to the cycle of life and death a cut above. All the while, acuvores will keep an ever-growing horde of mindless undead under their thrall; the equivalent of table scraps from previous meals, while still-thinking companions remain closer to emergency rations.</p>\n<p dir=\"ltr\"><strong>Prerequisites</strong> aberration trait; Focus Pool</p>\n<p dir=\"ltr\"><strong>Reason </strong>To improve your psychic potential while avoiding the weakness of old age and death</p>\n<p dir=\"ltr\"><strong>Spell Tradition </strong>Arcane, Occult</p>\n<p dir=\"ltr\"><strong>Sacrifice </strong>The brain of a psychically potent creature, which you eat during the ritual</p>\n<p dir=\"ltr\"><strong>Ending Means </strong>Ritualistic decapitation; overwhelming your psychic powers to the point of brain death</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong>The cognition of souls</p>\n<p dir=\"ltr\"><strong>Soul Cage </strong>@UUID[Compendium.pf2e-heresy-of-the-whispering-way.equipment.Item.v826Iow1pH7xEqo6]{Soul Cage}</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.OsOhx3TGIZ7AhD0P]{Dominate}</p>\n<p dir=\"ltr\"><strong>Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.fI20AVwOzJMHXRdo]{Levitate}, @UUID[Compendium.pf2e.spells-srd.Item.LiGbewa9pO0yjbsY]{Confusion}, @UUID[Compendium.pf2e.spells-srd.Item.FhOaQDTSnsY7tiam]{Rewrite Memory}</p>"
        },
        "Archlich": {
            "name": "Archlich",
            "description": "<p dir=\"ltr\">The archlich is one of the rarest forms of lich, created from a spellcaster wholly devoting themself to a purpose for all eternity. The techniques to become one are exceedingly rare, often only passed down by other archliches, but the results speak for themselves. Archliches are barely altered mentally by the transformation, the normally corrupting power being nearly absent. As such, wizards aligned to the forces of good and law are the most common aspirants for archlichdom.</p>\n<p dir=\"ltr\">However, every path has its price, and for the short-sighted or self-centered mage it may appear foolish. The process of becoming an archlich drains one of their magic power, and even after weakens them magically for decades or even centuries. Additionally, the ritual process is lengthy, often taking weeks or months of painful wasting which tests the minds of even the strongest-willed spellcasters. Those whose ambitions or egos are too lofty may find the price too hefty to bear as they are laid low and made to suffer personally for their ascension.</p>\n<p dir=\"ltr\"><strong>Prerequisites</strong> Master in Necromancy Lore</p>\n<p dir=\"ltr\"><strong>Reason</strong> To devote oneself to a greater purpose for eternity</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Arcane, Divine, Occult, Primal</p>\n<p dir=\"ltr\"><strong>Sacrifice</strong> Your magical ability. Upon performing the ritual, you expend all of your remaining spell slots, and cannot regain them for the next week. Unlike other paths, this is the only sacrifice that can be made to become an archlich–without it, you become a True Lich instead.</p>\n<p dir=\"ltr\"><strong>Ending Means</strong> Starvation; 5 days, at the beginning of each you remove one of your senses, before finally imbibing poison; self-mummification</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong>Fulfillment of their goal; an archlich that has completed a goal may select a new one, but such are the goals of archliches that this rarely happens.</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> Archliches, unlike most liches, do not use a traditional soul cage; instead, they transform a regular magic item into one such as a staff or spellbook. Many believe this to be for practical purposes, but in reality it serves a greater purpose–as an anchor not only for their soul, but their mind. Without it, an archlich often begins to lose connection with their past self, often becoming no different from any other lich. Instead of a normal soul cage, select a single magical item that you own. That item becomes your @UUID[Compendium.pf2e-heresy-of-the-whispering-way.equipment.Item.v826Iow1pH7xEqo6]{Soul Cage}, and gains all of the properties of a soul cage item once the ritual is complete. Its Hardness and HP increase to 9 and 36 respectively if they were lower. If you are ever more than one mile from this item, you are treated as if your soul is uncaged until it is within one mile of you once more.</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.TjWHgXqPv5jywMti]{Pocket Library}</p>\n<p dir=\"ltr\"><strong>Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.ZYoC630tNGutgbE0]{Hypercognition}, @UUID[Compendium.pf2e.spells-srd.Item.JOdOpbPDl7nqvJUm]{Dispelling Globe}, @UUID[Compendium.pf2e.spells-srd.Item.HqTI6wRrck1YXp3F]{Telepathy}, @UUID[Compendium.pf2e.spells-srd.Item.9HpwDN4MYQJnW0LG]{Dispel Magic}, @UUID[Compendium.pf2e.spells-srd.Item.VlNcjmYyu95vOUe8]{Translocate}</p>"
        },
        "Astral Echo": {
            "name": "Astral Echo",
            "description": "<p dir=\"ltr\">Borne of a powerful psychic, astral echo liches are created by imprinting itself into the Astral Plane. Those that become an astral echo eschew their inner life for fame and accomplishment, becoming beings of pure story. In doing so, they become powerful psychic beings that thrive in the limelight, expanding their legend for as long as they can remain alive. This legend is their soul cage, and so long as it remains within the Astral Plane the lich can continue to return.</p>\n<p dir=\"ltr\">Astral Echos are often exceptionally narcissistic, to the point that their greatest moments appear as echoes around them, showcasing their greatest triumphs. This can lead to arrogance, certainly, but do not mistake an astral echo for a fool. Their very life depends on an ever-winding tale of their triumphs, so they will happily take the long road if it makes a better story.</p>\n<p dir=\"ltr\"><strong>Prerequisites</strong> Expert in Performance</p>\n<p dir=\"ltr\"><strong>Reason</strong> To become one with your immortal story, becoming a living legend</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Occult</p>\n<p dir=\"ltr\"><strong>Sacrifice</strong> Nuances of your personality which wouldn’t be visible to an outside observer</p>\n<p dir=\"ltr\"><strong>Ending Means </strong>Die in a psychic duel; destroy yourself with potent psychic magic; die in a blaze of glory</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong>Recognition</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> Instead of a standard soul cage, you create an @UUID[Compendium.pf2e-heresy-of-the-whispering-way.equipment.Item.l0JUirZuK6ewVAze]{Astral Memoir}, a psychically resonant book which holds your personal legend.</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.BazbvgNmK46XjrVc]{Word of Revision}</p>\n<p dir=\"ltr\"><strong>Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.A2JfEKe6BZcTG1S8]{Fly}, @UUID[Compendium.pf2e.spells-srd.Item.i7u6gAdNcyIyyo3h]{Favorable Review}, @UUID[Compendium.pf2e.spells-srd.Item.FhOaQDTSnsY7tiam]{Rewrite Memory}</p>"
        },
        "Death Observation Methodology": {
            "name": "Death Observation Methodology",
            "description": "<p>Your methodology learns from the dead; not in the way of a forensic scientist, but in the way of a necromancer. Prying knowledge from ghosts, acting out circumstances with the deceased, and breaching into sealed tombs all fall under your purview as you learn about incidents from those most intimately aware.</p>\n<p>You are trained in Occultism and Necromancy Lore, and gain the @UUID[Compendium.pf2e.feats-srd.Item.fvYwsHM9O1twQa5N]{Consult The Spirits} skill feat, selecting Occultism. Once per day, you can cast @UUID[Compendium.pf2e.spells-srd.Item.9WGeBwIIbbUuWKq0]{Summon Undead} as an occult innate spell. The spell is heightened to half your level, rounded up, to a maximum of 9th level, and can be sustained for up to one hour instead of one minute. Starting at 9th level, you can do this one additional time per day.</p>"
        },
        "Dirge": {
            "name": "Dirge",
            "description": "<p>Your muse is connected to death, inspiring you to remember those lost yet long remembered. If it’s a creature, it might be a psychopomp or powerful undead; if it’s a deity, it may be Pharasma or Urgathoa. As a bard with a dirge muse, your songs cause the dead to wake and move at your command.</p>\n<p>As a bard with the dirge muse, your music influences the dead, allowing you to call them to aid or bring them to rest.</p>\n<p><strong>Muse Feat</strong> @UUID[Compendium.pf2e-heresy-of-the-whispering-way.feats.Item.rIxNKB8n2CjIBVIC]{Danse Macabre}</p>\n<p><strong>Muse Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.9WGeBwIIbbUuWKq0]{Summon Undead}</p>"
        },
        "Grave Whisper": {
            "name": "Grave Whisper",
            "description": "<p>You met your patron at the brink of death; your death, that is. They saw promise in you, and whispered a secret into your ear you will not soon forget. Perhaps they were a true member of the Whispering Way, a lich hidden among the populus, or a forgotten undead awoken from its grave–what you learned, however, you will not soon forget.</p>\n<p><strong>Spell List</strong> arcane</p>\n<p><strong>Patron Skill</strong> Arcana</p>\n<p><strong>Lesson of Whispering</strong> Your patron has taught you the weaknesses of life, as well as the benefits of undeath. You gain the @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.Czf4c0nVrFjEGuv6]{Bolster Undead} hex, and your familiar learns @UUID[Compendium.pf2e.spells-srd.Item.9WGeBwIIbbUuWKq0]{Summon Undead}.</p>\n<p><strong>Familiar of Walking Graves</strong> Your familiar is ratty in appearance, as if it were only partially alive. When you Cast or Sustain a hex, one creature within 15 feet of your familiar gets your choice of either a +1 status bonus to Fortitude saves or a -1 status penalty to Fortitude saves until the start of your next turn. When this happens, you may also cause a small or medium humanoid corpse to emerge from the earth in a location within 5 feet of your familiar. The GM chooses if this takes the form of a generic corpse of a creature that died long ago, or a more specific corpse in the local area.</p>"
        },
        "Horde Lich": {
            "name": "Horde Lich",
            "description": "<p dir=\"ltr\">Horde liches are often made of those who find their attention divided, pursuing multiple ends but unable to engage in all equally. By becoming a horde lich, you can grant attention to all of these, spreading your consciousness across your bound undead companions so you may research, rule, adventure, and many other things all at once. While the pressure of combat may cause your control to waver over multiple bodies, a horde lich excels when allowed to divide tasks among their many new selves.</p>\n<p dir=\"ltr\"><strong>Prerequisites</strong> expert in Crafting and Necromancy Lore; three mindless mature undead companions </p>\n<p dir=\"ltr\"><strong>Reason</strong> To become an eternal many, so you may perform many tasks at once.</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Arcane, Primal</p>\n<p dir=\"ltr\"><strong>Sacrifice</strong> A close companion or friend who is wholly dependent on you. Important objects, such as a relic you must protect or an important structure you must defend are acceptable substitutes. Party members rarely function for this, as most can function independently (though can suffice if their player agrees).</p>\n<p dir=\"ltr\"><strong>Ending Means</strong> Ritual self-sacrifice within a mass grave; Torn to pieces by your undead companions; Systematic self-disassembly</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong>Knowledge</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> @UUID[Compendium.pf2e-heresy-of-the-whispering-way.equipment.Item.v826Iow1pH7xEqo6]{Soul Cage}</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.B0Ng2VlhEJMuUXUH]{Bound in Death}</p>\n<p dir=\"ltr\"><strong>Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.o6YCGx4lycsYpww4]{Haste}, @UUID[Compendium.pf2e.spells-srd.Item.aqRYNoSvxsVfqglH]{Unfettered Movement}, @UUID[Compendium.pf2e.spells-srd.Item.srEKUvym9kDVbEhD]{Replicate}</p>"
        },
        "Lich of Yhidothrus": {
            "name": "Lich of Yhidothrus",
            "description": "<p dir=\"ltr\">Some that seek out lichdom do so out of a deep, paralyzing fear of their own mortality– in these cases, many will turn to worship of Yhidothrus, the Ravager Worm, to gain the power needed to cross the mortal threshold. Those who do so are rarely well off, the worship already degrading them and causing them to fester with worms and leeches, but will in turn receive a modicum of power from their otherwise ambivalent master. In doing so, their flesh is replaced with writhing, swarming worms, rendering them similar in appearance to the equally vile worm that walks.</p>\n<p dir=\"ltr\">The magical power granted by doing so grants them their wish; they will not die of old age, nor grow feeble with the passage of time. In fact, their power over age grows, allowing them to sap years of life from their foes as they descend deeper into worship of the Ravager Worm. Even still, their craving for years does not end, as liches of this path will seek to consume the flesh and blood of the young out of a mixture of worship and fear of one day dying, hoping the years of life they steal will only further extend their own.</p>\n<p dir=\"ltr\"><strong>Prerequisites </strong>expert in Nature; worshipper of Yhidothrus</p>\n<p dir=\"ltr\"><strong>Reason </strong>To avoid old age and death, above all else and at any cost</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Arcane, Divine</p>\n<p dir=\"ltr\"><strong>Sacrifice</strong> An item or cause related to why you would want to stay alive, such as your life’s work</p>\n<p dir=\"ltr\"><strong>Ending Means</strong> Be devoured alive by worms; bury yourself alive in swampy soil; heart failure</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong> Youth, in the form of the flesh and blood of young creatures. The longer the creature could have lived, the longer it satisfies you for.</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> @UUID[Compendium.pf2e-heresy-of-the-whispering-way.equipment.Item.v826Iow1pH7xEqo6]{Soul Cage}</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.ES6FkwXXqYr4ujQH]{Blood Feast}</p>\n<p><strong id=\"docs-internal-guid-07c141c9-7fff-79bf-8943-d2d681f7aed5\">Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.J7Y7tl0bbdz7TcCc]{Enfeeble}, @UUID[Compendium.pf2e.spells-srd.Item.WsUwpfmhKrKwoIe3]{Slow}, @UUID[Compendium.pf2e.spells-srd.Item.N1Z1oLPdBxaSgrEE]{Vampiric Feast}</p>"
        },
        "Moss Lich": {
            "name": "Moss Lich",
            "description": "<p dir=\"ltr\">Becoming a moss lich is a difficult choice to be made; those capable of becoming one are rarely the type that would turn to undeath. Still, need breeds desperation, and druids such as those near the Worldwound may find the price of their immortal soul worth protecting their domain. In doing so, they cast off their body entirely, becoming a creature made of mosses, fungi, lichens, and dead plant matter from their home.</p>\n<p dir=\"ltr\">Rebirth as a moss lich alters the mind of the spellcaster, removing much of their connection to civilization entirely and rendering them more feral and primal. With time and continual rebirths, they may lose their connection with society entirely as they die and regrow. The process grants them both a powerful immortality and a stronger connection to the land, but will with time drive them to lose emotions and sympathy for culture and progress. After a few centuries of existence they often lose all sense of connection to other sapient beings, but they might retain protective instincts towards the creatures living within their territory. </p>\n<p dir=\"ltr\"><strong>Prerequisites </strong>master in Survival; Influence Nature</p>\n<p dir=\"ltr\"><strong>Reason </strong>To protect nature at any cost</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Primal</p>\n<p dir=\"ltr\"><strong>Sacrifice </strong>Your connection to your humanity. Moss liches often become more wild and feral, forgetting portions of their original culture or the ability to speak languages not native to their home. Often, moss liches will lose the ability to speak Common.</p>\n<p dir=\"ltr\"><strong>Ending Means </strong>Dying surrounded by vegetation; slowly withering until you return to the earth; being devoured by a venus flytrap</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong>Cultivation of Nature</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> Instead of binding themself to a soul cage, a prospective moss lich grows a @UUID[Compendium.pf2e-heresy-of-the-whispering-way.equipment.Item.sjXLVSY2171KKDD8]{Rejuvinating Seed}, a powerful primal seed tied to their life force. The creation of one doesn’t cost anything, but must be created with the @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.xZN8qvxVmxMqzyag]{Rejuvinating Coalescence} ritual before attempting the lichdom ritual.</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.YtBZq49N4Um1cwm7]{Nature's Reprisal}</p>\n<p><strong id=\"docs-internal-guid-1c834472-7fff-9ab1-2219-be5c230ad059\">Path Spells</strong> Path spells are individual to a given moss lich. Instead of set spells, moss liches select 3 primal spells of 4th rank or lower with any of the following traits: <span style=\"text-decoration:underline\">air</span>, <span style=\"text-decoration:underline\">earth</span>, <span style=\"text-decoration:underline\">fire</span>, <span style=\"text-decoration:underline\">plant</span>, <span style=\"text-decoration:underline\">water</span>, or <span style=\"text-decoration:underline\">wood</span>.</p>"
        },
        "Ossuarite Order": {
            "name": "Ossuarite Order",
            "description": "<p>You connect to the other end of the cycle of life and death, salvaging the bones of those animals who have long since died; after all, nature wastes nothing.</p>\n<p><strong>Order Skill</strong> Occultism</p>\n<p><strong>Druid Feat</strong> @UUID[Compendium.pf2e-heresy-of-the-whispering-way.feats.Item.62gVf4PR3nt1K3hq]{Bonecaller}</p>\n<p><strong>Order Spell</strong> @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.yoA5Yk6F6oECHqxh]{Skeletal Aspect}</p>\n<p><strong>Anathema</strong> Animating non-skeletal undead and the unwilling . (This doesn’t prevent you from working with non-skeletal undead, but you must help to bring them to rest so they may be returned to nature).</p>"
        },
        "Pale Herald": {
            "name": "Pale Herald",
            "description": "<p dir=\"ltr\">Some devout followers of a deity will connect their very soul to their deity, channeling the divine energy to maintain their corporeal form long after death would have claimed them. This process is rarely viewed with excitement, instead being the ultimate sacrifice a cleric can take. By becoming such a lich, they devote their eternity to protecting the faithful of their religion and keeping knowledge of the faith from being lost to time. Pale Heralds most often act as archivists or sages of their faith, though some may ascend to the role to watch over a particular location or act as an immortal warrior within a crusade.</p>\n<p dir=\"ltr\">Many deities are unwilling to allow such an act, or doing so goes against their very tenets. That said, those with the Death, Undeath, or Knowledge domains are most likely to allow such divine undead. Nethys is well known to have several under their purview, and Urgathoa is a patron for many. Even Pharasma, with the contempt she holds over undead, has been known to rarely allow one, often with the express purpose of maintaining vigil over truly vile undead presences–rumors tell that a Pale Herald of hers works within the shadows to end the Whispering Tyrant once and for all.</p>\n<p dir=\"ltr\"><strong>Prerequisites </strong>worshiper of a deity; Sacred Defense</p>\n<p dir=\"ltr\"><strong>Reason </strong>To serve your deity in the material plane, safeguarding their followers and monuments</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Divine</p>\n<p dir=\"ltr\"><strong>Sacrifice </strong>Your oaths to any other creature, deity, or country. Once done, you cannot swear yourself to serve another unless you fall from your deity’s favor.</p>\n<p dir=\"ltr\"><strong>Ending Means</strong> Self-sacrifice at an altar of your faith; mummification; ritual execution by a powerful servant of your deity</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong>Serving your deity</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> Pale Heralds do not have a soul cage, instead binding themselves to their deity, akin to the heralds they draw their name from. When you are destroyed, your soul returns to your deity’s domain where your body regrows over 1d10 days. After that time, you reappear at a temple or shrine of your deity of your deity’s choice. As such, you remain capable of rejuvenating so long as your deity exists.</p>\n<p dir=\"ltr\">Your immortality, however, is heavily contingent on your deity. You are bound by your deity’s edicts and anathemas even more so than normal; if you act against these, your soul counts as uncaged until you atone. If you would fall out of your deity’s favor and be destroyed, your deity may choose to not allow you to reform until a later date, to send your soul to their afterlife, or to destroy your soul entirely. If your deity would be slain or you would fall permanently out of their favor, your soul remains uncaged until you find another deity to serve under.</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.hiVL8qsnTJtpouw0]{Divine Vessel}</p>\n<p><strong id=\"docs-internal-guid-b8882201-7fff-865b-718d-8f64cb3dc41e\">Path Spells</strong> Instead of set path spells, you gain your deity’s Cleric Spells as path spells, even if they would be higher than 4th level. If any of these spells would be higher than 4th level, you cast them at their lowest level.</p>"
        },
        "Primordial Lich": {
            "name": "Primordial Lich",
            "description": "<p dir=\"ltr\">Liches are classically viewed as evil. This is not an unfair view, though a vast majority are more complicated than simply being pure evil. To become a Primordial Lich, however, is to embrace that stereotype and more. By binding themselves to the very unreality outside of existence, primordial liches become representations of the inevitable end of all things. You become a being of pure, irrefutable evil seeking only to end all things. Very rare is a creature that seeks out this path, but a mind filled with such hatred is truly a horror to behold.</p>\n<p dir=\"ltr\">Primordial liches are creatures of destruction, but they are far from reckless; every primordial lich seeks the end of all things, and such are best served building cults and creating long term plans. It is for this reason that while primordial liches do hunger for the death of all things, they are more than willing to work alongside like-minded individuals, including other primordial liches. Similarly, primordial liches find strong allies among daemons, darvakka, and other destructive entities.</p>\n<p dir=\"ltr\"><strong>Prerequisites </strong>master in Primordial Lore; learned the ritual to become one from a creature of death and destruction, such as a sakhil tormenter or daemonic horseman</p>\n<p dir=\"ltr\"><strong>Reason </strong>To destroy something or everything, no matter the cost</p>\n<p dir=\"ltr\"><strong>Spell Tradition </strong>Divine, Occult</p>\n<p dir=\"ltr\"><strong>Sacrifice </strong>A large amount of life such as a village, a military garrison, or both sides of a battle</p>\n<p dir=\"ltr\"><strong>Ending Means</strong> Burnt alive in a fire fed by humanoid fat; Drank poison from the skull of a close ally; Torn apart by creatures of the lower planes</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong>The destruction of all life; this craving is fed by long-term plans more than immediate destruction, so a kingdom slowly brought to ruin over several centuries would feed you far more than mindless slaughter, and is inherently more tantalizing.</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> Your method of ascension moves you far beyond the standard binding of souls to objects; instead your ritual flings an anchor to your soul deep into the beyond, past even the dark tapestry and into a realm outside of reality. Doing so grants you a strange form of true immortality, with your soul returning to its anchorage until you return to the Universe. Returning to the Universe is a difficult process but an inevitable one: whenever an act of great evil is performed in the Universe, you can make a Hard Will saving throw, gaining a +5 circumstance bonus if the act is performed in your name. On a success, you reform within one mile of the evil act after 1d10 days, or immediately on a critical success. You can also be re-summoned by rituals that can summon an aberration of your level or higher.</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.ZMvplR106Jxl7B15]{Awaken Entropy}</p>\n<p><strong id=\"docs-internal-guid-dd1b3b1a-7fff-a1c0-f365-21ae247cdd6d\">Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.rfFZKfeCSweFv7P3]{Impending Doom}, @UUID[Compendium.pf2e.spells-srd.Item.29p7NMY2OTpaINzt]{Necrotic Radiation}, @UUID[Compendium.pf2e.spells-srd.Item.gfKhtVsXF3HKSdmY]{Seal Fate}</p>"
        },
        "Ravener": {
            "name": "Ravener",
            "description": "<p dir=\"ltr\">Dragons who truly fear their deaths are desperate creatures, and will go to great lengths to to extend their lifespan even beyond its natural millenia. Those that do seek out dark and vile magic that transforms them into a ravener, a skeletal dragon imbued with soul-rending power. Unlike most liches, raveners must feed on the souls of others to maintain this undead existence, driving them to travel and consume towns, countries, and even entire regions to sate their endless hunger.</p>\n<p dir=\"ltr\">Becoming a ravener typically requires the usage of the ravenous reanimation ritual; it is assumed, for the purposes of this path, you are not a normal dragon. As such, you use the lichdom ritual as normal, but the rituals share several similar components.</p>\n<p dir=\"ltr\"><strong>Prerequisites</strong> expert in Necromancy Lore; dragon trait</p>\n<p dir=\"ltr\"><strong>Reason</strong> To extend your life indefinitely, even beyond the lifespan of a dragon</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Arcane, Divine, Occult</p>\n<p dir=\"ltr\"><strong>Sacrifice </strong>Your hoard, with a minimum value of 5000 GP</p>\n<p dir=\"ltr\"><strong>Ending Means</strong> Consuming the destroyed remains of your horde</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong> Souls</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> Your hunger for souls and treasure leads you to not require a soul cage; that portion of the ritual is waived, its cost being replaced by your sacrifice. Instead, you gain a soul ward, an intangible field of necromantic energy detailed further in your basic abilities.</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.OOELvfkTedBMlWtq]{Spell Turning}</p>\n<p><strong id=\"docs-internal-guid-b910216d-7fff-141a-0e75-c9fc231838b2\">Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.V8wXOsoejQhe6CyG]{Vapor Form}, @UUID[Compendium.pf2e.spells-srd.Item.Mv5L4201uk8hnAtD]{Reflective Scales}, @UUID[Compendium.pf2e.spells-srd.Item.tgIhRUFtgDSELpJE]{Spell Immunity}</p>"
        },
        "School of the Whispering Way": {
            "name": "School of the Whispering Way",
            "description": "<p>Death is the end point of life, an inevitability to all mortal creatures and even some immortal creatures. Undeath, thus, is the truest form of existence, one lacking the impermanence of life. Whether learned from a Member of the Whispering Way itself or discovered in ancient tomes, your magic focuses on the manipulation of death and undeath to raise the dead and slay the living. The magic you learn is not inherently evil; what you do with it, if you are not careful however, may end up being just that.</p>\n<p><strong>Curriculum</strong></p>\n<ul>\n<li><strong>cantrips:</strong> @UUID[Compendium.pf2e.spells-srd.Item.AfOpnnwdZwHi2Tnc]{Protect Companion}, @UUID[Compendium.pf2e.spells-srd.Item.mAMEt4FFbdqoRnkN]{Void Warp}</li>\n<li><strong>1st:</strong> @UUID[Compendium.pf2e.spells-srd.Item.WV2aMNN9DO5ZBjSv]{Flense}, @UUID[Compendium.pf2e.spells-srd.Item.JUJYVbtNNFdvyrBS]{Necromancer's Generosity}, @UUID[Compendium.pf2e.spells-srd.Item.9WGeBwIIbbUuWKq0]{Summon Undead}</li>\n<li><strong>2nd:</strong> @UUID[Compendium.pf2e.spells-srd.Item.zdNUbHqqZzjA07oM]{Boneshaker}, @UUID[Compendium.pf2e.spells-srd.Item.x0rWq0wS06dns4G2]{Final Sacrifice}</li>\n<li><strong>3rd:</strong> @UUID[Compendium.pf2e.spells-srd.Item.GUeRTriJkMlMlVrk]{Bind Undead}, @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.Xq9cRGRZuf1MBidh]{Mastery of Flesh}</li>\n<li><strong>4th:</strong> @UUID[Compendium.pf2e.spells-srd.Item.S1Msrwi990FE7uMO]{Call The Blood}, @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.rcWa79uMQkT2xG46]{Consume Undead}</li>\n<li><strong>5th:</strong> @UUID[Compendium.pf2e.spells-srd.Item.hghGRzOSzEl4UXdS]{Invoke Spirits}, @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.tMrw0f1nyuaIgiHp]{Bone Explosion}</li>\n<li><strong>6th:</strong> @UUID[Compendium.pf2e.spells-srd.Item.6lO6uMQxbqmYho0e]{Necrotize}, @UUID[Compendium.pf2e.spells-srd.Item.fd31tAHSSGXyOxW6]{Vampiric Exsanguination}</li>\n<li><strong>7th:</strong> @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.KJvRcc9E5GRLT27Q]{Blessing of Unlife}, @UUID[Compendium.pf2e.spells-srd.Item.JLdbyGKhjwAAoRLs]{Tempest of Shades}</li>\n<li><strong>8th:</strong> @UUID[Compendium.pf2e.spells-srd.Item.gtWxTfMbIN5RHQw6]{All is One, One is All}, @UUID[Compendium.pf2e.spells-srd.Item.M0jQlpQYUr0pp2Sv]{Desiccate}</li>\n<li><strong>9th:</strong> @UUID[Compendium.pf2e.spells-srd.Item.m3lcOFm400lQCUps]{Power Word Kill}</li>\n</ul>\n<p><strong>School Spells</strong> initial: @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.NaQacs9bljM44DhD]{Life Siphon}; advanced: @UUID[Compendium.pf2e-heresy-of-the-whispering-way.spells.Item.yVlcxmQa7EMqt8c1]{Life Sight}</p>"
        },
        "True Lich": {
            "name": "True Lich",
            "description": "<p dir=\"ltr\">A creature of immense power, and the most classic form of lich. Available to most spellcasters, it is not to be dismissed by its commonality; there is good reason most liches are True Liches.</p>\n<p dir=\"ltr\"><strong>Prerequisites </strong>expert in Necromancy Lore or Arcana</p>\n<p dir=\"ltr\"><strong>Reason </strong>To grow in power and continue your ambitions without the fear of decay and death</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Arcane, Divine, Occult, Primal</p>\n<p dir=\"ltr\"><strong>Sacrifice</strong> Perform a sacrifice that would be abhorrent to your own character, such as the sacrifice of a close family member or destruction of their most cherished possession.</p>\n<p dir=\"ltr\"><strong>Ending Means</strong> Imbibing a mixture of various poisons; dying to a void spell of 5th level or higher; removing your heart from your chest yourself</p>\n<p dir=\"ltr\"><strong>Undead Hunger </strong>Knowledge</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> @UUID[Compendium.pf2e-heresy-of-the-whispering-way.equipment.Item.v826Iow1pH7xEqo6]{Soul Cage}</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.r7ihOgKv19eJQnik]{Disintegrate}</p>\n<p><strong>Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.9HpwDN4MYQJnW0LG]{Dispel Magic}, @UUID[Compendium.pf2e.spells-srd.Item.A2JfEKe6BZcTG1S8]{Fly}, @UUID[Compendium.pf2e.spells-srd.Item.VlNcjmYyu95vOUe8]{Translocate}</p>"
        },
        "Undead Lord": {
            "name": "Undead Lord",
            "description": "<p>You focus on necromancy, allowing you to control a flock of undead. Through your powers, your followers (mindless or otherwise) act in the glory of your deity.</p>\n<p><strong>First Doctrine (1st):</strong> You’re trained in light armor, and you have expert proficiency in Fortitude saves. You gain the @UUID[Compendium.pf2e.feats-srd.Item.M6cWLywN0aWnX5Gl]{Undead Master Dedication} archetype feat. You can select the dedication feat for another archetype, even if you haven’t yet gained three feats from Undead Master. You can prepare @UUID[Compendium.pf2e.spells-srd.Item.9WGeBwIIbbUuWKq0]{Summon Undead} in the spell slots gained from your harmful or healing font. At 13th level, if you gain the divine defense class feature, you also gain expert proficiency in light armor.</p>\n<p><strong>Second Doctrine (3rd):</strong> You gain the @UUID[Compendium.pf2e-heresy-of-the-whispering-way.feats.Item.SzMM4aLhw4ChNfmd]{Command Undead} cleric feat.</p>\n<p><strong>Third Doctrine (7th):</strong> You gain expert proficiency with your deity's favored weapon, simple weapons, and unarmed attacks.</p>\n<p><strong>Fourth Doctrine (11th):</strong> Your proficiency ranks for divine spell attack rolls and spell DCs increase to expert.</p>\n<p><strong>Fifth Doctrine (15th):</strong> Your proficiency rank for Fortitude saves increases to master. When you roll a success at a Fortitude save, you get a critical success instead.</p>\n<p><strong>Sixth Doctrine (19th):</strong> You gain master proficiency with your deity's favored weapon, spell attack modifier, and spell DC.</p>\n<p><em>(Designer’s note: If you are using the Free Archetype variant rule, you can instead select a 1st or 2nd level cleric feat that you meet the requirements for when you would normally gain your 2nd level archetype feat)</em></p>"
        },
        "Undead Mastery": {
            "name": "Undead Mastery",
            "description": "<p>As opposed to a familiar, you’ve animated a companion corpse, altering it to improve it more than more novice necromancers. You gain the @UUID[Compendium.pf2e.feats-srd.Item.M6cWLywN0aWnX5Gl]{Undead Master Dedication} archetype feat. The companion granted by your Undead Master Dedication becomes your Bonded Companion. It gains a monster ability depending on what type of companion it is: a <span style=\"text-decoration:underline\">zombie ability</span> if it is a <span style=\"text-decoration:underline\">zombie</span>, or a <span style=\"text-decoration:underline\">skeleton ability</span> if it is a <span style=\"text-decoration:underline\">skeleton</span>. It gains an additional ability when you reach 8th and 16th levels.</p>\n<p>Your connection to your Bonded Companion alters your arcane bond class feature so you can store your magical energy inside it, rather than an item you own; you also gain the Drain Companion free action instead of @UUID[Compendium.pf2e.actionspf2e.Item.v82XtjAVN4ffgVVR]{Drain Bonded Item}. Drain Companion can be used any time an ability would allow you to use Drain Bonded Item and functions identically, except that you draw magic from your companion instead of an item.</p>\n<p><em>(Designer’s note: If you are using the Free Archetype variant rule, you can instead select a 1st or 2nd level wizard feat that you meet the requirements for when you would normally gain your 2nd level archetype feat)</em></p>"
        },
        "Wraithlich": {
            "name": "Wraithlich",
            "description": "<p dir=\"ltr\">Wraithliches eschew flesh entirely, becoming incorporeal creatures with all the benefits and penalties associated. The reasons for becoming one vary heavily, but most wraithliches hold a deep urge to travel the world, unfettered by anything up to and including themselves. Wraithliches draw their transformation from wraiths, becoming weak to light but are not inherently as murder-minded. That said, becoming a wraithlich allows those with the urge to move wherever they please, allowing them to slay the living without issue.</p>\n<p dir=\"ltr\">Wraithliches are composed entirely of void energy, and are inherently anathema to vitality magic. It is rare that one would make use of such spells, and are rarely seen moving about during the day. They appear as specters clad in tattered robes, glowing dots of eyes piercing from within the cowl, but no body to be found. Other normal wraiths tend to congregate around wraithliches, viewing them in the same way that lions may view a leader of their pride.</p>\n<p dir=\"ltr\"><strong>Prerequisites </strong>master in Spirit Lore or a similar lore skill</p>\n<p dir=\"ltr\"><strong>Reason </strong>To travel the world unfettered by flesh or time</p>\n<p dir=\"ltr\"><strong>Spell Tradition</strong> Arcane, Occult</p>\n<p dir=\"ltr\"><strong>Sacrifice</strong> The reason you return home, such as a specific person, building, or position</p>\n<p dir=\"ltr\"><strong>Ending Hunger </strong>Being disintegrated; being destroyed by void energy; being incinerated by fire or light</p>\n<p dir=\"ltr\"><strong>Undead Craving</strong> Visiting new locations</p>\n<p dir=\"ltr\"><strong>Soul Cage</strong> @UUID[Compendium.pf2e-heresy-of-the-whispering-way.equipment.Item.v826Iow1pH7xEqo6]{Soul Cage}. You instead rejuvenate after 1d6 days, appearing near your soul cage without a body.</p>\n<p dir=\"ltr\"><strong>Spell Gem Spell</strong> @UUID[Compendium.pf2e.spells-srd.Item.69L70wKfGDY66Mk9]{Teleport}</p>\n<p><strong>Path Spells</strong> @UUID[Compendium.pf2e.spells-srd.Item.DeF63UTmr7rchF60]{Wall of Shadow}, @UUID[Compendium.pf2e.spells-srd.Item.WVc30DGbM7TRLLul]{Ghostly Tragedy}, @UUID[Compendium.pf2e.spells-srd.Item.VlNcjmYyu95vOUe8]{Translocate}</p>"
        }
    }
}