{
    "label": "Eldamon Actions",
    "mapping": {
        "name": "name",
        "description": "system.description.value"
    },
    "entries": {
        "Elemental Shield": {
            "name": "Elemental Shield",
            "description": "<p>You call forth your element to form a shield, which floats above you, or in your hand for increased protection. You gain a +1 circumstance bonus to your AC until the beginning of your next turn from the elemental shield. You also gain the elemental shield benefit based on your element. If you use Elemental Shield again while your shield is still active, the previous shield ends and a new one appears.</p>"
        },
        "I Know This!": {
            "name": "I Know This!",
            "description": "<p><strong>Requirements</strong> You are phased out, and one of your trained eldamon is phased in.</p>\n<hr />\n<p>Even though you're phased out, making your mental processes move slowly in tune with the everlasting elements, when you see something you might know, you manage to borrow a bit of your phase and snap your mind into focus, so you can shout out the information to your eldamon and other allies. You Recall Knowledge and pass the information on. You can use this action even though you normally can't act while phased out.</p>"
        },
        "Refresh": {
            "name": "Refresh",
            "description": "<p>You rearrange the elemental energies around you, refreshing your powers. You refresh all your active and reactive powers, allowing you to use them all again.</p>\n<hr />\n<p><strong>Special</strong> The Refresh activity gains your element's associated traits.</p>"
        },
        "Retract Tether": {
            "name": "Retract Tether",
            "description": "<p><strong>Requirements</strong> You are phased out, one of your trained eldamon is phased in, and you are not using Untether to remove the tether with your phased in eldamon.</p>\n<hr />\n<p>You train yourself and your eldamon in order to take advantage of the tether between the two of you while they're phased in, turning a restriction into an advantage, as the eldamon instantly rebounds back to your location. Your phased in eldamon moves to a space adjacent to your current position by traveling along its metaphysical tether. Since it doesn't pass through any intervening spaces, it doesn't trigger reactions based on moving through those spaces, though it still triggers reactions based on movement in the initial and final spaces.</p>"
        },
        "Siphoning Element": {
            "name": "Siphoning Element",
            "description": "<p>You alter an elemental power in order to siphon or nullify your elemental energy in the targets or area, rather than to manifest the element. If the next action you use is to channel an elemental power, the power deals half damage and loses all added effects other than damage (for example persistent damage, forced movement, difficult terrain, temporary Hit Points). In exchange, the damage is untyped, allowing it to apply to creatures that would ordinarily be immune. If your power normally dealt vitality damage, this allows it to damage living creatures or constructs, and if it normally dealt void damage, this allows it to damage undead or constructs. Siphoning Element has no effect when used with a power that requires an additional effect in order to deal damage, such as a power that deals damage or has an area based on distance moved.</p>"
        },
        "Elemental Surge": {
            "name": "Elemental Surge",
            "description": "<p><strong>Requirements</strong> You haven't used a power or elemental surge yet this turn</p>\n<hr />\n<p>You create a minor surge of your element in place of using a power. You can't use a power on this turn, but on your next turn, the first time you use an active power, you gain the elemental surge effect based on your element, just before or just after applying the power's normal effects (your choice). If the effect specifies that it affects a creature, it affects one creature of your choice that's either you, a target of your power, or a creature in the power's area. If the effect specifies that it affects you, you gain the benefit.</p>"
        },
        "You Can Do It!": {
            "name": "You Can Do It!",
            "description": "<p><strong>Requirements</strong> You are phased out, and one of your trained eldamon is phased in.</p>\n<hr />\n<p>Even though you're phased out, you call out encouraging messages to your eldamon friend, assisting them in their next endeavor. Make a @Check[type:diplomacy|dc:15|traits:action:you-can-do-it] check. On a success, your eldamon gains a +1 circumstance bonus to their next attack roll or skill check before the end of this turn. On a critical success, they gain a +2 circumstance bonus instead. You can use this action even though you normally can't act while phased out.</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.UVElzamzIzpvGuC2]{Effect: You Can Do It!}</p>"
        },
        "Fluctuating Phase": {
            "name": "Fluctuating Phase",
            "description": "<p>You train with your eldamon to use your phase sharing to their advantage, allowing them to partially shift out to avoid being targeted by various effects. When your eldamon uses Fluctuating Phase, until the beginning of your next turn, any creature that attempts to target your eldamon with an attack, spell, or other effect must succeed at a @Check[type:flat|dc:5]. On a failure, the effect is wasted as your eldamon phases out briefly.</p>"
        },
        "Interstitial Phase": {
            "name": "Interstitial Phase",
            "description": "<p>You've trained your eldamon to rapidly swap phase between two eldamon while taking a quick action of your own for the brief time you are in phase. Your currently phased in eldamon uses Phase Eldamon to switch to another eldamon. Just after the first eldamon phases out and just before the next one phases in, you (the eldamon trainer) take a single action of your choice.</p>"
        },
        "Phase Eldamon": {
            "name": "Phase Eldamon",
            "description": "<p><strong>Requirements</strong> You and your eldamon have not acted yet this turn</p>\n<hr />\n<p>You switch your phase on the Material Plane (or your current plane if you're not on the Material Plane) with that of one of your eldamon. Choose one of the eldamon you prepared, which must be adjacent to you or in your square, and must be your level or lower, and phase it fully onto the Material Plane (or your current plane) in its battle form (or its evolved battle form if it's capable of taking that form). In exchange, you become phased out. While eldamon can act more freely in their natural phase, mortals weren't intended to exist in such a state. While out of phase, you can't act (unless you have an ability that specifically allows you act while phased out).</p>\n<p>While phased in, your eldamon uses your initiative and gains actions and reactions at the start of each of your turns, rather than you. Your eldamon must remain within 160 feet of you, so since you can't act to move, that significantly restricts its range of movement. It feels unpleasant for a phased-in eldamon to stay outside of line of effect from you, as the steady of line of effect is calming. As such, they refuse to do so unless it is necessary during an encounter or similar life or death situation, as determined by the GM. Your eldamon can use Phase Eldamon in order to switch back the phase to you as a free action, rather than a two-action activity. With your permission, they can also use Phase Eldamon to swap briefly back to you and then over to another eldamon, which is a two-action activity as normal. When they do so, the new eldamon appears adjacent to you or adjacent to the previous eldamon, whichever the previous eldamon chooses.</p>\n<p>The phase shift lasts until your eldamon uses Phase Eldamon, or until your eldamon is reduced to 0 Hit Points, whichever comes first. When your eldamon returns the phase back to you (even if it does so only briefly when shifting to a different eldamon), you lose Hit Points equal to the eldamon's missing Hit Points, and you take all other negative effects the eldamon was suffering. Additionally, when it phases back out, your eldamon refreshes. If losing the eldamon's missing Hit Points reduces you to 0 Hit Points, you become dying 1 as normal (or dying 2 if the eldamon was reduced to 0 Hit Points by a critical hit or a critical failure on a saving throw). If you reach 0 Hit Points for any reason, your eldamon phases out and you phase in.</p>\n<hr />\n<p><strong>Special</strong> During an encounter, you can Phase Eldamon as a free action, triggered at the start of your turn, as long as you started the encounter without an eldamon phased in and haven't used Phase Eldamon or Incarnate Eldamon yet in the encounter. If you do, you can use the elemental effusion ability first.</p>"
        },
        "Tug Conduit": {
            "name": "Tug Conduit",
            "description": "<p><strong>Frequency</strong> once per minute (this frequency applies across all your eldamon)</p>\n<p><strong>Requirements</strong> Your eldamon has not used Tug Conduit since they phased in.</p>\n<hr />\n<p>Your eldamon tugs on the conduit they share with you, dragging you toward them. When your eldamon uses Tug Conduit, you partially phase in and Stride once, but you must move directly toward your eldamon, while Striding, you are phased in enough to trigger reactions, take damage and suffer other negative effects caused by your movement, and if you do so, your Stride immediately stops.</p>"
        }
    }
}
