{
    "entries": {
        "Shocked": {
            "name": "电震 Shocked",
            "description": "<p>电震状态通常没有数值。处于电震状态的生物带有充电，这使得电更容易对其造成伤害。它对造成电击伤害的攻击（即使是额外的电击伤害，例如来自“电击”武器的伤害 <em>@UUID[Compendium.pf2e.equipment-srd.Item.NVst7e69agGG9Qwd]{Shock}</em> weapon) ）处于“措手不及”@UUID[Compendium.pf2e.conditionitems.Item.AJh5ex99aV6VTggg]{Off-Guard}状态，并且在对抗电击效果的强韧和反射豁免上承受-2环境减值。</p>\n<p>电震状态通常持续其列出的持续时间，但如果生物从非持续电击伤害的来源受到任何数量的电击伤害，或者它们花费一个交互动作（Interact action）安全地释放电荷，则电震状态会提前结束。</p>"
        },
        "Shrouded": {
            "name": "遮蔽 Shrouded",
            "description": "<p>黑暗威能和效果可能会使生物陷入“遮蔽”（shrouded）状态。遮蔽状态总是有一个数值，从1到3。遮蔽生物周围的光会根据遮蔽状态的数值和其周围环境的光照强度而被遮挡。这会影响遮蔽生物的视觉能力，以及其他生物看到遮蔽生物的能力。本质上，遮蔽状态会使遮蔽生物的光照水平降低与状态数值相等的等级（强光变为微光，微光变为黑暗，黑暗变为类似于4级黑暗术 <em>@UUID[Compendium.pf2e.spells-srd.Item.4GE2ZdODgIQtg51c]{Darkness}</em> 的超自然黑暗），但遮蔽1在微光中会使生物对低光视觉来说处于隐蔽状态，而不是完全黑暗。</p>\n<p>此外，生物在隐藏和潜行的潜行检定上获得等于遮蔽状态数值的环境加值。在遮蔽状态下，可以通过融入阴影来隐藏和潜行，但在明亮区域，由于黑暗的笼罩，你的大致位置可能仍然显而易见，就像带着可见光环潜行可能会暴露你一样；在这种情况下，你处于藏匿状态而不是未发现。</p>\n<p>如果一个处于遮蔽状态的生物会陷入轮廓化（Limned） @UUID[Compendium.battlezoo-eldamon-pf2e.conditions.Item.5tWqbv3Iu1FlrOx6]{Limned}状态，那么它反而会失去其遮蔽状态，反之亦然。</p>\n<p>关于如何根据遮蔽状态的每个可能数值和每个可能的光照水平来应用遮蔽状态的完整描述，请参阅“遮蔽完整示例”\"@UUID[JournalEntry.GfmgMfxWoAkjccTQ.JournalEntryPage.7A4XisITzN9KG7Qd#shrouded-full-examples]{Shrouded Full Examples}\" </p>"
        },
        "Charged": {
            "name": "充电 Charged",
            "description": "<p>电系精灵（electricity eldamon）和电元素使（electricity elemental avatars）可能会获得“充电”（charged）状态。充电状态总是有一个数值，从1到3。如果一个已经充电的生物会再次获得充电状态，那么它的充电状态数值会增加1，最高可达3。只要生物处于充电状态，它就会处于“电震”（Shocked） @UUID[Compendium.battlezoo-eldamon-pf2e.conditions.Item.1fZbuJEbVmE3J4XL]{Shocked} 状态。 任何能够移除电震状态的效果，都会将充电状态的数值减少1。大多数电系精灵能力提供了放电选项，通过减少1点充电状态来获得额外效果。</p>\n<p>充电状态会持续到遭遇战结束；在遭遇战之外获得的任何充电，在下一次刷新时都会丢失。因此，电元素灵和电元素使总是在遭遇战开始时处于未充电状态。如果电元素精灵或电元素使没有处于充电状态，它们就不能使用需要放电的威能（或者威能内的可选效果）。</p>"
        },
        "Effect: Shifting Tides": {
            "name": "潮汐 Shifting Tides",
            "description": "<p>每当你要进行先攻检定、在遭遇战中刷新你的力量，或者如果你是水系精灵（water eldamon）而进入相位时，选择高潮或低潮。这是你的初始潮汐。每次你使用水元素力量时，你都会获得当前潮汐的效果，然后切换到另一个潮汐（高潮变为低潮，或低潮变为高潮）。通过这种方式，你的力量在两个潮汐之间交替，直到你刷新并切换到你偏好的潮汐。通常在遭遇战之外，你没有潮汐状态。</p>"
        },
        "Frozen": {
            "name": "冻结 Frozen",
            "description": "<p>冻结状态总是有一个数值。处于冻结状态的生物的身体正在逐渐冻结，导致其速度受到状态减值，减值等于 −5 英尺 × 冻结数值，例如，冻结 4 的生物速度减值为 −20 英尺。</p>\n<p>处于冻结状态的生物或其相邻盟友可以花费一个交互动作来移除冰，将冻结状态减少 4。具有火焰特性的生物则可以将自身的（或其盟友的）冻结状态减少 5。对处于冻结状态的生物使用具有火焰特性的效果，或会造成火焰伤害的效果的生物，可以选择将该冻结生物的冻结值减少 4，无论该生物是否受到火焰伤害。</p>\n<p>尽管冻结状态通常不是累积的（与其他状态不同），但冰系精灵（ice eldamon）和元素使（elemental avatars）有一种特殊能力，允许它们从自身的力量中累积冻结状态。</p>"
        },
        "Limned": {
            "name": "轮廓鲜明 Limned",
            "description": "<p>光元素力量和效果可能会使生物陷入“轮廓鲜明”（limned）状态。处于轮廓鲜明状态的生物周围环绕着光芒，使其像火炬一样发光，勾勒出它的轮廓，使其位置显而易见。由于发光，处于轮廓鲜明状态的生物通常不能处于隐蔽状态，但如果该生物原本会处于隐形状态，那么它将处于隐蔽状态。处于轮廓鲜明状态且隐形的生物不能利用隐蔽状态来隐藏或潜行，因为光芒会暴露其确切位置。轮廓鲜明状态不会阻止具有掩护的生物进行隐藏或潜行。如果一个生物有能力在没有掩护或隐蔽的情况下隐藏或潜行（例如通过使用伪装），那么轮廓鲜明状态发出的明亮光芒会使这一行为变得更加困难，只要光芒可见，就会给该生物的潜行检定以及针对搜索行动的潜行DC带来-4环境减值。</p>\n<p>如果一个处于“遮蔽”（Shrouded） @UUID[Compendium.battlezoo-eldamon-pf2e.conditions.Item.SXQzSmgPZv0IFSlN]{Shrouded} 状态的生物会陷入轮廓化状态，那么它反而会失去其遮蔽状态，反之亦然</p>"
        }
    },
    "label": "Eldamon Conditions",
    "mapping": {
        "name": "name",
        "description": "system.description.value"
    }
}
