{
    "entries": {
        "Bodily Regeneration": {
            "name": "Bodily Regeneration",
            "description": "<p>Over time, kragraks regenerate. Every hour, you recover Hit Points equal to your level. You also regrow any missing body parts, returning to the asymmetrical form you chose during your Rites. This typically takes 2&ndash;4 days for something the size of a finger, 2&ndash;4 weeks for something the size of a hand, or 2&ndash;4 months for something the size of an arm, The regrown parts leave a scar or seam that a careful observer would notice.</p>"
        },
        "Certain Footing": {
            "name": "Certain Footing",
            "description": "<p>Your low center of gravity and innate sense of balance give you more stable footing than other two-legged creatures. You can ignore difficult terrain caused by narrow ledges or uneven ground. In addition, when you use the Acrobatics skill to @Compendium[pf2e.actionspf2e.Balance]{Balance} on narrow ledges or uneven ground, you aren&rsquo;t flat-footed, and when you roll a success at one of these Acrobatics checks, you get a critical success instead.</p>"
        },
        "Chora": {
            "name": "Chora",
            "description": "<p>You have one of seven chora, which can affect your feats.</p>\n<h3>Aikrys</h3>\n<p>Chochori of the aikrys chora tend to be especially independent, ingenious, and innovative. This makes them likelier than chochori of other chori to be lone pioneers in various fields, especially when it comes to inventing new things or discovering new places. They can be somewhat temperamental and are not always in control of their emotions. The aikrys chora is associated with the element of air, and it is said that a great aikrys hero long ago first discovered that the world of air up above the water&rsquo;s surface was safe for chochori, back in ancient times when it was believed that the surface was the edge of the known world, leading to the underworld or a dangerous otherworld. Aikrys chochori are respected for their ingenuity, but they sometimes innovate and iterate even when the old way of doing things was perfectly serviceable, and sometimes their experiments end in utter failure. That&rsquo;s not to say aikrys chochori act like reckless scientists, with laboratories of exploding prototypes. It&rsquo;s simply the case that it usually takes learning from multiple failed attempts to successfully innovate. Aikrys chochori are among the most common to become adventurers, inventors, and scientists, due to their independent streak and sense of exploration.</p>\n<h3>Carbor</h3>\n<p>Chochori of the carbor chora tend to grow in a way that&rsquo;s deeply intertwined with others. Their interconnectedness can make them sympathetic to others&rsquo; feelings, and their way of considering others&rsquo; feelings and motivations can also make them talented at persuasion. Carbor chochori can be extremely loyal to those close to them, though they are suspicious and slow to trust when it comes to strangers. However, once they accept someone, they quickly grow closer. The carbor chora is associated with the element of wood, and it is said that a great carbor hero long ago helped set up the structures of the first choristes. Carbor chochori are well-regarded for their ability to understand and get along with others, though other chochori make sure to be open and upfront with carbor chochori in order to prove their honesty and allay the carbor chochori&rsquo;s suspicion. In groups where cohesion and teamwork is crucial, such as hunting parties, diplomatic envoys, or adventuring groups, carbor chochori excel as members, so long as they have time to warm up to the group before a high-stakes mission.</p>\n<h3>Farose</h3>\n<p>Chochori of the farose chora tend to be courageous and confident. That&rsquo;s not to say they never feel any sort of doubt or fear, or that they act recklessly. It simply means they are able to continue onward in the face of such fears and doubts with exceptional resolve. They can be enthusiastic in the pursuit of their passions and goals, which is generally a good thing, but can make them impatient when a goal is delayed, especially by delays they feel are unnecessary or pointless. Their brave and decisive attitude can also be seen as aggressive. The farose chora is associated with the element of fire, and it is said that a great farose hero long ago fought back terrifying ancient evils that arose from deep under the sea, ensuring the safety of their homeland. Farose chochori are lauded for their bravery and leadership, but sometimes viewed with anxiety for their tendency towards impatient, aggressive, and occasionally rash solutions to obstacles in their path. No one wants to be seen as an obstacle to a farose chochori. Farose chochori have a tendency to volunteer for fast-paced and dangerous tasks that other chochori would balk at facing. This also includes violent professions such as soldiers or adventurers. They often find roles allowing for leadership or decision-making easier to handle than those where they might have to wait and stew for a decision to be made.</p>\n<h3>Hypisk</h3>\n<p>Chochori of the hypisk chora tend to be gentle and artistic, with a calm eye towards the bigger picture and the inner beauty hidden within everyday things. They often have a rich inner world, with deep and expressive dreams. The hypisk chora is associated with the element of water, and it is said that a great hypisk hero long ago had prophetic dreams that led the people of that time to discover rich lands of plenty in which to live and build their settlements. Hypisk chochori are seen as wise for their ability to understand the larger context of things and look past the surface level. However, due to their inner contemplations, they are sometimes seen as reserved or distant, almost as if they&rsquo;re looking past you or through you. Still, they tend to be as sociable as most other chori, so they don&rsquo;t have a reputation for being shy, as vergiss chochori do. Hypisk chochori excel at artistic and creative tasks or those that require deeper reflection and wisdom. They are less likely than chochori of most other chori to become adventurers or other violent occupations.</p>\n<h3>Jamambri</h3>\n<p>Chochori of the jamambri chora tend to be quick- thinking and adaptable, able to react extremely quickly and effectively to all sorts of unusual situations. They are often extremely curious, which, when combined with their quick thinking, means that they flit about from curiosity to curiosity, enjoying each one until their inquisitive nature inspires their interest in something else. The jamambri chora is associated with the element of electricity (chochori see electricity as an element, as it is one of the elements in the ancient religion known as the Eld), and it is said that a great jamambri hero long ago was the first to react when chochori of that era met other ancestries, adapting to their strange ways and obsession with incomprehensible concepts like sex and gender. Jamambri chochori are seen as particularly cunning and able to land on their feet in any situation. However, they can also be seen as fickle, mercurial, and flighty due to their ever-changing interests. Jamambri chochori often change their occupation many times throughout their lives, and they try a little bit of everything at least once, except for jobs that require mindless repetition or labor. Jobs with a large number of disparate, quickly-changing tasks or challenges, such as adventuring, are especially popular among jamambri chochori.</p>\n<h3>Terath</h3>\n<p>Chochori of the terath chora tend to be patient and equanimous, willing to bide their time and take things slowly if necessary. They are more likely to place extreme value on a promise and oath and to always keep their word. Terath chochori&rsquo;s patience contrasts with both farose chochori&rsquo;s impatience and jamambri chochori&rsquo;s short attention spans. This doesn&rsquo;t lead to any antagonism between terath chochori and those of the other two chori, however. Instead, it allows them to work together well, with each lending their strengths to cover the other&rsquo;s weaknesses. For instance, most terath chochori appreciate the quick thinking of jamambri chochori, while for their part, the majority of jamambri chochori are all too happy to have someone else who is not just willing but eager to perform slow-paced and repetitive work. The terath chora is associated with the element of earth, and it is said that a great terath hero long ago discovered aquaculture, allowing chochori to have a steady, consistent food source through low, careful planning, rather than being subject to the whims of a poor hunting season. Terath chochori are seen as exceptionally reliable due to their tendency to remain calm and patient, and to always keep their promises, even if it requires great persistence to do so. However, their stalwart refusal to back down can sometimes give them a reputation for being stubborn. Once a terath chochori has made a decision, their tendency to stick to it no matter what can be either a virtue or a vice, depending on the situation. Terath chochori often prefer jobs where they can take their time and get everything perfect, rather than those where they have to make split-second decisions or otherwise act extremely quickly.</p>\n<h3>Vergiss</h3>\n<p>Chochori of the vergiss chora tend to be analytical and practical, looking at problems from various different perspectives and logically breaking them down into smaller problems in order to solve them. They tend to take things seriously and to keep to themselves, able to relate more easily to logic, mathematics, and other things that follow expected patterns than they are to other people, with their unpredictable moods and whims. The vergiss chora is associated with the element of ice (chochori see ice as an element, as it is one of the elements associated with the ancient religion known as the Eld), and it is said that a great vergiss hero long ago developed the complex mathematics that chochori have used across the ages to research physics and other advanced topics. Vergiss chochori are seen as serious and intellectual and are respected for their logical way of thinking. However, they are often also viewed as shy or introverted. Chochori of other chori might approach a vergiss chochori cautiously and politely when starting a conversation without a predetermined structure for the socialization, out of respect for what they guess to be the vergiss chochori&rsquo;s preferences. Vergiss chochori aren&rsquo;t usually quick to blame others either way. However, while they tend to judge others with exceptional grace and consideration, when it comes to themselves they often hold impossibly high standards, leading them to be extremely self-critical at times. Vergiss chochori&rsquo;s tendency to be introverted doesn&rsquo;t mean that they prefer to work alone, though that&rsquo;s true for some vergiss chochori. Most, however, enjoy working with others nearby as long as the other people are also quietly working and leave them alone with their thoughts so they can concentrate on their own work. They prefer tasks involving intellect, logic, and rationality. This sometimes leads to occupations that are similar to those preferred by aikrys chochori, but while an aikrys scientist is more likely to pioneer a novel research field, a vergiss scientist will usually be the one methodically and logically filling in the conceptual holes left behind during the aikrys chochori&rsquo;s rush to innovate something new.</p>"
        },
        "Headbutt": {
            "name": "Headbutt",
            "description": "<p>The top of your skull is very hard, as are the horns that curl by the side of your head. You have a headbutt unarmed attack that deals 1d6 bludgeoning damage and has the shove trait. This unarmed attack is in the brawling weapon group.</p>"
        },
        "Keen Snout": {
            "name": "Keen Snout",
            "description": "<p>You have an acute sense of smell. You gain imprecise scent with a range of 30 feet. This means you can use your sense of smell to determine a creature's exact location. The GM will usually double the range if you're downwind from the creature or halve the range if you're upwind.</p>\n<p>You also gain a +2 circumstance bonus to Perception checks when trying to locate an undetected creature within range of your scent.</p>"
        },
        "Secondary Element": {
            "name": "Secondary Element",
            "description": "<p>Most kragraks have a secondary element which can influence the effect of several feats.</p>\n<h2>Secondary Element</h2>\n<p>Each kragrak is associated with the element of earth, but many choose a secondary element that reflects their personality. This secondary element could be any of the ones represented in the ancient teachings of the Eld, from the famous and prominent (such as fire) to the intangible (such as time). This elemental framework is a deeply-rooted part of most kragrak communities, whether their members follow the ways of the Eld or offer prayers to the deities of the balance. The origins of this framework are a matter of discussion and philosophy. Kragraks who follow the Eld are more likely to see these elemental affinities as intrinsic and directed by a connection between the kragrak&rsquo;s soul and elemental forces. Meanwhile, kragraks who follow the Balance are more likely to see the choice of elemental affinity as a matter of self-expression. Most kragraks consider all secondary elements to be valuable, with benefits they bring to society alongside a personal challenge that each kragrak with their affinity must face (though few can escape the bias in favor of their own secondary element). Those who bring out their secondary element&rsquo;s strengths without getting mired in its challenges earn the respect of their peers. The common wisdom in kragrak communities is that it is foolish to make major decisions without consulting with people of different secondary elemental affinities. This preference for varied perspectives is reflected in all aspects of society. On a personal level, kragraks seek such variety in their social circles, and settlements with predominantly kragrak residents favor governing councils.</p>\n<p>Kragraks traditionally group the core twenty elements into four categories, placing earth in a transcendent position that could be considered to belong to any of the other four categories. Nearly all kragraks are at least familiar with this framework, whether they believe in its organization or not. This earth-focused system is certainly not universal to followers of the Eld, and it&rsquo;s rarely used by members of other ancestries. While scholars of other ancestries might note that earth would naturally fit into the static elements to create four even groups of five elements each, many kragraks find this idea fundamentally distasteful, as it diminishes the significance of earth in the service of greater symmetry.</p>\n<p><strong>Dynamic Elements</strong>: Kragraks believe that the dynamic elements are air, fire, force, light, and lightning. Kragraks with a secondary dynamic element tend to be bold and creative. Undaunted by failure, they seek to chart new paths. At their best, they are optimistic leaders whose revolutionary outlooks inspire innovation and brush aside stagnant ideas in favor of a brighter future. At their worst, dynamic kragraks are short-sighted and destructive. Esoteric Elements: Kragraks believe that the esoteric elements are mind, music, space, spirit, and time. Kragraks with a secondary esoteric element tend to be introspective and adept at considering situations from many different viewpoints. At their best, esoteric kragraks are empathetic, imaginative, and mentally resilient, with a rich inner world. At their worst, esoteric kragraks spend so much time contemplating varied perspectives that they lose their sense of purpose, or at the other extreme, become so dedicated to abstract ideals that they are willing to perform heinous deeds to bring their goals to fruition.</p>\n<p><strong>Static Elements</strong>: Kragraks believe that the static elements are darkness, death, ice, and metal. Kragraks with a secondary static element tend to be dependable. They seek lessons from what has come before, learning from their ancestors and mentors. They are patient and prefer slow, incremental change to dramatic revolution. At their best, they are knowledgeable, reliable, and trustworthy. At their worst, static kragraks are dogmatic, judgmental, and unwilling to compromise.</p>\n<p><strong>Vital Elements</strong>: Kragraks believe that the vital elements are body, life, poison, wood, and water. Kragraks with a vital secondary element tend to be well-aware of the cycles of life that surround them. They nurture life at whatever scale feels natural to them, be it in training for physical fitness (most common among those of the body element), cultivating gardens (most common among those of the wood or poison elements), or maintaining the health of broader ecosystems (most common among those of the life and water elements). At their best, vital kragraks are caretakers of their communities and ecosystems, taking on respected roles that nurture those around them. At their worst, vital kragraks bend their understanding of life toward harmful ends, such as terrorizing others with monsters or practicing unethical science.</p>"
        },
        "Truecolor Sight": {
            "name": "真彩视野 Truecolor Sight",
            "description": "<p>你能看到大多生物甚至无法理解的可见光谱的颜色，轻松区分相似的色调，甚至可以识别可见光谱外的颜色。这可能会让一些涉及区分颜色的任务更容易完成，甚至自动完成，取决于DM的裁定。此外，你能看到大多数气（Air）、力场、虚能和命能效果，并能确切得知该效果属于以上四类中的哪一种。大多数情况下，你只有在不具备可见性时才无法看到此类效果，比如你无法看到专门为一个生物提供念动隐形（telekinetic invisibility）的力场效果。不过，如果有人故意隐藏类似效果，你可能也无法看到它，这取决于你用于@UUID[Compendium.pf2e.actionspf2e.Item.BlAOM2X92SI6HMtJ]{搜索 Seek}隐藏效果的察觉检定结果。</p>"
        }
    },
    "label": "Indigo Isles Features"
}