{
    "label": "Eldamon Actions",
    "mapping": {
        "name": "name",
        "description": "system.description.value"
    },
    "entries": {
        "Elemental Shield": {
            "name": "元素护盾 Elemental Shield",
            "description": "<p>你召唤你的元素形成一面盾牌，它漂浮在你的头顶，或在你的手中以增强保护。你从元素护盾中获得AC上的+1环境加值，直到你下回合开始。你还会根据你的元素获得元素护盾的增益。如果你在护盾仍处于激活状态时再次使用元素护盾，先前的护盾就会结束，同时会出现一面新的护盾。</p>"
        },
        "I Know This!": {
            "name": "我知道这个！ I Know This!",
            "description": "<p><strong>需求</strong> 你处于脱离相位状态，且你的一个爱达梦处于进入相位状态。</p>\n<hr />\n<p>尽管你处于脱离相位，使你的思维过程与永恒的元素同步缓慢移动，但当你看到你可能知道的东西时，你还是会设法借用一下你的相位，使你的思维集中起来，这样你就可以向你的爱达梦和其他盟友喊出信息。你可以回忆知识并传递信息。即使你在脱离相位时通常无法行动，你也可以使用这个动作。</p>"
        },
        "Refresh": {
            "name": "刷新 Refresh",
            "description": "<p>你重新调整周围的各种元素能量，从而刷新你的威能。你可以重新使用所有主动和被动的威能。</p>\n<hr />\n<p><strong>特殊</strong> 刷新动作获得与你相关的元素特征。</p>"
        },
        "Retract Tether": {
            "name": "收回系链 Retract Tether",
            "description": "<p><strong>需求</strong> 你处于脱离相位，你的一只受训爱达梦处于进入相位，且你没有使用解除系链（Untether）来解除你与进入相位的爱达梦之间的系链。</p>\n<hr />\n<p>你可以训练自己和爱达梦，以便在它们进入相位时利用你们之间的系链，化限制为优势，来让爱达梦可以瞬间反回到你的位置。你的爱达梦会沿着它的玄学系链移动到与你当前位置的相邻空间。由于它不会穿过任何间隔空间，因此它在穿过这些空间时不会触发反应动作，但它在最初和最后空间的移动仍会触发反应动作。</p>"
        },
        "Siphoning Element": {
            "name": "虹吸元素 Siphoning Element",
            "description": "<p>你改变一个元素威能，以吸取或消除目标或区域内的元素能量，而不是显现元素。如果你接下来使用的动作是引导一个元素威能，那么这个威能造成的伤害减半，并且除了伤害之外的所有额外效果（例如持续伤害、强制移动、困难地形、临时生命值）都会消失。作为交换，伤害变为无属性，使其能够影响通常对伤害免疫的生物。如果这个力量通常造成活力伤害，那么这样可以使其对活生物或构造体造成伤害；如果它通常造成虚空伤害，那么这样可以使其对不死生物或构造体造成伤害。当使用一个需要额外效果才能造成伤害的力量时（例如一个根据移动距离产生伤害或具有区域效果的力量），虹吸元素将没有任何效果。</p>"
        },
        "Elemental Surge": {
            "name": "元素涌动 Elemental Surge",
            "description": "<p><strong>需求</strong> 你这回合还未使用过威能或元素涌动</p>\n<hr />\n<p>你用你的元素制造一次小规模的涌动，而不是使用一个威能。这回合你不能使用威能，但在你下一回合，当你第一次使用一个主动威能时，你会根据你的元素获得元素涌动效果，这个效果可以在威能的正常效果之前或之后应用（由你选择）。如果效果指定它影响一个生物，它会影响一个你选择的生物，这个生物可以是你自己、你的威能的目标，或者在威能影响范围内的一个生物。如果效果指定它影响你，你就会获得这个效果的好处。</p>"
        },
        "You Can Do It!": {
            "name": "你能做到的！ You Can Do It!",
            "description": "<p><strong>需求</strong> 你处于脱离相位状态，且你的一个爱达梦处于进入相位状态。</p>\n<hr />\n<p>即使你处于脱离相位了，你也能向你的爱达梦朋友发出鼓励的信息，帮助它们完成下一个任务。进行一次交涉检定对抗DC 15。如果成功，你的爱达梦在本回合结束前下一次攻击掷骰或技能检定上获得+1环境加值。如果大成功，它将改为获得+2环境加值。即使你在脱离相位时通常无法行动，你也可以使用这个动作。</p>\n<hr />\n<p>@UUID[Compendium.battlezoo-eldamon-pf2e.effects.Item.UVElzamzIzpvGuC2]{Effect: You Can Do It!}</p>"
        },
        "Fluctuating Phase": {
            "name": "波动相位移动 Fluctuating Phase",
            "description": "<p>你与你的爱达梦一起训练如何利用你们的相位共享来发挥它们的优势，让它们可以部分脱离相位以避免成为各种效果的目标。当你的爱达梦使用波动相位时，直到你的下个回合开始，任何尝试以你的爱达梦为目标进行攻击、法术或其他效果的生物都必须通过一次DC 5@Check[type:flat|dc:5]的纯骰检定。如果失败，效果将随着你的爱达梦的短暂消失而被浪费。</p>"
        },
        "Interstitial Phase": {
            "name": "间隙相位移动 Interstitial Phase",
            "description": "<p>你已经训练好了你的爱达梦，可以在两个爱达梦之间快速交换相位，同时在你短暂的进入相位时间内采取自己的快速动作。你当前进入相位的爱达梦会使用相位移动爱达梦切换到另一个爱达梦。在第一个爱达梦脱离相位后和下一个爱达梦进入相位前，你（爱达梦训练家）可以选择执行一个单动作。</p>"
        },
        "Phase Eldamon": {
            "name": "相位移动 Phase Eldamon",
            "description": "<p><strong>需求</strong> 你和你的爱达梦本回合尚未行动。</p>\n<hr />\n<p>你将自己在物质位面（如果不在物质位面，则在当前位面）的相位与爱达梦的相位互换。从你准备好的爱达梦中选择一个，它必须与你相邻或处于你所在的方格中，并且必须为你的等级或更低的等级，然后将它以战斗型（或进化型，如果它获取了此形态的话）完全进入相位物质位面（或你当前的位面）。作为交换，你将被脱离相位。虽然爱达梦能在天生相位中更自由地行动，但凡人并不希望以这种状态存在。在出于脱离相位时，你无法行动（除非你有某种能力可以让你在脱离相位时行动）。</p>\n<p>在进入相位时，你的爱达梦使用你的先攻值，并在每个回合开始时获得动作和反应动作，而不是由你获得。爱达梦必须保持在距离你160尺的范围内，因此由于你无法行动进行移动，这就大大限制了它的移动范围。进入相位的爱达梦待在与你的效果线之外会感觉不愉快，而稳定的效果线会让它平静。因此，除非在遭遇或类似的生死关头，它们会拒绝这样做，由GM判断。爱达梦可以使用“相位移动爱达梦”来将相位切换回你身上，这是一个自由动作，而非双动作。在你的允许下，它们也可以使用“相位移动爱达梦”短暂地切换回到你身上，然后再切换到另一个爱达梦身上，这和正常情况下一样是双动作行动。当它们这样做时，新的爱达梦会出现在你的旁边或前一个爱达梦的旁边，由以前一个爱达梦选择的为准。</p>\n<p>相位转移会持续到你的爱达梦使用“相位移动爱达梦”，或者你的爱达梦的生命值降到0，以先满足为准。当你的爱达梦将相位返还给你（即使它只是在转移到另一个爱达梦时短暂返回）时，你会失去与爱达梦失去的生命值相等的生命值，并且你会受到爱达梦受到的所有其他负面效果。此外，当它脱离相位时，你的爱达梦会刷新。如果爱达梦失去的生命值使你的生命值降至0，你就会像正常情况一样陷入濒死1（如果爱达梦因受到重击或豁免大失败而生命值降至 0，则变为濒死2）。如果你的生命值因任何原因变为0，你的爱达梦会脱离相位，而你会进入相位。</p>\n<hr />\n<p><strong>特殊</strong> 在遭遇中，只要你在遭遇开始时还没有处于进入相位的爱达梦，且没有使用相位移动爱达梦或爱达梦化身（Incarnate Eldamon），你就可以用一个自由动作使用相位爱达梦，在你的回合开始时候触发。如果你如此做，你可以首先使用元素迸发（elemental effusion）能力。</p>"
        },
        "Tug Conduit": {
            "name": "牵引导流 Tug Conduit",
            "description": "<p><strong>频率</strong> 每分钟一次（此频率由你所有爱达梦共享）</p>\n<p><strong>需求</strong> 你的爱达梦自进入相位后还未使用牵引导流。</p>\n<hr />\n<p>你的爱达梦会拉扯与你共用的导流，将你拖向它。当你的爱达梦使用牵引导流时，你会部分进入相位并行走一次，但你必须向你的爱达梦直线移动，在行走的同时，你的进入相位足以触发反应动作、受到伤害和其他由你的移动造成的负面效果，如果你受到此类效果，你的行走会立即停止。</p>"
        }
    }
}
