{
    "entries": {
        "Berserker": {
            "name": "狂战士 Berserker",
            "description": "<p>这名鲁莽的战士终将成为可怕的毁灭先驱。\n</p><p><strong>近战</strong> <span class=\"pf2-icon\">1</span>弯刃大刀（叠劲，横扫），<strong>Damage</strong> 1d10 挥砍</p><p><strong>力量</strong> +3, <strong>敏捷</strong> +0, <strong>体质</strong> +2, <strong>智力</strong> +0, <strong>感知</strong> +0, <strong>魅力</strong> +2</p><p><strong>Hit Points</strong> 8</p><p><strong>追随者护甲</strong> 物品加值+3，敏捷上限+2；</p><p><strong>技能</strong> 运动，威吓，战争学识;</p><p><strong>追随者能力</strong>当狂战士受到伤害后，他们将在你的下个回合结束前的下一次伤害检定获得+1状态加值。</p><p><strong>资深进阶</strong>当狂战士晋升为资深追随者时：</p><ul><li>将他们的力量调整值提升至+4，体质调整值提升至+3。</li><li>将他们的强韧豁免和意志豁免的熟练度提升至专家。</li><li>将他们弯刃大刀的攻击伤害骰从1d10增加到2d10。</li><li>将狂战士从追随者能力获得的伤害检定状态加值提升至+2。</li></ul><p><strong>精锐进阶</strong> 当狂战士晋升为精锐追随者时：</p><ul><li>将其体质调整值提升至+4，感知调整值提升至+1，魅力调整值提升至+3。</li><li>将AC物品加值提升至+4。</li><li>将察觉熟练度提升至专家。</li><li>将运动、威吓与战争学识熟练度提升至专家。</li><li>将弯刃大刀熟练度提升至专家，并为其弯刃大刀打击的攻击检定提供+1点物品加值。其打击伤害额外增加3点，并在无视抗性时视为魔法攻击。</li><li>将狂战士通过追随者能力获得的伤害检定状态加值提升至+3。</li><li><p>狂战士获得 @UUID[Compendium.pf2e-animal-companions.AC-Features.Item.yYN5lYVfJVofjR0k]{鲁莽攻击 Reckless Attack}动作。</p></li></ul><p><strong>卓越进阶</strong> 当狂战士晋升为卓越追随者时：</p><ul><li>将其力量调整值提升至+5，敏捷调整值提升至+1，感知调整值提升至+2，魅力调整值提升至+4。</li><li>将AC物品加值提升至+5。</li><li>将强韧豁免和意志豁免熟练度提升至大师，反射豁免熟练度提升至专家。所有豁免检定获得+1物品加值。</li><li>将运动熟练度提升至大师。</li><li>将弯刃大刀攻击的物品加值提升至+2，弯刃大刀伤害骰从2d10增加到3d10，并将额外伤害从3点提升至6点。</li><li>将狂战士通过追随者能力获得的伤害状态加值提升至+4。</li><li><p>狂战士在被指挥时获得一个反应动作（若未在你的下一回合开始前消耗则失效），并获得 @UUID[Compendium.pf2e-animal-companions.AC-Features.Item.7jjDVIT39HUAnrP6]{共担痛苦 Share the Pain} 反应动作。</p></li></ul>"
        },
        "Experienced Advancement": {
            "description": "<p>你的新手追随者成为了一名资深追随者。</p>",
            "name": "资深进阶 Experienced Advancement"
        },
        "Scout": {
            "name": "斥候 Scout",
            "description": "<p>This novice lookout can become a master of traversing terrain silently to strike their foes' weak points.</p><p><strong>Melee</strong> <span class=\"pf2-icon\">1</span> shortsword (agile, finesse, versatile S), <strong>Damage</strong> 1d6 piercing</p><p><strong>Str</strong> +1, <strong>Dex</strong> +3, <strong>Con</strong> +1, <strong>Int</strong> +0, <strong>Wis</strong> +2, <strong>Cha</strong> +0</p><p><strong>Hit Points</strong> 6</p><p><strong>Kit Armor</strong> item bonus +1, Dex cap +4</p><p><strong>Skills</strong> Acrobatics, Stealth, Survival, one Lore about a specific settlement or a specific terrain</p><p><strong>Follower Ability</strong> A scout deals 1d4 extra precision damage to @UUID[Compendium.pf2e.conditionitems.Item.AJh5ex99aV6VTggg]{Off-Guard} targets.</p><p><strong>Special</strong> A scout adds Scout to the list of exploration activities that they can perform without spending your exploration activity.</p><p><strong>Experienced Advancement</strong> When the scout becomes an experienced follower:</p><ul><li>Increase their Dexterity modifier to +4 and their Wisdom modifier to +3.</li><li>Increase their proficiency rank with Reflex saves, Will saves, and Perception to expert.</li><li>Increase their shortsword Strike damage dice from 1d6 to [[/r 2d6]].</li><li><p>Add @UUID[Compendium.pf2e.actionspf2e.Item.TiNDYUGlMmxzxBYU]{Search} to the list of exploration activities the scout can perform without spending your exploration activity.</p></li></ul><p><strong>Veteran Advancement</strong> When the scout becomes a veteran follower:</p><ul><li>Increase their Strength modifier to +2, their Constitution modifier to +2, and their Intelligence modifier to +1.</li><li>Increase their item bonus to AC to +2.</li><li>Increase their proficiency rank in Acrobatics, Stealth, Survival, and their specific Lore to expert. Give them a +1 item bonus to Stealth checks.</li><li>Increase their proficiency rank in their shortsword Strikes to expert, and give them a +1 item bonus to attack rolls with their shortsword Strikes. Their Strikes deal 2 additional damage and become magical for the purposes of ignoring resistances.</li><li>Increase the extra precision damage the scout does to @UUID[Compendium.pf2e.conditionitems.Item.AJh5ex99aV6VTggg]{Off-Guard} targets to [[/r 1d6]].</li><li>The scout learns Exploit Injury.</li></ul><p><strong>Exceptional Advancement</strong> When the scout becomes an exceptional follower:</p><ul><li>Increase their Strength modifier to +3, their Dexterity modifier to +5, their Constitution modifier to +3, and their Wisdom modifier to +4.</li><li>Increase their item bonus to AC to +3.</li><li>Increase their proficiency rank in Reflex saves, Will saves, and Perception to master, and their proficiency rank in Fortitude saves to expert. Give them a +1 item bonus to all saving throws.</li><li>Increase their proficiency rank in Stealth to master, and increase their item bonus to Stealth checks to +2.</li><li>Increase their item bonus to attack rolls with their shortsword Strikes to +2. Increase their shortsword Strike damage dice from 2d6 to 3d6 and increase the additional damage that their shortsword Strikes deal from 2 to 4.</li><li>When the scout uses the Scout exploration activity, they also @UUID[Compendium.pf2e.actionspf2e.Item.IE2nThCmoyhQA0Jn]{Avoid Notice} and @UUID[Compendium.pf2e.actionspf2e.Item.TiNDYUGlMmxzxBYU]{Search}.</li></ul>"
        },
        "Sharpshooter": {
            "name": "神射手 Sharpshooter",
            "description": "<p>This trainee archer can learn to shoot with terrifying precision.</p><p><strong>Range</strong> <span class=\"pf2-icon\">1</span> shortbow (deadly d10, propulsive, range increment 60 feet, reload 0), <strong>Damage</strong> 1d6 piercing</p><p><strong>Str</strong> +0, <strong>Dex</strong> +3, <strong>Con</strong> +1, <strong>Int</strong> +0, <strong>Wis</strong> +2, <strong>Cha</strong> +1</p><p><strong>Hit Points</strong> 4</p><p><strong>Kit Armor</strong> item bonus +1, Dex cap +4</p><p><strong>Skills</strong> Acrobatics, Hunting Lore, Stealth</p><p><strong>Follower Ability</strong> The sharpshooter learns Take Aim.</p><p><strong>Experienced Advancement</strong> When the sharpshooter becomes an experienced follower:</p><ul><li>Increase their Dexterity modifier to +4 and their Wisdom modifier to +3.</li><li>Increase their proficiency rank in Fortitude saves and Reflex saves to expert.</li><li>Increase their shortbow Strike damage dice from 1d6 to [[/r 2d6]].</li><li><p>When a creature takes damage from a sharpshooter's ranged Strike, it takes a –5-foot circumstance penalty to its Speeds for 1 round, or a –10-foot circumstance penalty if the attack was a critical hit.</p></li></ul><p><strong>Veteran Advancement</strong> When the scout becomes a veteran follower:</p><ul><li>Increase their Constitution modifier to +2, their Intelligence modifier to +1, and their Charisma modifier to +2.</li><li>Increase their item bonus to AC to +2.</li><li>Increase their proficiency rank in Perception to expert.</li><li>Increase their proficiency rank in Acrobatics, Hunting Lore, and Stealth to expert. They also become an expert in Intimidation.</li><li>Increase their proficiency rank in their shortbow Strikes to expert, and give them a +1 item bonus to attack rolls with their shortbow Strikes. Their Strikes deal 2 additional damage and become magical for the purposes of ignoring resistances.</li><li><p>When the sharpshooter Takes Aim, they also ignore the target's concealment.</p></li></ul><p><strong>Exceptional Advancement</strong> When the sharpshooter becomes an exceptional follower:</p><ul><li>Increase their Dexterity modifier to +5, their Constitution modifier to +3, their Wisdom modifier to +4, and their Charisma modifier to +3.</li><li>Increase their item bonus to AC to +3.</li><li>Increase their proficiency rank in Reflex saves and Will saves to master and their proficiency rank in Fortitude saves to expert. Give them a +1 item bonus to all saving throws.</li><li>Increase their proficiency rank in Acrobatics to master.</li><li>Increase their item bonus to attack rolls with their shortbow Strikes to +2. Increase their shortbow Strike damage dice from 2d6 to 3d6 and increase the additional damage that their shortbow Strikes deal from 2 to 4.</li><li><p>The sharpshooter learns Following Shot.</p></li></ul>"
        },
        "Shieldbearer": {
            "name": "持盾手 Shieldbearer",
            "description": "<p>This aspiring bodyguard can learn to deflect the most devastating of blows.</p><p><strong>Melee</strong> <span class=\"pf2-icon\">1</span> longsword (versatile P), <strong>Damage</strong> 1d8 slashing</p><p><strong>Melee</strong> <span class=\"pf2-icon\">1</span> shield boss, <strong>Damage</strong> 1d6 bludgeoning</p><p><strong>Str</strong> +3, <strong>Dex</strong> +1, <strong>Con</strong> +2, <strong>Int</strong> +0, <strong>Wis</strong> +1, <strong>Cha</strong> +0</p><p><strong>Hit Points</strong> 8</p><p><strong>Kit Armor</strong> item bonus +5, Dex cap +1</p><p><strong>Skills</strong> Athletics, Survival, Warfare Lore</p><p><strong>Follower Ability</strong> A shieldbearer carries a shield (Hardness 5, HP 20, BT 10). They can Raise the Shield to gain a +2 circumstance bonus to AC. The shieldbearer also gains a reaction when Directed. If this reaction isn't spent before the beginning of your next turn, it is lost. Finally, they gain the Shield Block feat.</p><p><strong>Special</strong> A shieldbearer takes a –5-foot penalty to their Speeds from their heavy armor.</p><p><strong>Experienced Advancement</strong> When the shieldbearer becomes an experienced follower:</p><ul><li>Increase their Strength modifier to +4 and their Constitution modifier to +3.</li><li>Increase their proficiency rank in Fortitude and Will saves to expert.</li><li>Increase their weapons' Strike damage from one die to two dice (for instance 1d8 to 2d8).</li><li>Increase their shield's statistics to Hardness 6, HP 40, and BT 20.</li><li><p>The shieldbearer can defend you. When the shieldbearer has their shield raised, they can use their Shield Block reaction when an attack is made against you as long as they are adjacent to you. If they do, the shield prevents you from taking damage up to the shield's Hardness, but you and the shield each take any remaining damage, following the normal rules for Shield Block.</p></li></ul><p><strong>Veteran Advancement</strong> When the shieldbearer becomes a veteran follower:</p><ul><li>Increase their Constitution modifier to +4, their Intelligence modifier to +1, and their Wisdom modifier to +2.</li><li>Increase their item bonus to AC to +6. Their armor gains the bulwark trait.</li><li>Increase their proficiency rank in Perception to expert.</li><li>Increase their proficiency rank in Athletics, Survival, and Warfare Lore to expert. They become an expert in Crafting and add a repair toolkit to their kit.</li><li>Increase their proficiency rank in weapon Strikes to expert, and give them a +1 item bonus to attack rolls with their weapon Strikes. Their weapon Strikes deal 2 additional damage and become magical for the purposes of ignoring resistances.</li><li>Increase their shield's statistics to Hardness 8, HP 64, BT 32.</li><li><p>The shieldbearer can now defend anyone. The shieldbearer can use Shield Block to protect any adjacent ally, not just you.</p></li></ul><p><strong>Exceptional Advancement</strong> When the shieldbearer becomes an exceptional follower:</p><ul><li>Increase their Strength modifier to +5, their Dexterity modifier to +2, their Intelligence modifier to +2, and their Wisdom modifier to +3.</li><li>Increase their item bonus to AC to +7.</li><li>Increase their proficiency rank in Fortitude saves and Will saves to master, and their proficiency rank in Reflex saves to expert. Give them a +1 item bonus to all saving throws.</li><li>Increase their proficiency rank in Athletics to master. They become an expert in Acrobatics.</li><li>Increase their item bonus to attack rolls with their listed weapon Strikes to +2. Increase their weapon Strike damage from two dice to three dice (for instance, 2d8 to 3d8) and increase the additional damage that their weapon Strikes deal from 2 to 4.</li><li>Increase their shield's statistics to Hardness 10, HP 100, BT 50.</li><li><p>The shieldbearer gains an additional reaction when Directed, which the shieldbearer can use only to Shield Block to protect themself.</p></li></ul>"
        },
        "Exceptional Advancement": {
            "name": "卓越进阶 Exceptional Advancement",
            "description": "<p>你的精锐追随者成为了一名卓越追随者。</p>"
        },
        "Leader of All (Elf)": {
            "name": "众族领袖 Leader of All（精灵）",
            "description": "<p>You accept anyone who would follow you on your adventures. You can take followers from any common ancestry, and from uncommon or rare ancestries at the GM's discretion.</p><p>Your follower gains the traits, size, Speeds, languages, and other special abilities listed in their ancestry. For example, elf followers have the elf and humanoid traits, a 30-foot speed, low-light vision, and the typical languages for elves.</p><p>Followers don't use their ancestry's Hit Points or attribute boosts and flaws. They also don't gain abilities that would allow them to use actions beyond the standard ones available to a follower, such as Activating an Item or Casting a Spell.</p><hr /><p><em>Note:</em> This feat has been set up for an elf follower. For other ancestries set the senses and languages from the details tab, and traits and base speed from the rules tab. If needed, see the Creature Size rule element in the <a href=\"https://github.com/foundryvtt/pf2e/wiki/Quickstart-guide-for-rule-elements#creature-size\">quickstart guide for rule elements</a>.</p>"
        },
        "Medic": {
            "name": "医师 Medic",
            "description": "<p>这位医疗实习生将能掌握把濒死者从死亡边缘拉回人间的医术。</p><p><strong>近战</strong> <span class=\"pf2-icon\">1</span> 手术刀（娴熟，致命d8，灵巧，多用S）, <strong>伤害</strong>1d4 穿刺（效果等同匕首）</p><p><strong>力量</strong> +0, <strong>敏捷</strong> +2, <strong>体质</strong> +1, <strong>智力</strong> +1, <strong>感知 </strong> +3, <strong>魅力</strong> +0</p><p><strong>Hit Points</strong> 6</p><p><strong>追随者护甲</strong>物品加值+1，敏捷上限+4；</p><p><strong>技能</strong> 草药学学识，医疗，自然，生存;</p><p><strong>追随者能力</strong>医师拥有 @UUID[Compendium.pf2e.feats-srd.Item.wYerMk6F1RZb0Fwt]{战地医疗 Battle Medicine} 技能专长。其装备包含医疗工具包。</p><p><strong>资深进阶</strong> When the medic becomes an experienced follower:</p><ul><li>Increase their Dexterity modifier to +3 and their Wisdom modifier to +4.</li><li>Increase their proficiency rank in Fortitude saves and Will saves to expert.</li><li>Increase their proficiency rank in Medicine to expert.</li><li>Increase their scalpel Strike damage dice from 1d4 to 2d4. Their scalpel Strikes deal 1 persistent bleed damage (1d6 persistent bleed damage on a critical hit).</li><li><p>Once per day, the medic can use Battle Medicine on a creature that is temporarily immune.</p></li></ul><p><strong>Veteran Advancement</strong> When the medic becomes a veteran follower:</p><ul><li>Increase their Strength modifier to +1, their Dexterity modifier to +4, and their Constitution modifier to +2.</li><li>Increase their item bonus to AC to +2.</li><li>Increase their proficiency rank in Perception to expert.</li><li>Increase their proficiency rank in Medicine to master, and their proficiency rank in Herbalism Lore, Nature, and Survival to expert. Give them a +1 item bonus to Medicine checks.</li><li>Increase their proficiency rank in their scalpel Strikes to expert, and give them a +1 item bonus to attack rolls with their scalpel Strikes. Their scalpel Strikes deal 2 additional damage and become magical for the purposes of ignoring resistances.</li><li><p>The medic can use @UUID[Compendium.pf2e-animal-companions.AC-Features.Item.ma45EqTK72KQLca3]{Medic's Treatment}.</p></li></ul><p><strong>Exceptional Advancement </strong>When the medic becomes an exceptional follower:</p><ul><li>Increase their Strength modifier to +2, their Constitution modifier to +3, their Intelligence modifier to +2, and their Wisdom modifier to +5. Increase their item bonus to AC to +3.</li><li>Increase their proficiency rank in Fortitude and Will saves to master, and their proficiency rank in Reflex saves to expert. Give them a +1 item bonus to all saving throws.</li><li>Increase their item bonus to Medicine checks to +2. They become an expert in Acrobatics. Increase their item bonus to attack rolls with their scalpel Strikes to +2. Increase their scalpel Strike damage dice from 2d4 to 3d4 and increase the additional damage that their scalpel Strikes deal from 2 to 4. Increase the persistent bleed their scalpel Strikes deal to 2 (or 2d6 on a critical hit).</li><li>Once per hour, the medic can use Battle Medicine on a creature that is temporarily immune. The medic can use @UUID[Compendium.pf2e-animal-companions.AC-Features.Item.32cPs0J3Dk19Q743]{Quick Treatment}.</li></ul>"
        },
        "Veteran Advancement": {
            "name": "精锐进阶 Veteran Advancement",
            "description": "<p>Your experienced follower becomes a veteran follower.</p>"
        }
    },
    "label": "追随者 Followers",
    "mapping": {
        "description": "system.description.value",
        "gmnote": "system.description.gm"
    },
    "folders": {
        "Advancements": "进阶 Advancements",
        "Feats": "专长 Feats"
    }
}
