{
    "entries": {
        "Magnegor": {
            "name": "Magnegor",
            "items": {
                "Metal Allergy": {
                    "name": "Metal Allergy",
                    "description": "<p>When a magnegor takes damage from a metal weapon or an effect with the metal trait, it takes 5 additional damage and must succeed at a @Check[type:flat|dc:5] or become @UUID[Compendium.pf2e.conditionitems.Item.fesd1n5eVhpCSS18]{Sickened 1}. The value of the sickened condition increases each time the magnegor fails such a check, to a maximum of 3.</p>"
                },
                "Excavating Spines": {
                    "name": "Excavating Spines",
                    "description": "<p>The magnegor inadvertently digs a 10-foot-deep continuous trench in any square it Wallows through, as long as the ground in that space isn't made of stone, rock, or some other surface too hard to excavate. The trench is greater difficult terrain. At the GM's discretion, any excavated square can reveal a deposit of sedimentary rock filled with metal ore that has Hardness 7 and 28 Hit Points.</p>"
                },
                "Wallow": {
                    "name": "Wallow"
                },
                "Magnetized Coat": {
                    "name": "Magnetized Coat",
                    "description": "<p>Magnetized Coat When a magnegor comes within 30 feet of a metal object or a deposit of metal ore, its thousands of wiry hairs stand on end, pointing towards the metal and creating a magnetic field. Metal items of light or negligible Bulk that touch the magnegor's coat adhere to it magnetically, requiring an Interact action to be pried free. Creatures wearing or primarily composed of metal treat all squares in a 10-foot radius around the magnegor as difficult terrain, unless they are moving directly towards it.</p>"
                }
            },
            "prototypeToken": {
                "name": "Magnegor"
            },
            "data": {
                "placeHolder": "placeHolder"
            }
        }
    },
    "label": "pf2e.howl-of-the-wild-bestiary"
}
