{
    "entries": {
        "Animated Wine Vessel": {
            "items": {
                "Wine-Soaked": {
                    "name": "溺酒 Wine-Soaked",
                    "description": "<p>当生物在被活化酒器活吞时结束回合，它必须成功通过一次@Check[type:fortitude|dc:19]豁免，否则陷入@UUID[Compendium.pf2e.conditionitems.Item.fesd1n5eVhpCSS18]{恶心 Sickened 1}。</p>"
                },
                "Construct Armor (Hardness 4)": {
                    "name": "构装护甲 Construct Armor (硬度 4)",
                    "description": "<p>与普通的物体一样，活化酒器同样拥有硬度。硬度可以减少其所受到的任何伤害，其数值等同于硬度的数值。一旦活化酒器的生命值降低至一半以下，或是受到重击伤害后，其构装护甲将会破损，其AC降低至17。</p>"
                },
                "Spit Wine": {
                    "name": "喷酒 Spit Wine",
                    "description": "<p>酒器张开嘴，朝@Template[type:line|distance:15]范围喷出一股酒水，造成@Damage[2d8[bludgeoning]]伤害（@Check[type:reflex|dc:19|basic:true]豁免）。</p>"
                },
                "Swallow Whole": {
                    "name": "活吞 Swallow Whole",
                    "description": "<p>中型，@Damage[(2d8+4)[bludgeoning]] 外加溺酒，破裂10</p>\n<hr />\n<p>@Localize[PF2E.NPC.Abilities.Glossary.SwallowWhole]</p>"
                }
            },
            "prototypeToken": {
                "name": "活化酒器"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "活化酒器 Animated Wine Vessel",
            "publicNotes": "<p>精美的酒器是饮酒者身份的象征，更不用说能自己斟酒的活化酒器了。虽然这些酒器通常是无害的仆人，但它们也会按照指示快速吞下入侵者，将其淹没在烈酒中。</p>",
            "ac": "破损时17；构装护甲"
        },
        "Peng": {
            "prototypeToken": {
                "name": "Peng"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Peng",
            "items": {
                "Heaven's View": {
                    "name": "Heaven's View",
                    "description": "<p>Clouds don't impair a peng's vision.</p>"
                },
                "Cloud Cover": {
                    "name": "Cloud Cover",
                    "description": "<p>The peng exhales a thick cloud and envelops themself in the mist. The peng is @UUID[Compendium.pf2e.conditionitems.Item.DmAIPqOBomZ7H95W]{Concealed} until the end of their next turn.</p>"
                },
                "Flap Wings": {
                    "name": "Flap Wings",
                    "description": "<p>The peng beats their wings to create a mighty burst of frosty air and push away foes. Each creature within 10 feet of the peng takes 4d6 bludgeoning and @Damage[4d6[cold]] damage (@Check[type:reflex|dc:32|basic:true] save). Creatures that fail their save are pushed away 10 feet; creatures that critically fail are pushed away 20 feet and knocked @UUID[Compendium.pf2e.conditionitems.Item.j91X7x0XSomq8d60]{Prone}.</p>"
                },
                "At-Will Spells": {
                    "name": "At-Will Spells",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.AtWillSpells]</p>"
                },
                "Calm Weather Aura": {
                    "name": "Calm Weather Aura",
                    "description": "<p>1 mile.</p>\n<p>The ambient weather around a peng is always lightly cloudy with a pleasant breeze, and the temperature is pleasantly warm for the season. Another creature that attempts to alter the weather within this aura (such as with a control weather ritual or localized effect like gust of wind) must succeed at a @Check[type:will|dc:32] save; otherwise, the effect is disrupted. The peng can activate or deactivate this aura as a single action with the concentrate trait.</p>"
                },
                "Windslice": {
                    "name": "Windslice",
                    "description": "<p>Pengs can move in any wind with easy grace. A peng ignores difficult terrain caused by wind and doesn't need to Maneuver in Flight in high winds.</p>"
                }
            },
            "publicNotes": "<p>A peng is a massive avian beast who flies effortlessly among the highest clouds. Their bright plumage makes it difficult to see their shape against an azure sky, but with patience, an onlooker might notice movement too swift to be a natural cloud.</p>\n<p>Beautiful and graceful, a peng arises from the unlikeliest of origins: the cruel kun, a hateful fish monster whose predilection for the crushing depths of the sea matches the peng's own love of the bright, open sky. After a kun sacrifices their power for a noble heart by bathing in the sun's rays, they transform into this majestic bird, which eschews violence unless they must fight to stay free.</p>\n<p>A peng doesn't seek danger or thrills; they want only to make their long voyages and fly without disruption. However, they sometimes come into conflict with dragons and other high-flying creatures that would hunt them or block their path. Although it's unclear to mortals what purpose a peng's journeys serve, celestial powers related to air or freedom will sometimes ask their mortal followers to assist a peng in its journey.</p>\n<p>A peng's calm and steady nature is so strong that its mere presence can quell storms and still winds. Spotting a peng is undoubtedly a sign of good luck for sailors and mariners—a feeling shared with most others lucky enough to lay eyes on these rare and beautiful creatures. When the sky is clear and blue with gentle weather for an extended period, such fine conditions can be attributed to the presence of an unseen peng.</p>"
        },
        "Five-Color Orchid Mantis": {
            "items": {
                "Harvesting Limbs": {
                    "name": "Harvesting Limbs",
                    "description": "<p>The mantis makes two leg attacks. If both attacks hit, the mantis gains 10 temporary Hit Points, and the target must succeed at a @Check[type:fortitude|dc:27] saving throw or become @UUID[Compendium.pf2e.conditionitems.Item.4D2KBtexWXa6oUMR]{Drained 1} (@UUID[Compendium.pf2e.conditionitems.Item.4D2KBtexWXa6oUMR]{Drained 2} on a critical failure). The drained condition ends when the mantis is reduced to 0 Hit Points.</p>"
                },
                "Sudden Strike": {
                    "name": "Sudden Strike",
                    "description": "<p>On the first round of combat, creatures that haven't acted are @UUID[Compendium.pf2e.conditionitems.Item.AJh5ex99aV6VTggg]{Off-Guard} to the mantis.</p>"
                },
                "Floral Camouflage": {
                    "name": "Floral Camouflage",
                    "description": "<p>When Hiding, the five-color orchid mantis is @UUID[Compendium.pf2e.conditionitems.Item.DmAIPqOBomZ7H95W]{Concealed} by any amount of leaves or petals, even if they aren't thick enough to make other creatures concealed.</p>"
                },
                "Elemental Expulsion": {
                    "name": "Elemental Expulsion",
                    "description": "<p><strong>需求</strong> The mantis has an elemental trait from Color Shift</p>\n<p><strong>触发</strong> It's damaged by a weapon Strike</p>\n<hr />\n<p><strong>效果</strong> Elemental energy pushes back against the blow, giving the attacker a –2 status penalty to attack rolls until the beginning of its next turn. If the weapon contains material that matches the mantis's trait (such as earth for a thrown rock or fire for a lit torch), the mantis gains resistance 10 to all damage from this Strike.</p>"
                },
                "Color Shift": {
                    "name": "Color Shift",
                    "description": "<p><strong>Frequency</strong> once per round</p>\n<hr />\n<p><strong>效果</strong> The mantis attunes itself to one of five elements, changing color accordingly (yellow for earth, red for fire, white for metal, black for water, or green for wood). It gains that trait and a +2 status bonus to saving throws against effects with that trait until the beginning of its next turn. If the mantis uses Color Shift on its next turn, it must choose a different color.</p>"
                }
            },
            "prototypeToken": {
                "name": "Five-Color Orchid Mantis"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Five-Color Orchid Mantis",
            "publicNotes": "<p>Few creatures appear as beautiful as the orchid mantises. Their elegant form and coloration resemble flowers, and many people adopt the delicate creatures as short-lived pets. While these mundane insects aren't dangerous to humanoids, they can still bring down prey several times their own size. Unfolding from their flowery pose, orchid mantises lash out with blinding speed, even chasing foraging butterflies with their sharp-toothed arms and powerful bite.</p>\n<hr />\n<p>Orchid mantises naturally live short lives that don't offer a great deal of time to gather spiritual energy. However, a mantis in a rich enough environment can extend their life span and grow to understand the elements. These creatures become five-color orchid mantises and, despite their violent attitudes, are thought to be especially sacred to Qi Zhong. As such, these dangerous mantises are often avoided or placated while gathering herbs rather than driven off.</p>"
        },
        "Bul-Gae": {
            "name": "火狗 Bul-Gae",
            "prototypeToken": {
                "name": "火狗"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "publicNotes": "<p>火狗是日月蚀的化身。它们看起来像大型犬科动物，不过它们的颜色和特征会随着它们操控热和冷的力量的发挥而改变。根据它们最近释放的是月蚀还是日蚀的力量，火狗分别像一条浑身燃烧着火焰的深红色猎犬或一只碧蓝色的霜冻狐狸。</p>\n<p>传说中，第一只火狗试图从天上偷走太阳。当它们咬住燃烧的天体时，火狗被严重烧伤。失败后，他们又试图夺取月亮，但当他们触碰到月亮时，火狗被冻得结结实实，掉到了地上。火狗的后代永远磨练着他们的火和冰的力量，以便有一天他们能在祖先失败的地方取得成功。</p>\n<p>传说中，火狗是第一只火狗那古老而阴暗的主人的忠实伙伴。这些故事声称，阴影之主可以透过所有火狗扭曲的光观察世间，并利用猎犬监视物质宇宙以达到未知的目的。</p>",
            "items": {
                "Eclipse Aura": {
                    "name": "蚀刻灵光 Eclipse Aura",
                    "description": "<p>100尺。</p>\n<p>火狗周围的光线奇异地变幻着。灵光范围内的非魔法明亮光照减弱为昏暗光照。当生物尝试在灵光范围内使用具有光亮特征的动作时，它必须尝试一次@Check[type:will|dc:34]豁免。失败时，该动作被打断。</p>"
                },
                "Solar Flare": {
                    "name": "太阳耀斑 Solar Flare",
                    "description": "<p><strong>触发</strong> 火狗受到伤害</p>\n<hr />\n<p><strong>效果</strong> 火狗在@Template[type:emanation|distance:30]范围内施放出一道太阳耀斑。区域内每个生物受到@Damage[6d8[fire]]伤害（@Check[type:reflex|dc:34|basic:true]豁免）。大失败时，生物还将受到@Damage[2d10[persistent,fire]]伤害。在使用此能力后，火狗的火焰冷却，它无法再次使用太阳耀斑，直到其使用了月爆能力。</p>"
                },
                "Lunar Burst": {
                    "name": "月爆 Lunar Burst",
                    "description": "<p>火狗释放出一道异界霜寒，对@Template[type:emanation|distance:10]范围内每个生物造成@Damage[6d8[cold]]伤害（@Check[type:reflex|dc:34|basic:true]豁免）。大失败时，生物还将陷入@UUID[Compendium.pf2e.conditionitems.Item.xYTAsEpcJE1Ccni3]{缓慢 Slowed 2}一轮。在使用此能力后，火狗的火焰升温，它无法再次使用月爆，直到其使用了太阳耀斑反应动作。</p>"
                },
                "Shadow Leap": {
                    "name": "影跃 Shadow Leap",
                    "description": "<p><strong>需求</strong> 火狗处于昏暗光照或黑暗中</p>\n<hr />\n<p><strong>效果</strong> 火狗遁入阴影，然后在40尺内的阴影中重新出现。</p>"
                },
                "Thermal Mastery": {
                    "name": "热能掌控 Thermal Mastery",
                    "description": "<p>火狗能够完全掌控寒冷与火焰的力量。它每次使用颚咬进行攻击时，它可以选择额外伤害造成寒冷伤害还是火焰伤害。</p>"
                }
            }
        },
        "The Great Flood": {
            "items": {
                "Coordinated Actions": {
                    "description": "<p>The Great Flood's multiple heads allow them to act on two separate initiatives, rolling initiative twice and acting on both results. They can't Delay. At the start of each of their turns, they gain 2 actions (see Multiple Reactions below for reactions). Any ability that would sever one of the Great Flood's heads doesn't cause the Great Flood to die if they still have at least one head, but it does cause them to lose the additional reaction granted by the severed head.</p>",
                    "name": "Coordinated Actions"
                },
                "Leading Head": {
                    "name": "Leading Head"
                },
                "Scent (Imprecise) 120 feet": {
                    "name": "Scent (Imprecise) 120 feet",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.Scent]</p>"
                },
                "Bitter Breath": {
                    "name": "Bitter Breath",
                    "description": "<p>90 feet.</p>\n<p>If a creature ends its turn in the aura, it's exposed to the Great Flood's flood breath disease.</p>"
                },
                "Multiple Reactions": {
                    "name": "Multiple Reactions",
                    "description": "<p>The Great Flood gains an extra reaction per round for each of its nine heads, which they can use only to make Reactive Strikes with their jaws. They can't use more than 1 reaction on the same triggering action, even if a creature leaves several squares within the Great Flood's reach, and they gain reactions on only their first turn each round.</p>"
                },
                "Reactive Strike": {
                    "name": "Reactive Strike",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.ReactiveStrike]</p>"
                },
                "Flood Breath": {
                    "name": "Flood Breath",
                    "description": "<p><strong>Saving Throw</strong> @Check[type:fortitude|dc:42]</p>\n<hr />\n<p><strong>Stage 1</strong> @UUID[Compendium.pf2e.conditionitems.Item.4D2KBtexWXa6oUMR]{Drained 1} (1 day)</p>\n<p><strong>Stage 2</strong> @UUID[Compendium.pf2e.conditionitems.Item.4D2KBtexWXa6oUMR]{Drained 2} (1 day)</p>\n<p><strong>Stage 3</strong> drained 2 and @UUID[Compendium.pf2e.conditionitems.Item.3uh1r86TzbQvosxv]{Doomed 1} (1 day)</p>\n<p><strong>Stage 4</strong> You die and your body collapses, releasing a cloud of toxin. Any creature within @Template[type:emanation|distance:10]{10 feet} of your death is exposed to flood breath (1 day)</p>"
                },
                "Great Wave": {
                    "name": "Great Wave",
                    "description": "<p><strong>Frequency</strong> once per day</p>\n<hr />\n<p><strong>效果</strong> The Great Flood gathers all nearby water and floods a mile burst. Any creature in the area must succeed at a @Check[type:reflex|dc:42] save or be moved up to 60 feet in a direction of the Great Flood's choice. The area remains flooded with 30-foot-deep water for 1 hour or until the Great Flood dies, then drains naturally.</p>"
                },
                "Nine-Jawed Frenzy": {
                    "name": "Nine-Jawed Frenzy",
                    "description": "<p><strong>需求</strong> It's the Great Flood's second turn in the round (see Coordinated Actions)</p>\n<hr />\n<p><strong>效果</strong> The Great Flood Strides or Swims twice, moving through smaller creatures' spaces freely. Each creature they move through or are adjacent to takes @Damage[(4d8+20)[piercing]] damage (@Check[type:reflex|dc:42|basic:true] save). Creatures that fail the save are also exposed to flood breath.</p>"
                }
            },
            "prototypeToken": {
                "name": "The Great Flood"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "The Great Flood",
            "publicNotes": "<p>There are few creatures capable of such ecological destruction while staying as humorous and lighthearted as the Great Flood. The Great Flood towers with their giant serpent body and nine humanoid heads, each one with a different personality, though all serve the same purpose—to vanquish all signs of life that shouldn't be where they are. This creature intends to maintain the balance of the universe, ensuring that nothing takes up more space than necessary. Unfortunately, the judgment of where someone or something should be is only seen and weighed by the 18 eyes of the Great Flood, with little regard to mortal input.</p>\n<p>The Great Flood is an immortal, or at least ageless, being who hibernates for 12 years at a stretch. On the thirteenth year, they emerge from the depths of the oceans and begin weighing the state of the world and the environments closest to their resting place: should the first thing they see on dry land be destroyed? Each of the Great Flood's nine heads lends their thoughts and insights to this deliberation, and upon reaching a consensus, they'll either carry on to the next location or they'll drown the land, immersing miles of dry land in salty waters from the ocean. In instances where they perceive the excess life as particularly problematic, they'll even decide to poison the waters with their bitter breath to ensure that nothing survives the judgment they've decreed. The Great Flood, despite its inherently destructive nature, isn't actually bloodthirsty and will often afford an opportunity for poor townsfolk to state their case and beg for the lives of their town to be saved. While the Great Flood has the capacity for mercy and consideration, the godlike creature stands adamant once they've made their decision. One or two of the heads might feel a twinge of guilt and tell a small joke to the townsfolk, relieving themselves of the mental pressure, before murdering an entire village.</p>\n<p>The nine personalities of the serpentine creature often run into contention with each other. One is a perfectionist, while another is aloof; one is assertive, while another is playful; one is capricious, while another is suspicious; one is ambitious, while the other is a people pleaser. The last one is quiet and secretive, only ever whispering to the heads closest to them. Though the heads squabble like siblings, they eventually always make a compromise.</p>"
        },
        "Ijhyeojin": {
            "items": {
                "Easy to Call": {
                    "name": "Easy to Call",
                    "description": "<p>An ijhyeojin's level is considered 2 lower for the purpose of being conjured by the @UUID[Compendium.pf2e.spells-srd.Item.vgy00hnqxN9VoeoF]{Planar Servitor} ritual (and potentially other rituals, at the GM's discretion), but they're always free to attack or leave instead of negotiate unless the primary caster's check is a critical success.</p>"
                },
                "Swipe Countenance": {
                    "name": "Swipe Countenance",
                    "description": "<p><strong>需求</strong> The ijhyeojin's previous action was a successful claw Strike against the target</p>\n<hr />\n<p><strong>效果</strong> The ijhyeojin copies the countenance of the target, imprinting it perfectly onto their own blank face. While only their face changes, creatures must @UUID[Compendium.pf2e.actionspf2e.Item.BlAOM2X92SI6HMtJ]{Seek} them and succeed at a @Check[type:will|dc:34] save to distinguish them visually from the original creature. The sakhil keeps the same visage for 24 hours or until they steal another.</p>"
                },
                "At-Will Spells": {
                    "name": "At-Will Spells",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.AtWillSpells]</p>"
                },
                "Constant Spells": {
                    "name": "Constant Spells",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.ConstantSpells]</p>"
                },
                "Forgotten Presence": {
                    "name": "Forgotten Presence",
                    "description": "<p><strong>触发</strong> The ijhyeojin critically succeeds at a saving throw against a spell</p>\n<hr />\n<p><strong>效果</strong> The ijhyeojin redirects the triggering spell to a new target other than its caster. If the ijhyeojin is wearing that target's face, the new target takes a –2 circumstance penalty to this saving throw.</p>"
                },
                "Overwrite Memory": {
                    "name": "Overwrite Memory",
                    "description": "<p>The ijhyeojin alters the memories of a target within 30 feet, insinuating their faceless visage in the place of others. The target must attempt a @Check[type:will|dc:34] save.</p>\n<hr />\n<p><strong>大成功</strong> The target is unaffected.</p>\n<p><strong>成功</strong> The target is @UUID[Compendium.pf2e.conditionitems.Item.TBSHQspnbcqxsmjL]{Frightened 1} and treats no one as an ally for as long as it's frightened.</p>\n<p><strong>失败</strong> The target is @UUID[Compendium.pf2e.conditionitems.Item.TBSHQspnbcqxsmjL]{Frightened 2} and is @UUID[Compendium.pf2e.conditionitems.Item.yblD8fOR1J8rDwEQ]{Confused} for as long as it's frightened.</p>\n<p><strong>大失败</strong> The target is @UUID[Compendium.pf2e.conditionitems.Item.TBSHQspnbcqxsmjL]{Frightened 4} and confused for as long as it's frightened. If the target is a joseung saja, they instead realize the fear of being forgotten and become an ijhyeojin.</p>"
                }
            },
            "prototypeToken": {
                "name": "Ijhyeojin"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Ijhyeojin",
            "publicNotes": "<p>Ijhyeojins (ee-jyuh-jeens) were once joseung sajas, psychopomps who guided the dead to the Boneyard as divine punishment for their sins. Over time, they rejected their roles and became sakhils. Some did this due to a sense of injustice over having to atone for their sins in the afterlife, but all do so partially out of a desperate desire to reclaim their memories—for ijhyeojins are named for the fear they manifest, the fear of being forgotten. They prey on people who are socially isolated by circumstances or those obsessed with their legacy, slowly cutting their victims off from friends, professional contacts, and family. Ijhyeojins particularly enjoy infiltrating medical facilities to prey on patients who fear about being forgotten in their deaths, snatching away crucial memories from them or their visiting loved ones. Hunting in this way also grants the sahkils ideal positioning to lure joseung sajas to their demise.</p>\n<p>Ijhyeojins resemble the pale-skinned psychopomps they used to be, except their faces have no distinguishable features, like a skull with a smooth layer of skin pulled over it. Their bodies continue to twist and grow the longer they live.</p>"
        },
        "Pixiu": {
            "prototypeToken": {
                "name": "Pixiu"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Pixiu",
            "items": {
                "Goldsense (Precise) 120 feet": {
                    "name": "Goldsense (Precise) 120 feet",
                    "description": "<p>The pixiu can detect the presence, location, and approximate value of gold within 120 feet.</p>"
                },
                "Good Fortune": {
                    "name": "Good Fortune",
                    "description": "<p><strong>触发</strong> The pixiu, or an ally within 30 feet, is about to attempt a saving throw but hasn't rolled yet</p>\n<p><strong>Frequency</strong> once per hour</p>\n<hr />\n<p><strong>效果</strong> That creature rolls the triggering saving throw twice and takes the better result.</p>"
                },
                "Stored Wealth": {
                    "name": "Stored Wealth",
                    "description": "<p>Pixius can eat gold and gems with no adverse effects. A pixiu's belly can hold any number of gold pieces, usually around 100. Whenever it takes slashing or piercing damage, a number of gold pieces equal to the damage falls from its belly to the ground in its square.</p>"
                },
                "Devour Wealth": {
                    "name": "Devour Wealth",
                    "description": "<p><strong>需求</strong> The pixiu's previous action was a successful jaws Strike</p>\n<hr />\n<p><strong>效果</strong> The pixiu swallows up to [[/r 2d12]] gold pieces on the target's person and gains temporary Hit Points equal to the amount devoured. These temporary Hit Points last for 1 minute.</p>"
                },
                "Trample": {
                    "name": "Trample",
                    "description": "<p>Medium or smaller, claw, @Check[type:reflex|dc:26|basic:true]</p>\n<hr />\n<p>@Localize[PF2E.NPC.Abilities.Glossary.Trample]</p>"
                }
            },
            "publicNotes": "<p>To witness a pixiu (pee-shee-oh) is a blessing indeed—and a sight to behold. This winged, dragon-headed lion has a formidable appearance that belies its youthful exuberance. Legend claims it was this overenthusiastic playfulness that caused the first of their kind to be banished from heaven, cursed to gather wealth and never let it go. Whatever the case, each pixiu has an uncanny ability to sniff out gold, which it loves to eat. Curiously, a pixiu's touch is also able to sunder curses and censure malign spirits, perhaps a remnant of its lost divinity.</p>\n<p>Due to its celestial background and ability to exorcise curses, a pixiu is also believed to be a bringer and protector of prosperity, attracting good fortune and fending off evil spirits. Its heavenly origins and love of wealth may be the reason why imperial dragons have cared for them since time immemorial, valuing them as guardians and loyal companions. In particular, underworld dragons employ pixius to expand their hoards, and many sovereign dragons value them as status symbols. In dragon-ruled realms across Tian Xia, the presence of a pixiu within a community is seen as a sign of its draconic patron's approval and goodwill.</p>\n<p>Despite the protection of imperial dragons, the lure of wealth is still enough to drive some to attack a pixiu. Although a pixiu will rarely forgive an attacker, it prefers to withdraw peacefully from those it judges as purehearted but desperate. A pixiu's draconic masters, however, aren't always as forgiving.</p>"
        },
        "Joseung Saja": {
            "items": {
                "At-Will Spells": {
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.AtWillSpells]</p>",
                    "name": "At-Will Spells"
                },
                "Constant Spells": {
                    "name": "Constant Spells",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.ConstantSpells]</p>"
                },
                "Reap Memory": {
                    "name": "Reap Memory",
                    "description": "<p>The joseung saja looks into the eyes of a creature within 30 feet and removes inconvenient or painful memories that are preventing it from moving on to death. The target is aware that the joseung saja attempted to alter its memory and can attempt a Will save to resist. Willing targets receive the effects of a critical failure.</p>\n<hr />\n<p><strong>大成功</strong> The target is unaffected.</p>\n<p><strong>成功</strong> The target takes @Damage[2d10[mental]] damage and is @UUID[Compendium.pf2e.conditionitems.Item.e1XGnhKNSQIm5IXg]{Stupefied 2} for 1 round.</p>\n<p><strong>失败</strong> The target takes @Damage[4d10[mental]] damage and is stupefied 2 for 1 week.</p>\n<p><strong>大失败</strong> The target loses all painful emotions and memories, leaving an indistinct haze. If the target is an ijhyeojin, then all of their memories are reaped and they become a joseung saja.</p>"
                },
                "Reap Souls": {
                    "name": "Reap Souls",
                    "description": "<p><strong>触发</strong> The joseung saja brings a target to 0 Hit Points or successfully Strikes a target with the dying condition</p>\n<hr />\n<p><strong>效果</strong> The target must succeed at a @Check[type:will|dc:34] save or immediately die. A reaped creature can't be return to life or become undead except by a 9th-rank or higher ritual.</p>"
                },
                "Shifting Form": {
                    "name": "Shifting Form",
                    "description": "<p>The joseung saja is incorporeal until the end of their next turn. While they're incorporeal, they have resistance 10 to all damage (except force, void, and ghost touch weapons).</p>"
                },
                "Spirit Touch": {
                    "name": "Spirit Touch",
                    "description": "<p>A joseung saja's Strikes all have the effects of a ghost touch property rune and deal an extra @Damage[3d6[void]] damage to living creatures and @Damage[3d6[vitality]] damage to undead.</p>"
                }
            },
            "prototypeToken": {
                "name": "Joseung Saja"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Joseung Saja",
            "publicNotes": "<p>Joseung saja (jo-seung sah-jah) is a name sometimes bestowed on creatures in the afterlife who have committed grave sins in their lifetimes. Known also as reapers, these pale and sunken-eyed creatures are psychopomps—beings who guide the souls of the dead to the Boneyard. No one knows the specific criteria for one to become joseung sajas, but those who are selected have their memories erased and must work as joseung sajas until they've been deemed to have fully atoned for their sins.</p>\n<p>Joseung sajas from different eras wander the world, and when a creature nears death, one will appear and await the target's demise as their afterlife guide. When needed, they even alter their target's memories to remove painful emotions that might chain them to the mortal world, easing them into a peaceful death. This duty prevents those who die tragic or violent deaths from becoming bound to the world as ghosts—a mercy, though one often unappreciated by the wards of joseung sajas. If a creature targeted by a joseung saja becomes undead or otherwise cheats death, the reaper must fulfill their duty of granting the creature a true death.</p>\n<p>Because joseung sajas linger among mortals in order to perform their duties, they're one of the most commonly seen psychopomps.</p>"
        },
        "Animated Bamboo Figurine": {
            "name": "活化竹人 Animated Bamboo Figurine",
            "prototypeToken": {
                "name": "活化竹人"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "publicNotes": "<p>编织成复杂图案的柔软而结实的竹条，构成了活化竹人的底座。这些材料来源丰富，容易获得，虽然制作过程需要极大的细心和耐心，但它们是偏远社区的理想守护者。这些中空柔韧的手工艺品可以拉伸或压缩，跳跃和弹跳的距离比大多数类人生物都要远。</p>",
            "ac": "破损时AC16；构装护甲",
            "items": {
                "Construct Armor (Hardness 3)": {
                    "name": "构装护甲 Construct Armor (硬度 3)",
                    "description": "<p>与普通的物体一样，活化竹人同样拥有硬度。硬度可以减少其所受到的任何伤害，其数值等同于硬度的数值。一旦活化竹人的生命值降低至一半以下，或是受到重击伤害后，其构装护甲将会破损，其AC降低至16。</p>"
                },
                "Spring Forward": {
                    "name": "弹跳冲击 Spring Forward",
                    "description": "<p>活化竹人跳跃至多30尺，然后对不同目标进行两次拳头打击。它可以在此行动之后使用击倒，对每个被打击的生物尝试@UUID[Compendium.pf2e.actionspf2e.Item.ge56Lu1xXVFYUnLP]{摔绊 Trip}。</p>"
                }
            }
        },
        "Nue": {
            "prototypeToken": {
                "name": "Nue"
            },
            "items": {
                "Viper Tail": {
                    "name": "Viper Tail",
                    "description": "<p><strong>触发</strong> A creature within 15 feet of the nue leaves a square during a move action it's using or moves into a square that would cause the nue to become flanked</p>\n<hr />\n<p><strong>效果</strong> The nue whips around and attempts a tail Strike against the triggering creature. This Strike doesn't count toward the nue's multiple attack penalty, and its multiple attack penalty doesn't apply to this Strike.</p>"
                },
                "Cloud Form": {
                    "name": "Cloud Form",
                    "description": "<p>The nue changes its shape into that of a dark storm cloud. In Cloud Form, the nue is @UUID[Compendium.pf2e.conditionitems.Item.DmAIPqOBomZ7H95W]{Concealed}, gains a 60-foot fly Speed, gains a +4 status bonus to its Deception DC to prevent others from seeing through its disguise, and can't make attacks, though it can use its howl abilities. The nue can Dismiss this effect.</p>"
                },
                "Monstrous Howl": {
                    "name": "Monstrous Howl",
                    "description": "<p>The nue lets out an eerie howl that rattles creatures' very souls. Creatures within 60 feet must attempt a @Check[type:will|dc:27] save (DC 29 at night). They're then temporarily immune to Monstrous Howl for 10 minutes.</p>\n<hr />\n<p><strong>大成功</strong> The creature is unaffected.</p>\n<p><strong>成功</strong> The creature takes @Damage[2d8[persistent,void]] damage.</p>\n<p><strong>失败</strong> As success, plus the target is @UUID[Compendium.pf2e.conditionitems.Item.4D2KBtexWXa6oUMR]{Drained 1}.</p>\n<p><strong>大失败</strong> As success, plus the target is @UUID[Compendium.pf2e.conditionitems.Item.4D2KBtexWXa6oUMR]{Drained 2} and @UUID[Compendium.pf2e.conditionitems.Item.dfCMdR4wnpbYNTix]{Stunned 1}.</p>"
                },
                "Thundering Howl": {
                    "name": "Thundering Howl",
                    "description": "<p>The nue howls to the sky, calling down a bolt of lightning that strikes the creature closest to the nue, to a maximum range of 60 feet. The bolt deals @Damage[12d6[electricity]] damage (@Check[type:reflex|dc:27|basic:true] save). The nue then can't use Thundering Howl for [[/br 1d4 #rounds]]{1d4 rounds}.</p>"
                }
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Nue",
            "publicNotes": "<p>A nue is an ancient creature of enormous size and destructive power. Though sightings are rare, it's described as having the head of a monkey, the body of a tanuki, the limbs of a tiger, and a snake for a tail. The beast's eerie body is matched by its ability to drain the life force of those around it just by howling.</p>\n<p>According to certain tales, in ancient times, a nue would freely terrorize kingdoms and inflict nightmares upon it victims. It first appears as an enormous storm cloud before turning a poisonous black color. When angered, a nue can summon lightning to cause massive amounts of collateral damage. Hearing a nue's howl is considered an ill omen.</p>"
        },
        "Kun": {
            "items": {
                "Light Blindness": {
                    "name": "强光致盲 Light Blindness",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.LightBlindness]</p>"
                },
                "Wavesense (Imprecise) 60 feet": {
                    "name": "水波感知 (模糊) 60 尺",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.Wavesense]</p>"
                },
                "At-Will Spells": {
                    "name": "随意施法 At-Will Spells",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.AtWillSpells]</p>"
                },
                "Spite": {
                    "name": "恶意 Spite",
                    "description": "<p><strong>触发</strong> 在鲲的尾触及范围内的生物使用动作治疗或帮助另一个生物</p>\n<hr />\n<p><strong>效果</strong> 鲲用它的尾巴拍打触发生物，对触发生物进行一次尾扫打击。若命中，触发动作被打断，该生物则被推离10尺。</p>"
                },
                "Funnel": {
                    "name": "汇吸 Funnel",
                    "description": "<p>鲲猛吸一口气，吞没@Template[type:cone|distance:60]范围内的生物与热量。生物受到@Damage[10d8[cold]]伤害且必须尝试一次@Check[type:fortitude|dc:33]豁免。鲲在[[/br 1d4 #Recharge Funnel]]{1d4轮}内不能再次使用汇吸。</p>\n<hr />\n<p><strong>大成功</strong> 生物不受影响。</p>\n<p><strong>成功</strong> 生物受到一半伤害。</p>\n<p><strong>失败</strong> 生物受到全额伤害，并被拉向鲲30尺。</p>\n<p><strong>大失败</strong> 生物受到双倍伤害，并被拉向鲲60尺。</p>"
                },
                "Heart of Darkness": {
                    "name": "黑暗之心 Heart of Darkness",
                    "description": "<p>每当鲲在黑暗区域内进行颚咬打击时，其颚咬打击会额外造成@Damage[2d6[spirit]]伤害并获得邪秽特征。</p>"
                },
                "Swallow Whole": {
                    "name": "活吞 Swallow Whole",
                    "description": "<p>超大型，@Damage[(3d12+7)[bludgeoning]]，破裂30</p>\n<hr />\n<p>@Localize[PF2E.NPC.Abilities.Glossary.SwallowWhole]</p>"
                }
            },
            "prototypeToken": {
                "name": "鲲"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "鲲 Kun",
            "publicNotes": "<p>饥肠辘辘又满腔怒火，恶毒的鲲是神话中的鱼形怪物，栖息于最遥远、最寒冷的深海。倘若它们愿意，这些无比强大的生物能轻易统治一片水下领土，但鲲也以其绝对的自我专注与对其他生命形态的矛盾心理而著称。一头鲲能离其他生物多远就有多远，只和自己冰冷的仇恨一起过活。它们能进食并消化猎物，但这通常出于偶然。大多数鲲保持无知与冷漠，将自己隐藏于黑暗中，无视周围任何的生命迹象，除了偶尔在受到惊扰时会发怒。</p>\n<p>鲲在冰冷黑暗的海底狩猎。但是，如果它照到阳光，鲲就会开始明白，它生活在一个不同的，更大的世界里。当群鸟或鱼群投下斑驳的光影时，鲲可能会对自己的孤独感到厌倦，或者对上方的世界感到好奇。</p>"
        },
        "Animated Kite": {
            "name": "活化风筝 Animated Kite",
            "ac": "破损时AC13；构装护甲",
            "prototypeToken": {
                "name": "活化风筝"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "publicNotes": "<p>活化风筝非常适合做间谍，可以从极远处进行观察，尽管许多风筝更像是宠物。风筝本身是一种简单的手工艺品，很容易制作和销毁，使用盖在精致竹框上附魔纸张制成。更高级的风筝可以装饰上各种符文，使施法者可以看到或听到远处的声音。</p>",
            "items": {
                "Construct Armor (Hardness 1)": {
                    "name": "构装护甲 Construct Armor (硬度 1)",
                    "description": "<p>与普通的物体一样，活化风筝同样拥有硬度。硬度可以减少其所受到的任何伤害，其数值等同于硬度的数值。一旦活化风筝的生命值降低至一半以下，或是受到重击伤害后，其构装护甲将会破损，其AC降低至13。</p>"
                },
                "Attach Line": {
                    "name": "连线 Attach Line",
                    "description": "<p>活化风筝将它的线交给一名有一只空手的相邻盟友。风筝会一直保持连接，直到该生物松手或风筝飞离60尺外。在他们之间的生物可以通过成功命中的造成任意数量挥砍伤害的打击，对抗AC 13来切断连线。</p>"
                },
                "Sawing Line": {
                    "name": "锯线 Sawing Line",
                    "description": "<p><strong>需求</strong> 活化风筝与一名盟友连线</p>\n<hr />\n<p><strong>效果</strong> 风筝与其盟友之间连线中的每个生物受到@Damage[1d6[slashing]]伤害（@Check[type:reflex|dc:16|basic:true]豁免）。</p>"
                }
            }
        },
        "Shui Gui": {
            "items": {
                "Water-Bound Curse": {
                    "name": "Water-Bound Curse",
                    "description": "<p>The shui gui is bound to the body of water in which it died. It's unable to move further than 120 feet from the edge of the water.</p>"
                },
                "Void Healing": {
                    "name": "Void Healing",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.NegativeHealing]</p>"
                },
                "Rejuvenation": {
                    "name": "Rejuvenation",
                    "description": "<p>When the shui gui is destroyed, it reforms after [[/br 2d4 #days]]{2d4 days} within the body of water it's bound to, fully healing. It can be permanently destroyed if the body of the shui gui who originally died in the water can be found and laid to rest.</p>"
                },
                "Ti Shõn": {
                    "name": "Ti Shõn",
                    "description": "<p><strong>触发</strong> A creature @UUID[Compendium.pf2e.conditionitems.Item.kWc1fhmv9LBiTuei]{Grabbed} by the shui gui dies of suffocation</p>\n<hr />\n<p><strong>效果</strong> Ripping the spirit of its drowned victim out of the target's body, the shui gui enters the corpse to take the original owner's place. The shui gui then returns to life at the edge of its body of water as if it had been the target of a successful resurrect ritual, except it has the appearance of the target rather than its original body. After a week, the spirit of the drowned creature becomes a shui gui. The new spirit can't be raised from the dead by normal magical means until they've been destroyed as a shui gui.</p>"
                },
                "Drag Under": {
                    "name": "Drag Under",
                    "description": "<p>The shui gui Swims at half Speed, along with any creature it has @UUID[Compendium.pf2e.conditionitems.Item.kWc1fhmv9LBiTuei]{Grabbed}.</p>"
                },
                "Drown the Living": {
                    "name": "Drown the Living",
                    "description": "<p><strong>需求</strong> The target must be holding its breath and be @UUID[Compendium.pf2e.conditionitems.Item.kWc1fhmv9LBiTuei]{Grabbed} by the shui gui</p>\n<hr />\n<p><strong>效果</strong> The shui gui tightens its grip. The target must succeed at a @Check[type:fortitude|dc:24] save or immediately lose [[/br 1d4 #actions]]{1d4 actions} worth of air (or twice that on a critical failure).</p>"
                },
                "Ghostly Grasp": {
                    "name": "Ghostly Grasp",
                    "description": "<p>A shui gui can @UUID[Compendium.pf2e.actionspf2e.Item.PMbdMWc2QroouFGD]{Grapple} corporeal creatures despite being incorporeal. The shui gui uses its Athletics check to Grapple as normal but can't use Athletics for other actions that require corporeal contact, like @UUID[Compendium.pf2e.actionspf2e.Item.SjmKHgI7a5Z9JzBx]{Force Open} or @UUID[Compendium.pf2e.actionspf2e.Item.ge56Lu1xXVFYUnLP]{Trip}.</p>"
                }
            },
            "prototypeToken": {
                "name": "Shui Gui"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Shui Gui",
            "hp": "void healing, rejuvenation"
        },
        "Gau Cho Rong": {
            "items": {
                "Subsumed Traits": {
                    "name": "归属特征 Subsumed Traits",
                    "description": "<p>在完全消化一顿饱餐之后，空心熊会从该生物上获得一个特征，直到其下一次饱腹。获得动物特征的空心熊会获得60尺的灵敏嗅觉作为模糊感官，而获得两栖或水栖特征的空心熊获得25尺游泳速度。类人特征的空心熊获得反应打击反应动作。如火焰这样的特征会给空心熊的抗力添加该伤害类型。其他特征具有的效果由GM决定。</p>"
                },
                "Ambush": {
                    "name": "伏击 Ambush",
                    "description": "<p><strong>需求</strong> 空心熊正在躲藏，且一个未侦测到它的生物处于其20尺内</p>\n<hr />\n<p><strong>效果</strong> 空心熊朝该生物行走。一旦生物处于触及范围内，空心熊对其进行一次打击。对于此次攻击目标生物陷入@UUID[Compendium.pf2e.conditionitems.Item.AJh5ex99aV6VTggg]{措手不及 Off-Guard}。</p>"
                },
                "Devour": {
                    "name": "吞噬 Devour",
                    "description": "<p><strong>需求</strong> 空心熊上一个动作为成功的颚咬打击</p>\n<hr />\n<p><strong>效果</strong> 目标受到@Damage[1d6[persistent,bleed]]伤害。空心熊从该生物的血液中获得一些知识，教会它理解和说出该生物掌握的所有语言，持续1分钟，它会用目标声音的扭曲版说话。在此期间，空心熊在对该生物@UUID[Compendium.pf2e.actionspf2e.Item.2u915NdUyQan6uKF]{挫败士气 Demoralize}的威吓检定上获得+2环境加值。</p>"
                },
                "Full Belly": {
                    "name": "饱腹 Full Belly",
                    "description": "<p>当空心熊吃饱时，这需要吃下一整只中型生物或6负载的肉，它就会变得平和，甚至贪玩。它在伪装成普通太阳熊的欺骗检定和DC上自动取33的结果，但会失去其抗力。空心熊可以保持饱腹状态8小时。</p>"
                },
                "Reactive Strike (Humanoid Subsumed Trait Only)": {
                    "name": "反应打击 Reactive Strike (仅限类人归属特征)",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.ReactiveStrike]</p>"
                }
            },
            "prototypeToken": {
                "name": "空心熊"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "空心熊 Gau Cho Rong",
            "publicNotes": "<p>篝火故事里空心熊起源于偷猎者猎物的幽灵前来复仇，是鬼婆捏造的爪牙，或是被诅咒的野兽，对在不该去的地方乱逛的小孩的肉上了瘾。它们有个令人不安的绰号“空心熊”，很容易被误认为它们善良的表亲，太阳熊。它们身高只有 3 英尺多一点，舌头又长又软，吃饱时像可爱的小熊，但当它们开始饥饿和空虚时，就会变成骇物。饥饿的空心熊皮毛会变得松弛，直到看起来只剩下一袋皮毛中的脆弱骨骼，就像一个被剥去填充物的旧玩偶。空心熊会蠕动和呜咽，引诱同情的受害者或投机的猎人。当这些目标靠近时，其他空心熊就会从树枝上落下来，扑向猎物的背部和脸部，当它们用钩状长爪攻击猎物时，松软的皮毛会使大多数攻击变得迟钝。吃饱喝足后，空心熊又恢复了可爱的样子。就这样，它们继续着嬉戏、狩猎、偷懒、杀戮、玩闹和撕咬的生活。</p>"
        },
        "Aoyin": {
            "prototypeToken": {
                "name": "獓因"
            },
            "items": {
                "Horn Toss": {
                    "name": "角抛 Horn Toss",
                    "description": "<p>獓因行走并进行一次角抵打击。如果此次打击命中，目标被向獓因所选方向抛投20尺。</p>"
                },
                "Scent (Precise) 30 feet": {
                    "name": "灵敏嗅觉 (精确) 30 尺",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.Scent]</p>"
                },
                "Bloodsense (Precise) 60 feet": {
                    "name": "血液感知 (精确) 60 尺",
                    "description": "<p>獓因可以用精确感官侦测到所列范围内暴露的血液，包括受到持续流血伤害的生物。</p>"
                },
                "Driven by Hunger": {
                    "name": "饥饿驱使 Driven by Hunger",
                    "description": "<p><strong>触发</strong> 獓因在对抗情绪效果的豁免上失败或成功</p>\n<hr />\n<p><strong>效果</strong> 獓因的饥饿感强到足以掩盖其他任何情绪。獓因改为在豁免上大成功。如果40尺内有生物受到持续流血伤害，獓因还可以行走至多其速度，向目标直线前进，以寻找最近的食物来源。</p>"
                },
                "Mountain Stride": {
                    "name": "山地行走 Mountain Stride",
                    "description": "<p>獓因不会因为雪地或山地地形导致的困难地形阻碍，它也不需要@UUID[Compendium.pf2e.actionspf2e.Item.M76ycLAqHoAgbcej]{保持平衡 Balance}来移动通过这些条件所创造的不稳表面。</p>"
                },
                "Trample": {
                    "name": "践踏 Trample",
                    "description": "<p>中型，蹄击，@Check[type:reflex|dc:29|basic:true]</p>\n<hr />\n<p>@Localize[PF2E.NPC.Abilities.Glossary.Trample]</p>"
                }
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "獓因 Aoyin",
            "publicNotes": "<p>獓因看起来像是牛，身体苍白，长着四只角，毛发像稻草一样粗糙。虽然这种独居的大型野兽与普通的耕牛有几分相似，但它是一种极具攻击性和领地意识的食肉动物，会跟踪并吞食猎物。獓因栖息在高山上，很少被普通人目击。不过在寒冷的冬天，獓因可能会下山寻找食物，从而与附近的聚居地发生可怕的遭遇。据说一头獓因便能消灭整座村庄的人口，而它的饥饿一旦得到满足，就会退回到附近的山中。一头獓因，甚至一群这种生物，主要受到饥饿和其他本能冲动的驱使。在它的自然栖息地之外，偶尔也会被那些嗜血成性的人豢养。即使有魔法控制，被圈养的獓因更有可能背叛饲养者，而不是服从命令。然而，作为一种不受控制的武器，饥饿的獓因会对大多数社区构成可怕的威胁。某些偏远地区的传说称，獓因的咆哮能会让那些不幸听到的人陷入饥饿和暴力的狂热之中。村庄会被内讧所吞噬，甚至没有任何迹象表明有獓因进入其边界。虽然这种生物的强大变种可能拥有这种能力，这些故事的灵感大多来自于那些了解獓因秘密的人所掌握的可怕魔法，并在村庄被魔法蛊惑或普通的内讧而崩溃时传播开来。</p>"
        },
        "Yeongno": {
            "items": {
                "equipment-Wooden Pipe": {
                    "name": "Wooden Pipe"
                },
                "Goldsense (Precise) 100 feet": {
                    "name": "Goldsense (Precise) 100 feet",
                    "description": "<p>The yeongno can detect the presence, location, and approximate value of gold within 120 feet.</p>"
                },
                "Fortune's Favor": {
                    "name": "Fortune's Favor",
                    "description": "<p><strong>Frequency</strong> once per day</p>\n<hr />\n<p><strong>效果</strong> A target creature within 30 feet must succeed at a @Check[type:will|dc:25] save or gain the effects of @UUID[Compendium.pf2e.spells-srd.Item.dN8QBNuTiaBHCKUe]{Cursed Metamorphosis}, being polymorphed into a pig whose girth is determined by the target's wealth. After 24 hours, the target can end this effect using a Dismiss action, at which point the yeongno becomes aware that the effect has ended. A yeongno can use Fortune's Favor only if no targets are currently under its effects.</p>"
                },
                "Money is Pain": {
                    "name": "Money is Pain",
                    "description": "<p><strong>需求</strong> The target is carrying at least 100 gp worth of precious metals</p>\n<hr />\n<p><strong>效果</strong> The yeongno crushes a creature it can see with the weight of their wealth. Apparitions of gold coins approximating the wealth of the target materialize and pummel the target from all sides. The target attempts a @Check[type:will|dc:25] save.</p>\n<hr />\n<p><strong>大成功</strong> The target is unaffected.</p>\n<p><strong>成功</strong> The target is @UUID[Compendium.pf2e.conditionitems.Item.xYTAsEpcJE1Ccni3]{Slowed 1} for 1 round.</p>\n<p><strong>失败</strong> The target takes @Damage[3d6[persistent,mental]] damage and is slowed 1 as long as the damage continues. The effect immediately ends if they're carrying less than 100 gp worth of precious metals.</p>\n<p><strong>大失败</strong> As failure, except any flat checks to remove the persistent damage automatically fail.</p>"
                },
                "Swallow Whole": {
                    "name": "Swallow Whole",
                    "description": "<p>Medium, @Damage[(3d6+6)[bludgeoning]], Rupture [20]</p>\n<hr />\n<p>@Localize[PF2E.NPC.Abilities.Glossary.SwallowWhole]</p>"
                }
            },
            "prototypeToken": {
                "name": "Yeongno"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Yeongno",
            "publicNotes": "<p>Neither human nor beast yet resembling both, yeongno (yeong-no) are creatures that once were denizens of heaven but were cast out, down to the mortal Universe, due to their own greed. Yeongno claim to have once been celestial dragons and wear elongated dragon masks with full-body wraps decorated with scale patterns in honor of this claim—though no one has been able to confirm the veracity of this belief. As they wander, they hold a willow pipe in their mouths, producing a distinct \"bibi\" sound that often heralds their appearance.</p>\n<p>Despite their reputation as monsters who eat people, yeongno are welcomed by the poor and oppressed, who see the creatures as wise and just. Yeongno believe that by eating 100 wealthy individuals who abuse their wealth or who accumulated their wealth by underhanded or exploitative means, they can atone for their own greed, allowing them to ascend back into heaven. A corrupt and greedy individual can escape their fate of being eaten by a yeongno by giving away all of their wealth and agreeing to be transformed into a pig for one year. If the person can endure one year living as a pig in the care of a household they once harmed, the yeongno will spare them.</p>"
        },
        "Aso Berang": {
            "items": {
                "Watch over Evil": {
                    "name": "监视邪恶 Watch over Evil",
                    "description": "<p><strong>触发</strong> 犬熊30尺内的某个生物施法</p>\n<hr />\n<p><strong>效果</strong> 犬熊对触发生物进行一次幽火打击。如果打击命中具有分体怪特征的生物，或则重击，触发动作被打断。</p>"
                },
                "At-Will Spells": {
                    "name": "随意施法 At-Will Spells",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.AtWillSpells]</p>"
                },
                "Phantom Flames": {
                    "name": "魅影火焰 Phantom Flames",
                    "description": "<p>犬熊的火焰既是虚体又是实体。每当犬熊造成火焰伤害时，它可以改为造成精魂伤害。犬熊的火焰不会点燃植物或物体，除非犬熊想要这么做。</p>"
                },
                "Scent (Imprecise) 120 feet": {
                    "name": "灵敏嗅觉 (模糊) 120 尺",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.Scent]</p>"
                },
                "Change Shape": {
                    "name": "变身 Change Shape",
                    "description": "<p>犬熊变形成任意中型或更小体型类人生物的外貌。在此形态下，犬熊无法使用獠牙打击，其爪打击变为造成钝击伤害的拳头打击，并失去触及特征。</p>"
                },
                "Cleanse the Forest": {
                    "name": "净化森林 Cleanse the Forest",
                    "description": "<p>犬熊攻击每个附近的敌人，速度快得根本看不出它有移动过，只能看到他们的轮廓在微微闪动。犬熊行走靠近一名敌人，尝试一次近战打击。如果成功命中，犬熊可以行走并尝试打击一名不同敌人。如果第二次攻击成功，它尝试行走并打击第三名敌人。一旦其打击失败（或在第三次打击成功后），犬熊行走回开始所处空间。</p>"
                }
            },
            "prototypeToken": {
                "name": "犬熊"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "犬熊 Aso Berang",
            "publicNotes": "<p>森林深处有一些长着獠牙大嘴的巨大生物。它们的面容激发了天夏各地用于盛大节日的各种长牙恶魔面具的灵感。这些野兽在民那塔岛被称为犬熊，或者熊犬。顾名思义，它们就像体型庞大的熊。然而，犬熊并不只是体型庞大，魅力无穷的动物，很多人说它们是森林精魂之王和守护神。生活在它们守护的森林之外的人们常常把它们尊崇为保护神。这些守护者只有在他们居住的森林面临危险或他们需要什么东西时才会出现在普通人面前。当他们出现时，犬熊会以高大威猛的人类形象出现，散发出威严的气势。犬熊有锋利无比的爪子，会定期脱落，而且它们足够强壮，可以爬到树上追捕试图从树上逃跑的女巫。犬熊通常会攻击那些它们认为心灵不洁或对森林构成潜在威胁的访客。不幸的是，要接受这种审判通常只需要忘记履行适当的尊重和敬畏仪式。</p>"
        },
        "Imugi": {
            "prototypeToken": {
                "name": "螭龙"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "螭龙 Imugi",
            "publicNotes": "<p>螭龙是有着巨大魔法潜能的类龙巨蛇，能够飞升成另一种形态。虽然有些帝龙生来便是帝龙了，但目前游荡在天夏的许多帝龙都是飞升而来的螭龙——尽管他们会攻击任何如此声称的人。</p>\n<p>要变成帝龙，螭龙必须照顾一枚锦鲤卵一千年。来自被培育的卵的力量足以驱动龙族飞升仪式，而剩余的力量会将锦鲤转化为螭龙，继续循环。螭龙会变成哪种帝龙取决于他们在何处培育的锦鲤卵。螭龙尤其喜欢鱼鳍长的锦鲤，而天夏的锦鲤养殖户已经学会将这些蝴蝶锦鲤鱼其他锦鲤分开饲养，因为螭龙扑下来抢走想要的卵时，往往会带走大量的水——还有锦鲤。</p>\n<p>虽然螭龙对降雨和风暴有一定的掌控力，但大多数螭龙的力量还不足以真正控制天气。许多螭龙都以善行著称，有些村庄甚至会依赖螭龙在溪流和湖泊中觅食，在生长季节带来降雨。螭龙的脾气就像他们化成的龙一样千差万别，一些螭龙因其急躁的脾气演变成暴躁或傲慢，而把人当成虫子一样撵到一边。虽然有些人可能会认为刻薄的螭龙已经堕落，并声称他们可以通过某种方式得到净化，但螭龙只是把自己看得比普通生物更高，认为没有理由向他们认为低人一等的人隐瞒自己的本性。</p>",
            "items": {
                "Nesting": {
                    "name": "筑巢 Nesting",
                    "description": "<p>在蝴蝶锦鲤卵周围盘绕1分钟，螭龙就会指定它为自己选定的继承者，这会授予螭龙对这枚卵的常驻关照术效果。如果鱼卵被毁坏或无法存活，该螭龙在一周后可以用此能力选择一枚新锦鲤卵。</p>"
                },
                "Parental Wrath": {
                    "name": "家长之怒 Parental Wrath",
                    "description": "<p><strong>触发</strong> 某个生物对螭龙选定的锦鲤卵造成伤害，或在卵40尺内结束回合</p>\n<hr />\n<p><strong>效果</strong> 螭龙朝触发生物行走或游泳。如果他在移动结束时处于该生物的触及范围内，他对其尝试一次近战打击。</p>"
                },
                "Constrict": {
                    "name": "紧勒 Constrict",
                    "description": "<p>@Damage[(2d8+4)[bludgeoning]], @Check[type:fortitude|dc:25|basic:true]</p>\n<hr />\n<p>@Localize[PF2E.NPC.Abilities.Glossary.Constrict]</p>"
                },
                "Floodwaters": {
                    "name": "洪水 Floodwaters",
                    "description": "<p>水流冲向前方@Template[type:line|distance:60]范围，造成@Damage[4d6[bludgeoning]]伤害（@Check[type:reflex|dc:25|basic:true]豁免）。豁免失败且未@UUID[Compendium.pf2e.conditionitems.Item.kWc1fhmv9LBiTuei]{受擒 Grabbed}于螭龙的生物被推离10尺。</p>"
                },
                "Storm Veil": {
                    "name": "风暴帷幕 Storm Veil",
                    "description": "<p>螭龙将附近的降水扭转成冻雨与风的旋涡状帷幕。他在任何形式的雾和雨中都会获得隐蔽。</p>"
                }
            }
        },
        "Caterpillar Carriage": {
            "prototypeToken": {
                "name": "毛虫车"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "毛虫车 Caterpillar Carriage",
            "items": {
                "Tremorsense (Imprecise) 100 feet": {
                    "name": "震颤感知 (模糊) 100 尺",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.Tremorsense]</p>"
                },
                "Like Clockwork": {
                    "name": "宛如发条 Like Clockwork",
                    "description": "<p><strong>触发</strong> 毛虫车获得@UUID[Compendium.pf2e.conditionitems.Item.xYTAsEpcJE1Ccni3]{缓慢 Slowed}或@UUID[Compendium.pf2e.conditionitems.Item.dfCMdR4wnpbYNTix]{震慑 Stunned}状态</p>\n<hr />\n<p><strong>效果</strong> 毛虫车获得@UUID[Compendium.pf2e.conditionitems.Item.nlCjDvLMf2EkV2dl]{迅捷 Quickened}状态，持续1轮。</p>"
                },
                "Constrict": {
                    "name": "紧勒 Constrict",
                    "description": "<p>@Damage[(4d10+4)[bludgeoning]], @Check[type:fortitude|dc:40|basic:true]</p>\n<hr />\n<p>@Localize[PF2E.NPC.Abilities.Glossary.Constrict]</p>"
                },
                "Rescue": {
                    "name": "救援 Rescue",
                    "description": "<p>毛虫车吸收触及范围内一个自愿构装体。该构装体不再独立存在，直到毛虫车以一个交互动作释放它，或毛虫车被摧毁。</p>"
                },
                "Rock Tunneler": {
                    "name": "穿岩者 Rock Tunneler",
                    "description": "<p>毛虫车可以用20尺速度掘地穿越坚固岩石。如果它愿意的话还能留下一条隧道，并且它通常也会这么做。</p>"
                },
                "Trample": {
                    "name": "践踏 Trample",
                    "description": "<p>超大型或更小体型，车轮，@Check[type:reflex|dc:40|basic:true]</p>\n<hr />\n<p>@Localize[PF2E.NPC.Abilities.Glossary.Trample]</p>"
                }
            }
        },
        "Inkdrop": {
            "prototypeToken": {
                "name": "墨滴"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "墨滴 Inkdrop",
            "publicNotes": "<p>并非所有手工艺品都用于战争。墨滴是一种被施法者使用的潜入者，用来了解秘密或篡改文件。墨滴能化身成拳头大小的一滴墨，在一页纸上滑行，改变文字或将其完全删除，从而对国政造成毁灭性的影响。</p>",
            "items": {
                "Perfect Memory": {
                    "name": "完美记忆 Perfect Memory",
                    "description": "<p>墨滴可以记住它物理移动通过时所有墨水的确切图案。</p>"
                },
                "Blotting": {
                    "name": "擦除墨迹 Blotting",
                    "description": "<p>当生物使墨滴受擒或被束缚，它能够通过一个交互动作来抹掉墨滴从而摧毁它。</p>"
                },
                "Blinding Ink": {
                    "name": "致盲墨 Blinding Ink",
                    "description": "<p>被墨滴的伪足重击的生物会因墨汁陷入目盲，直到其使用一个交互动作擦干眼睛。</p>"
                },
                "Ink Blot": {
                    "name": "墨迹 Ink Blot",
                    "description": "<p>墨滴在一平方尺的表面上留下它记住的图案。如果表面上已存在非魔法墨水，墨滴会擦除掉非魔法墨水。</p>"
                }
            }
        },
        "Manananggal": {
            "prototypeToken": {
                "name": "马纳南加尔"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "马纳南加尔 Manananggal",
            "publicNotes": "<p>马纳南加尔是一种白天像类人生物生活而半夜却吸食他们的邪恶怪物。为了隐藏自身的邪恶，这些生物会伪装成普通人——一般是隐士或者怪人——然后从他们身边社区中挑选出下一个在夜幕降临时袭击的目标。马纳南加尔使用它们细长、中空的舌头从受害者的重要器官，例如肝脏，吸食受害者的血液，因此留下的奇怪血痕使得人们难以断定死者死亡的具体原因。这一般会导致疑惑、猜疑与不信任在社区蔓延，其也正是马纳南加尔所乐于见到的。当他们飞行时，马纳南加尔会发出独特的声音，人们因此也将其称为“滴答-滴答”，而深受其害的社区会一听到这种提示音就陷入恐惧的混乱中。</p>\n<p>马纳南加尔和其他种类的分体怪 ，例如庞南加兰一样具有食人、躯体分离的特性，但一些特性让他们与众不同。例如，庞南加兰喜欢醋味甚至用醋洗澡，而马纳南加尔却对醋味深恶痛绝。</p>",
            "items": {
                "Light Blindness": {
                    "name": "强光致盲 Light Blindness",
                    "description": "<p>@Localize[PF2E.NPC.Abilities.Glossary.LightBlindness]</p>"
                },
                "Blood Drain": {
                    "name": "饮血 Blood Drain",
                    "description": "<p><strong>需求</strong> @UUID[Compendium.pf2e.conditionitems.Item.kWc1fhmv9LBiTuei]{受擒 Grabbed}于马纳南加尔</p>\n<hr />\n<p><strong>效果</strong> 马纳南加尔驱动它的舌头去吸取被擒抱生物的鲜血。造成@Damage[4d6]伤害，并且马纳南加尔获得等同于所造成伤害数值的临时生命值。被马纳南加尔吸取血量的生物@UUID[Compendium.pf2e.conditionitems.Item.4D2KBtexWXa6oUMR]{流失 Drained 1}直到它得到治疗（任何方式和数值）。</p>"
                },
                "Separated Body": {
                    "name": "躯体分离 Separated Body",
                    "description": "<p>马纳南加尔一般会模仿活着的类人生物。在第一眼看来，其外形不像异怪并且在他模仿时他的欺骗技能 DC 获得+4状态加值。但是在夜晚时，马纳南加尔可以使用一个具有操作特征的3动作行动，将他上半身与下半身撕裂开来，遗留的下半身失去力量不能自理，但是使得上半身可以自由飞行。马纳南加尔可以在任何时候分离躯体，但是它在白天时分离会有被进一步伤害的风险。</p>\n<p>马纳南加尔的上下半身具有同样数值的 HP。如果他的下半身受到伤害，马纳南加尔会立刻察觉到攻击。在日出后日落前，马纳南加尔每保持分离状态一分钟，下半身受到 2d6 伤害直到它上下半身重新结合或者被摧毁，以先满足为准。</p>"
                }
            }
        },
        "Hopping Head": {
            "prototypeToken": {
                "name": "蹦跳头"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "蹦跳头 Hopping Head",
            "publicNotes": "<p>蹦跳头形似类人生物的头，有时候会有精致的五官，其他时候则只有粗糙的玩具一样的面部。在头的下方是一根弹簧柱，允许蹦跳头自行移动。</p>",
            "items": {
                "Hopping Strike": {
                    "name": "蹦跳打击 Hopping Strike",
                    "description": "<p>蹦跳头跳跃15尺，在此次移动中任意一点进行一次弹簧打击，造成额外@Damage[1d6[bludgeoning]]伤害。</p>"
                }
            }
        },
        "Jiidon": {
            "prototypeToken": {
                "name": "鼠鬼"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "鼠鬼 Jiidon",
            "publicNotes": "<p>根据鼠鬼的传说，很久很久以前，当魔法还比较狂野，秩序还不那么分明的时候，一只会魔法的老鼠吃掉了一个人类丢弃的指甲，于是神赐予了这只老鼠变形为那个人类的复制的能力。无论真假，鼠鬼都是看似普通的老鼠，它们分享着这个故事的祝福。目前还不清楚第一只鼠鬼是在哪里诞生的，因为它们的后代生活在世界各地的老鼠和类人群体中。在原始形态下，鼠鬼很难与普通老鼠区分开来，它们甚至经常在非智慧亲属的带领下找到一个家。</p>\n<p>不过，吃了人形生物丢弃的指甲后，鼠鬼就会变成指甲主人的外貌，在所有明显和外在的方面都与主人相似，但也有一些细微的差别。它们的耳朵稍大，有时会变成一个小点。它们的牙齿一生都在生长，因此必须经常咀嚼石头、树皮和其他坚硬的材料，以锉平牙齿，掩盖它们的真实面目。脸部两侧长出的胡须也需要每天修剪。</p>\n<p>鼠鬼大多无害，但它们的力量却让知晓它们的人感到恐慌。母亲们会训斥孩子不要在夜幕降临后剪指甲，以防潜伏的鼠鬼捡走掉落在黑暗中的指甲片。虽然像老鼠一样小心翼翼，但大多数鼠鬼只想变身，在类人社会中占有一席之地。众所周知，为了减少猜疑，它们会把目标对准那些在邻居中不受欢迎的人。当它们取代一个类人时，它们的感激之情有时会在行动中显露出来，揭示目标已被取代的事实，或者让那些不喜欢原身性格的人对鼠鬼产生好感。</p>\n<p>来自大家族的鼠鬼通常会寻找一个让他们能够修剪指甲的职业，如清洁工或医生，并通过家族传承类人形态的天赋。</p>",
            "items": {
                "Scurrying Retreat": {
                    "name": "仓皇撤退 Scurrying Retreat",
                    "description": "<p><strong>触发</strong> 鼠鬼受到来自打击的伤害</p>\n<p><strong>需求</strong> 它当前正变身成类人形态</p>\n<hr />\n<p><strong>效果</strong> 鼠鬼恢复成鼠形态，并进行攀爬或行走。它在1分钟内不能重新变回类人形态。</p>"
                },
                "Consumed Fragments": {
                    "name": "吞食指甲 Consumed Fragments",
                    "description": "<p>鼠鬼变成其在一周内吃下指甲或类似碎片的中型或更小体型类人生物，获得3环幻象伪装法术效果，来乔装成该生物，持续8小时；这是个变形效果而非幻术效果。一旦鼠鬼以此方式变身成过某生物，那它必须再次吃下该生物的指甲才能再次变身成后者。如果鼠鬼连续三个晚上吃下某个特定类人生物的指甲，它就能随意变身成该类人生物，但从此以后不能用此能力模仿其他任何类人生物。</p>"
                },
                "Sneak Attack": {
                    "name": "偷袭 Sneak Attack",
                    "description": "<p>鼠鬼对@UUID[Compendium.pf2e.conditionitems.Item.AJh5ex99aV6VTggg]{措手不及 Off-Guard}的生物造成额外1d6精准伤害。</p>"
                },
                "Tactical Gnaw": {
                    "name": "战术啃咬 Tactical Gnaw",
                    "description": "<p>鼠鬼能用它那几乎坚不可摧的牙齿咬碎哪怕是最坚硬的护甲，让对手变得不堪一击。鼠鬼进行一次颚打击。成功命中时，如果目标穿戴着不高于硬度10的护甲，则护甲变为破损。此次打击不会继续伤害已经破损的护甲。</p>"
                }
            }
        },
        "Orchid Mantis Swarm": {
            "prototypeToken": {
                "name": "Orchid Mantis Swarm"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Orchid Mantis Swarm",
            "publicNotes": "<p>Few creatures appear as beautiful as the orchid mantises. Their elegant form and coloration resemble flowers, and many people adopt the delicate creatures as short-lived pets. While these mundane insects aren't dangerous to humanoids, they can still bring down prey several times their own size. Unfolding from their flowery pose, orchid mantises lash out with blinding speed, even chasing foraging butterflies with their sharp-toothed arms and powerful bite.</p>\n<hr />\n<p>Some mantises have unusually strong connections to elemental power. Though they lack the training to cultivate this energy, when orchid mantises gather at a place of abundant food or overflowing natural energy, they can bring trees to bloom in the depths of winter or turn any stretch of ground into a garden. Despite their beauty, gathering in large groups only seems to exacerbate the mantises' tempers. Although the mantises are individually harmless, anyone disturbing the countless false blossoms is likely to be recognized as food, no matter their size.</p>",
            "items": {
                "Floral Camouflage": {
                    "name": "Floral Camouflage",
                    "description": "<p>When Hiding, the orchid mantis swarm is @UUID[Compendium.pf2e.conditionitems.Item.DmAIPqOBomZ7H95W]{Concealed} by any amount of leaves or petals, even if they aren't thick enough to make other creatures concealed.</p>"
                },
                "Biting Blossom": {
                    "name": "Biting Blossom",
                    "description": "<p>Each enemy in the swarm's space takes @Damage[3d6[piercing]] damage (@Check[type:reflex|dc:24|basic:true] save). Creatures that fail this save also take @Damage[1d4[persistent,bleed]] damage.</p>"
                },
                "Drifting Petals": {
                    "name": "Drifting Petals",
                    "description": "<p>The swarm Flies. Each creature whose space it moves through must attempt a @Check[type:will|dc:24] save or be transfixed by their blossom-like bodies.</p>\n<hr />\n<p><strong>大成功</strong> No effect.</p>\n<p><strong>成功</strong> The creature is @UUID[Compendium.pf2e.conditionitems.Item.TkIyaNPgTZFBCCuh]{Dazzled} for 1 round.</p>\n<p><strong>失败</strong> The creature is dazzled and @UUID[Compendium.pf2e.conditionitems.Item.e1XGnhKNSQIm5IXg]{Stupefied 1} for 1 round.</p>\n<p><strong>大失败</strong> The creature is @UUID[Compendium.pf2e.conditionitems.Item.XgEqL1kFApUbl5Z2]{Blinded} and @UUID[Compendium.pf2e.conditionitems.Item.e1XGnhKNSQIm5IXg]{Stupefied 2} for 1 round.</p>"
                }
            }
        },
        "Giant Orchid Mantis": {
            "prototypeToken": {
                "name": "Giant Orchid Mantis"
            },
            "data": {
                "placeHolder": "placeHolder"
            },
            "name": "Giant Orchid Mantis",
            "publicNotes": "<p>Few creatures appear as beautiful as the orchid mantises. Their elegant form and coloration resemble flowers, and many people adopt the delicate creatures as short-lived pets. While these mundane insects aren't dangerous to humanoids, they can still bring down prey several times their own size. Unfolding from their flowery pose, orchid mantises lash out with blinding speed, even chasing foraging butterflies with their sharp-toothed arms and powerful bite.</p>\n<hr />\n<p>These mantises have grown to an unusual size, which makes their camouflage less effective in most environments. As such, they're usually found in areas where a blossom the size of an adult human could pass as normal, in the lushest rainforests, or in lands where rare medicinal herbs are cultivated. Tame giant orchid mantises can also be found protecting those rich enough to afford such decorative guards.</p>",
            "items": {
                "Floral Camouflage": {
                    "name": "Floral Camouflage",
                    "description": "<p>When Hiding, the giant orchid mantis is @UUID[Compendium.pf2e.conditionitems.Item.DmAIPqOBomZ7H95W]{Concealed} by any amount of leaves or petals, even if they aren't thick enough to make other creatures concealed.</p>"
                },
                "Barbed Limbs": {
                    "name": "Barbed Limbs",
                    "description": "<p>The giant orchid mantis makes two leg Strikes. If it hits the same creature with both attacks, that creature is @UUID[Compendium.pf2e.conditionitems.Item.kWc1fhmv9LBiTuei]{Grabbed} until the end of the mantis's next turn.</p>"
                },
                "Sudden Strike": {
                    "name": "Sudden Strike",
                    "description": "<p>In the first round of combat, creatures that haven't acted are @UUID[Compendium.pf2e.conditionitems.Item.AJh5ex99aV6VTggg]{Off-Guard} to the orchid mantis.</p>"
                }
            }
        }
    },
    "mapping": {
        "name": "name",
        "portrait": {
            "path": "img",
            "converter": "npc-portrait-path"
        },
        "token": {
            "path": "prototypeToken",
            "converter": "npc-token-translation"
        },
        "data": {
            "path": "system",
            "converter": "npc-data-translation"
        },
        "items": {
            "path": "items",
            "converter": "npc-item-translation"
        },
        "publicNotes": "system.details.publicNotes",
        "allSaves": "system.attributes.allSaves.value",
        "senses": "system.traits.senses.value",
        "hp": "system.attributes.hp.details",
        "blurb": "system.details.blurb",
        "speed": "system.attributes.speed.details",
        "languages": "system.traits.languages.custom",
        "ac": "system.attributes.ac.details",
        "di": "system.traits.di.custom",
        "prototypeToken": "prototypeToken"
    },
    "label": "天夏世界指南怪物图鉴 Tianxia World Guide Bestiary"
}
